      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ1602.                                             00040017
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: ARQ1602.                          *             00064017
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 25/06/2022                        *             00068012
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E MOSTRAR   *             00069312
      *                 NA SYSOUT A SOMA E OS REGISTROS   *             00069413
      *                 LIDOS, DIFERENCIANDO OS ANALISTAS.*             00070025
      *---------------------------------------------------*             00080026
      *  ARQUIVOS   :                                     *             00090026
      *   DDNAME          I/O             INCLUDE/BOOK    *             00100026
      *   FUNC             I                    -         *             00101026
      *===================================================*             00102026
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT FUNC ASSIGN TO FUNC                                  00133418
                FILE STATUS IS WRK-FS-FUNC.                             00133518
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD FUNC                                                          00137318
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137613
      *-LRECL: 37-*                                                     00137718
       01 FD-FUNC.                                                      00137918
          05 FD-CODIGO        PIC 9(05).                                00138023
          05 FD-NOME          PIC X(20).                                00138118
          05 FD-CODCARGO      PIC X(04).                                00138218
          05 FD-SALARIO       PIC 9(08).                                00138318
                                                                        00138614
      *----------------------------------------------------             00138713
       WORKING-STORAGE                           SECTION.               00138801
      *----------------------------------------------------             00138901
                                                                        00139014
      *----------------------------------------------------             00139115
       01 FILLER              PIC X(70) VALUE                           00139215
              '---------VARIAVEL ACUMULADORAS----'.                     00139318
                                                                        00139415
       77 WRK-REG-LIDOS       PIC 9(02).                                00139518
       77 WRK-REG-LIDOS-A     PIC 9(02).                                00139618
       77 WRK-SAL-TOTAL       PIC 9(09).                                00139718
       77 WRK-SAL-ANALISTAS   PIC 9(09).                                00139821
                                                                        00139915
      *----------------------------------------------------             00140018
       01 FILLER              PIC X(70) VALUE                           00140118
              '---------MASCARAS E SPACES--------'.                     00140222
                                                                        00140318
       77 WRK-SAL-TOTAL-ED    PIC ZZZ.ZZZ.ZZZ.                          00140420
       77 WRK-SAL-ANAL-ED     PIC ZZZ.ZZZ.ZZZ.                          00140520
       77 WRK-SPACES          PIC X(20) VALUE SPACES.                   00140622
       77 WRK-PONTILHADOS     PIC X(35) VALUE ALL '-'.                  00140724
       77 WRK-CABECALHO       PIC X(30) VALUE 'RELATORIO DE CLIENTES'.  00140824
      *----------------------------------------------------             00141015
       01 FILLER              PIC X(70) VALUE                           00150015
              '---------FILE STATUS--------------'.                     00150118
                                                                        00150315
       77 WRK-FS-FUNC         PIC 9(02).                                00151218
                                                                        00152014
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL 10.          00157319
            PERFORM 3000-FINALIZAR.                                     00157414
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT FUNC                                             00159118
              PERFORM 4000-TESTAR-VAZIO.                                00159318
                                                                        00159424
            DISPLAY WRK-PONTILHADOS                                     00159524
            DISPLAY WRK-CABECALHO                                       00159624
            DISPLAY WRK-PONTILHADOS                                     00159724
            DISPLAY WRK-SPACES.                                         00159824
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
            PERFORM 5000-SALARIO-REG-LIDOS.                             00165722
            DISPLAY FD-CODIGO FD-NOME FD-CODCARGO.                      00166224
            READ FUNC.                                                  00167021
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
            CLOSE FUNC                                                  00168919
                                                                        00169215
            MOVE WRK-SAL-TOTAL     TO WRK-SAL-TOTAL-ED                  00169323
            MOVE WRK-SAL-ANALISTAS TO WRK-SAL-ANAL-ED                   00169423
                                                                        00169523
            DISPLAY WRK-SPACES.                                         00169624
            DISPLAY WRK-PONTILHADOS.                                    00169724
            DISPLAY WRK-SPACES.                                         00169824
            DISPLAY 'TOTAL DE REG LIDOS    : ' WRK-REG-LIDOS.           00169923
            DISPLAY 'SALARIO TOTAL         : ' WRK-SAL-TOTAL-ED         00170023
            DISPLAY 'ANALISTAS LIDOS       : ' WRK-REG-LIDOS-A.         00170123
            DISPLAY 'SALARIO DOS ANALISTAS : ' WRK-SAL-ANAL-ED.         00170223
            DISPLAY WRK-SPACES.                                         00170323
            DISPLAY '|-------------------|'                             00170423
            DISPLAY '| FIM DO ARQUIVO!   |'                             00170523
            DISPLAY '|-------------------|'                             00170623
            STOP RUN.                                                   00170723
      *----------------------------------------------------             00170823
       3000-99-FIM.                                  EXIT.              00170923
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00260015
       4000-TESTAR-VAZIO                          SECTION.              00270018
      *----------------------------------------------------             00280015
                                                                        00282015
            IF WRK-FS-FUNC EQUAL 10                                     00290018
              PERFORM 3000-FINALIZAR                                    00291115
            ELSE                                                        00291221
              READ FUNC                                                 00291321
            END-IF.                                                     00292021
                                                                        00293021
      *----------------------------------------------------             00310021
       4000-99-FIM.                                  EXIT.              00320021
      *----------------------------------------------------             00330021
      *----------------------------------------------------             00340022
       5000-SALARIO-REG-LIDOS                     SECTION.              00350022
      *----------------------------------------------------             00360022
                                                                        00370022
            IF FD-CODCARGO EQUAL '0234'                                 00380022
              ADD 1 TO WRK-REG-LIDOS-A                                  00390022
              ADD FD-SALARIO TO WRK-SAL-ANALISTAS                       00400022
            END-IF.                                                     00410022
                                                                        00420022
            ADD 1 TO WRK-REG-LIDOS.                                     00430022
            ADD FD-SALARIO TO WRK-SAL-TOTAL.                            00431022
                                                                        00440022
      *----------------------------------------------------             00450022
       5000-99-FIM.                                  EXIT.              00460022
      *----------------------------------------------------             00470022
