      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ1604.                                             00040031
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: ARQ1604.                          *             00064031
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 27/06/2022                        *             00068030
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E GRAVAR    *             00069330
      *                 EM OUTRO OS ALUNO QUE PASSARAM POR*             00069430
      *                 MEDIA.                            *             00070030
      *---------------------------------------------------*             00080031
      *  ARQUIVOS   :                                     *             00090031
      *   DDNAME          I/O             INCLUDE/BOOK    *             00100031
      *   ALUNOS           I                    -         *             00101031
      *   RELREC           O                    -         *             00101131
      *===================================================*             00102031
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT ALUNOS ASSIGN TO ALUNOS                              00133432
                FILE STATUS IS WRK-FS-ALUNOS.                           00133532
                                                                        00133633
            SELECT RELREC ASSIGN TO RELREC                              00133734
                FILE STATUS IS WRK-FS-RELREC.                           00133834
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD ALUNOS                                                        00137332
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137613
       01 FD-ALUNOS           PIC X(32).                                00137933
                                                                        00138033
                                                                        00138133
       FD RELREC                                                        00138234
           RECORDING MODE IS F.                                         00138334
                                                                        00138434
       01 FD-RELREC           PIC X(32).                                00138534
                                                                        00138634
      *----------------------------------------------------             00138713
       WORKING-STORAGE                           SECTION.               00138801
      *----------------------------------------------------             00138901
      *----------------------------------------------------             00139040
       01 FILLER              PIC X(70) VALUE                           00139140
              '---------GRAVALOG-----------------'.                     00139240
                                                                        00139340
           COPY '#GLOG'.                                                00139440
                                                                        00139540
                                                                        00139640
       77 WRK-ERRORLOG        PIC X(08) VALUE 'ERRORLOG'.               00139740
                                                                        00139826
      *----------------------------------------------------             00139926
       01 FILLER              PIC X(70) VALUE                           00140026
              '---------VARIAVEL DADOS E STATUS--'.                     00140133
                                                                        00140238
                                                                        00140338
       01 WRK-ALUNOS.                                                   00140433
          05 WRK-RA           PIC 9(05).                                00140534
          05 WRK-NOME         PIC X(20).                                00140634
          05 WRK-SERIE        PIC X(03).                                00140734
          05 WRK-MEDIAF       PIC 9(02)V99.                             00140834
                                                                        00140933
       01 WRK-SPACES          PIC X(30) VALUE SPACES.                   00141040
                                                                        00141540
       77 WRK-FS-ALUNOS       PIC 9(02).                                00141640
       77 WRK-FS-RELREC       PIC 9(02).                                00141740
                                                                        00141840
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 7000-TESTA-VAZIO                                    00157336
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-ALUNOS EQUAL 10.        00157432
            PERFORM 3000-FINALIZAR.                                     00157514
            STOP RUN.                                                   00157634
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT ALUNOS                                           00159132
                 OUTPUT RELREC.                                         00159234
                                                                        00159334
            PERFORM 4000-TESTAR-STATUS.                                 00159434
            READ ALUNOS.                                                00159534
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
            MOVE FD-ALUNOS TO WRK-ALUNOS.                               00164240
                                                                        00164340
            IF WRK-MEDIAF GREATER 6                                     00164440
             WRITE FD-RELREC FROM FD-ALUNOS                             00165740
            END-IF.                                                     00167440
                                                                        00167540
            READ ALUNOS.                                                00167632
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
            CLOSE ALUNOS.                                               00168934
            PERFORM 4000-TESTAR-STATUS.                                 00169040
            DISPLAY WRK-SPACES.                                         00169140
            DISPLAY '-----FIM DE PROCESSAMENTO----'.                    00170040
      *----------------------------------------------------             00170823
       3000-99-FIM.                                  EXIT.              00170923
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00260015
       4000-TESTAR-STATUS                         SECTION.              00270034
      *----------------------------------------------------             00280015
            EVALUATE TRUE                                               00281035
             WHEN WRK-FS-ALUNOS NOT EQUAL 0                             00290035
               MOVE '4000'                TO WRK-SECAO                  00291135
               MOVE 'ERRO NO OPEN ALUNOS' TO WRK-MENSAGEM               00291236
               MOVE WRK-FS-ALUNOS         TO WRK-STATUS                 00291335
               PERFORM 7000-TRATA-ERROS                                 00291435
             WHEN WRK-FS-RELREC NOT EQUAL 0                             00291635
               MOVE '4000'                TO WRK-SECAO                  00291735
               MOVE 'ERRO NO OPEN RELREC' TO WRK-MENSAGEM               00291836
               MOVE WRK-FS-ALUNOS         TO WRK-STATUS                 00291935
               PERFORM 7000-TRATA-ERROS                                 00292035
            END-EVALUATE.                                               00293035
      *----------------------------------------------------             00310021
       4000-99-FIM.                                  EXIT.              00320021
      *----------------------------------------------------             00330021
      *----------------------------------------------------             00340034
       7000-TESTA-VAZIO                           SECTION.              00350035
      *----------------------------------------------------             00360034
            IF WRK-FS-ALUNOS EQUAL 10                                   00370035
              DISPLAY 'FIM DO ARQUIVO'                                  00380035
              GO TO 3000-FINALIZAR                                      00390035
            END-IF.                                                     00400034
      *----------------------------------------------------             00410034
       5000-99-FIM.                                  EXIT.              00420034
      *----------------------------------------------------             00430034
      *----------------------------------------------------             00440035
       7000-TRATA-ERROS                           SECTION.              00450035
      *----------------------------------------------------             00460035
            MOVE 'FR16LVSR'   TO    WRK-PROGRAMA.                       00470039
            CALL WRK-ERRORLOG USING WRK-DADOS.                          00480040
            DISPLAY WRK-DADOS.                                          00490039
            GOBACK.                                                     00500039
      *----------------------------------------------------             00510035
       5000-99-FIM.                                  EXIT.              00520035
      *----------------------------------------------------             00530035
