      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ1601.                                             00040012
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: ARQ1601.                          *             00064012
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 25/06/2022                        *             00068012
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E MOSTRAR   *             00069312
      *                 NA SYSOUT OS REGISTROS LIDOS      *             00069417
      *                                                   *             00070017
      *---------------------------------------------------*             00090020
      *  ARQUIVOS   :                                     *             00100020
      *   DDNAME          I/O             INCLUDE/BOOK    *             00101020
      *   CLIENTES         I                    -         *             00102020
      *===================================================*             00103020
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT CLIENTES ASSIGN TO CLIENTES                          00133413
                FILE STATUS IS WRK-FS-CLIENTES.                         00133513
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD CLIENTES                                                      00137313
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137613
      *-LRECL: 46-*                                                     00137714
       01 FD-CLIENTES.                                                  00137914
          05 FD-AGENCIA       PIC 9(04).                                00138014
          05 FD-CONTA         PIC 9(05).                                00138114
          05 FD-NOME          PIC X(30).                                00138214
          05 FD-VALOR         PIC 9(04)V99.                             00138314
          05 FD-TIPO-OPERACAO PIC X(01).                                00138414
             88 FD-TIPO-B  VALUES 'C' 'D'.                              00138514
                                                                        00138614
      *----------------------------------------------------             00138713
       WORKING-STORAGE                           SECTION.               00138801
      *----------------------------------------------------             00138901
                                                                        00139014
      *----------------------------------------------------             00139115
       01 FILLER              PIC X(70) VALUE                           00139215
              '---------VARIAVEL DE MENSAGEM-----'.                     00139315
                                                                        00139415
       77 WRK-MSG             PIC X(14) VALUE SPACES.                   00139515
       77 WRK-MSG-OPEN        PIC X(14) VALUE 'STATUS OPEN : '.         00139615
       77 WRK-MSG-READ        PIC X(14) VALUE 'STATUS READ : '.         00139715
       77 WRK-MSG-CLOSE       PIC X(14) VALUE 'STATUS CLOSE: '.         00139815
                                                                        00139915
      *----------------------------------------------------             00140015
       01 FILLER              PIC X(70) VALUE                           00150015
              '---------FILE STATUS--------------'.                     00150115
                                                                        00150315
       77 WRK-FS-CLIENTES     PIC 9(02).                                00151014
                                                                        00152014
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-CLIENTES EQUAL 10.      00157314
            PERFORM 3000-FINALIZAR.                                     00157414
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT CLIENTES                                         00159114
             MOVE WRK-MSG-OPEN TO WRK-MSG.                              00159215
              PERFORM 4000-IMPRIME-STATUS.                              00159315
                                                                        00159415
            IF WRK-FS-CLIENTES EQUAL 00                                 00159515
              PERFORM 5000-TESTAR-VAZIO                                 00159715
              MOVE WRK-MSG-READ TO WRK-MSG                              00159815
              PERFORM 4000-IMPRIME-STATUS                               00159915
            ELSE                                                        00160015
              DISPLAY 'ERRO NO ARQUIVO'                                 00160115
              STOP RUN                                                  00160215
            END-IF.                                                     00160315
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
                                                                        00164515
            DISPLAY ' REGISTRO: ' FD-CLIENTES.                          00164616
                                                                        00165816
            READ CLIENTES.                                              00166016
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
            CLOSE CLIENTES                                              00168914
            MOVE WRK-MSG-CLOSE TO WRK-MSG.                              00169015
             PERFORM 4000-IMPRIME-STATUS.                               00169115
                                                                        00169215
            DISPLAY '|-------------------|'                             00169316
            DISPLAY '| FIM DO ARQUIVO!   |'                             00169516
            DISPLAY '|-------------------|'                             00169616
                                                                        00169816
            STOP RUN.                                                   00169914
      *----------------------------------------------------             00170006
       3000-99-FIM.                                  EXIT.              00170106
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00180015
       4000-IMPRIME-STATUS                        SECTION.              00190015
      *----------------------------------------------------             00200015
            IF WRK-FS-CLIENTES EQUAL 00                                 00210015
              DISPLAY '|-------------------|'                           00211015
              DISPLAY '|' WRK-MSG WRK-FS-CLIENTES '   |'                00212015
              DISPLAY '|-------------------|'                           00213015
            END-IF.                                                     00214015
      *----------------------------------------------------             00230015
       4000-99-FIM.                                  EXIT.              00240015
      *----------------------------------------------------             00250015
      *----------------------------------------------------             00260015
       5000-TESTAR-VAZIO                          SECTION.              00270015
      *----------------------------------------------------             00280015
            READ CLIENTES                                               00281015
                                                                        00282015
            IF WRK-FS-CLIENTES EQUAL 10                                 00290015
              PERFORM 3000-FINALIZAR                                    00291115
            END-IF.                                                     00292015
                                                                        00293015
      *----------------------------------------------------             00310015
       5000-99-FIM.                                  EXIT.              00320015
      *----------------------------------------------------             00330015
