      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ1603.                                             00040025
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: ARQ1603.                          *             00064025
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 25/06/2022                        *             00068012
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E MOSTRAR   *             00069312
      *                 NA SYSOUT A LISTA DE FUNCIONARIOS *             00069430
      *                 REGISTROS LIDOS E SETOR INVALIDO  *             00070030
      *---------------------------------------------------*             00080031
      *  ARQUIVOS   :                                     *             00090031
      *   DDNAME          I/O             INCLUDE/BOOK    *             00100031
      *   FUNC             I                    -         *             00101031
      *===================================================*             00102031
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT FUNC ASSIGN TO FUNC                                  00133418
                FILE STATUS IS WRK-FS-FUNC.                             00133518
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD FUNC                                                          00137318
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137613
       01 FD-FUNC             PIC X(45).                                00137926
                                                                        00138614
      *----------------------------------------------------             00138713
       WORKING-STORAGE                           SECTION.               00138801
      *----------------------------------------------------             00138901
                                                                        00139026
      *----------------------------------------------------             00139126
       01 FILLER              PIC X(70) VALUE                           00139226
              '---------VARIAVEL DE DADOS--------'.                     00139326
                                                                        00139426
      *-LRECL: 45-*                                                     00139527
       01 WRK-FUNC.                                                     00139626
          05 WRK-IDFUNC       PIC 9(05).                                00139726
          05 WRK-NOMEFUNC     PIC X(30).                                00139826
          05 WRK-SETORFUNC    PIC X(04).                                00139926
          05 WRK-SALFUNC      PIC 9(06).                                00140026
                                                                        00140728
      *----------------------------------------------------             00140828
       01 FILLER              PIC X(70) VALUE                           00140928
              '---------VARIAVEL ACUMULADORAS----'.                     00141028
                                                                        00141128
       77 WRK-REG-LIDOS       PIC 9(02).                                00141228
       77 WRK-REG-LIDOS-INV   PIC 9(02).                                00141328
       77 WRK-SAL-TOTAL       PIC 9(06).                                00141428
                                                                        00141528
      *----------------------------------------------------             00141628
       01 FILLER              PIC X(70) VALUE                           00141728
              '---------MASCARAS E SPACES--------'.                     00141828
                                                                        00141928
       77 WRK-SAL-TOTAL-ED    PIC ZZZ.ZZZ.ZZZ.                          00142028
       77 WRK-SPACES          PIC X(20) VALUE SPACES.                   00142128
       77 WRK-PONTILHADOS     PIC X(35) VALUE ALL '-'.                  00142228
       77 WRK-CABECALHO       PIC X(30) VALUE 'LISTA DE FUNCIONARIOS'.  00142328
                                                                        00142428
      *----------------------------------------------------             00143028
       01 FILLER              PIC X(70) VALUE                           00150015
              '---------FILE STATUS--------------'.                     00150118
                                                                        00150315
       77 WRK-FS-FUNC         PIC 9(02).                                00151218
                                                                        00152014
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL 10.          00157319
            PERFORM 3000-FINALIZAR.                                     00157414
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT FUNC                                             00159118
              PERFORM 4000-TESTAR-VAZIO.                                00159318
                                                                        00159426
      *-----CABECALHO-                                                  00159526
            DISPLAY WRK-PONTILHADOS                                     00159624
            DISPLAY WRK-CABECALHO                                       00159724
            DISPLAY WRK-PONTILHADOS                                     00159824
            DISPLAY WRK-SPACES.                                         00159924
                                                                        00160026
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
            PERFORM 5000-TESTE-SETOR.                                   00165732
                                                                        00167427
            READ FUNC.                                                  00167528
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
            CLOSE FUNC                                                  00168919
                                                                        00169215
            MOVE WRK-SAL-TOTAL     TO WRK-SAL-TOTAL-ED                  00169323
                                                                        00169523
            DISPLAY WRK-SPACES.                                         00169624
            DISPLAY WRK-PONTILHADOS.                                    00169724
            DISPLAY WRK-SPACES.                                         00169824
            DISPLAY 'TOTAL DE REG LIDOS VALIDOS   : ' WRK-REG-LIDOS.    00169932
            DISPLAY 'TOTAL DE REG LIDOS INVALIDOS : ' WRK-REG-LIDOS-INV.00170032
            DISPLAY 'SALARIO TOTAL(SEM INVALIDOS) : ' WRK-SAL-TOTAL-ED  00170127
            DISPLAY WRK-SPACES.                                         00170323
            DISPLAY '|-------------------|'                             00170423
            DISPLAY '| FIM DO ARQUIVO!   |'                             00170523
            DISPLAY '|-------------------|'                             00170623
            STOP RUN.                                                   00170723
      *----------------------------------------------------             00170823
       3000-99-FIM.                                  EXIT.              00170923
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00260015
       4000-TESTAR-VAZIO                          SECTION.              00270018
      *----------------------------------------------------             00280015
                                                                        00282015
            IF WRK-FS-FUNC EQUAL 10                                     00290018
              PERFORM 3000-FINALIZAR                                    00291115
            ELSE                                                        00291228
              READ FUNC                                                 00291328
            END-IF.                                                     00292021
                                                                        00293021
      *----------------------------------------------------             00310021
       4000-99-FIM.                                  EXIT.              00320021
      *----------------------------------------------------             00330021
      *----------------------------------------------------             00340022
       5000-TESTE-SETOR                           SECTION.              00350028
      *----------------------------------------------------             00360022
            MOVE FD-FUNC TO WRK-FUNC                                    00370028
                                                                        00380228
            IF WRK-SETORFUNC EQUAL 'TISP'                               00380329
              DISPLAY 'FUNCIONARIO COM ID: ' WRK-IDFUNC ' TEM SETOR'    00380432
                                                        ' INVALIDO'     00380532
              ADD 1 TO WRK-REG-LIDOS-INV                                00400429
            ELSE                                                        00400632
              ADD 1 TO WRK-REG-LIDOS                                    00400732
              ADD WRK-SALFUNC TO WRK-SAL-TOTAL                          00400832
              DISPLAY WRK-FUNC                                          00400932
            END-IF.                                                     00401029
      *----------------------------------------------------             00450022
       5000-99-FIM.                                  EXIT.              00460022
      *----------------------------------------------------             00470022
      *----------------------------------------------------             00480032
       5000-TESTE-SETOR-ALT                       SECTION.              00490032
      *----------------------------------------------------             00500032
                                                                        00500232
            IF WRK-SETORFUNC NOT EQUAL 'TISP'                           00501032
            MOVE FD-FUNC TO WRK-FUNC                                    00502032
              ADD 1 TO WRK-REG-LIDOS                                    00520032
              ADD WRK-SALFUNC TO WRK-SAL-TOTAL                          00530032
              DISPLAY WRK-FUNC                                          00540032
            ELSE                                                        00550032
              DISPLAY '** FUNCIONARIO ACIMA TEM SETOR INVALIDO **'      00551032
            END-IF.                                                     00552032
      *----------------------------------------------------             00610032
       5000-99-FIM.                                  EXIT.              00620032
      *----------------------------------------------------             00630032
