      *=============================================================    00010000
       IDENTIFICATION                                      DIVISION.    00020000
      *=============================================================    00030000
       PROGRAM-ID. ERRORLOG.                                            00031000
                                                                        00032000
      *=============================================================    00033000
      * AUTOR:    LUCIANO GUIMARAES                                     00040000
      * EMPRESA:  FOURSYS                                               00050000
      * DATA:     19/05/2022                                            00060000
      * OBJETIVO: MODULO GRAVA LOG                                      00070000
      *                                                                 00071000
      *                                                                 00072000
      *                                                                 00073000
                                                                        00080000
      *=============================================================    00090000
       ENVIRONMENT                                         DIVISION.    00100000
      *=============================================================    00110000
       INPUT-OUTPUT                                         SECTION.    00111000
       FILE-CONTROL.                                                    00112000
           SELECT ERROS ASSIGN TO JCLCLI                                00113000
           FILE STATUS IS WRK-FS-ERROS.                                 00114000
                                                                        00120000
      *=============================================================    00130000
       DATA                                                DIVISION.    00140000
      *=============================================================    00150000
       FILE                                                 SECTION.    00151000
                                                                        00152000
       FD ERROS                                                         00152100
           RECORDING MODE IS F                                          00152200
           BLOCK CONTAINS 0 RECORDS.                                    00152300
                                                                        00154000
       01 FD-ERROS PIC X(58).                                           00154100
                                                                        00154200
      *------------------------------------------------------------     00155000
       WORKING-STORAGE                                      SECTION.    00160000
                                                                        00161000
       77 WRK-FS-ERROS     PIC 9(02).                                   00162000
       77 WRK-SYS-DATE     PIC 9(08).                                   00162100
       77 WRK-SYS-TIME     PIC X(06).                                   00162200
                                                                        00163000
      *------------------------------------------------------------     00164100
       LINKAGE                                             SECTION.     00164200
                                                                        00164300
       01 COMMAREA.                                                     00164400
           02 LNK-PROGNAME PIC X(08).                                   00164500
           02 LNK-SECTION  PIC X(04).                                   00164600
           02 LNK-ERRORMSG PIC X(30).                                   00164700
           02 LNK-FSTATUS  PIC 9(02).                                   00164800
           02 LNK-DATE     PIC 9(08).                                   00164900
           02 LNK-TIME     PIC 9(06).                                   00165000
                                                                        00166000
      *=============================================================    00170000
       PROCEDURE                            DIVISION USING COMMAREA.    00180000
      *=============================================================    00190000
                                                                        00200000
      *------------------------------------------------------------     00210100
       0000-MAIN SECTION.                                               00211000
                                                                        00212000
           PERFORM 1000-INIT.                                           00213000
           PERFORM 2000-PREP-LNK.                                       00214000
                                                                        00215000
           WRITE FD-ERROS.                                              00216000
           CLOSE ERROS.                                                 00217000
           GOBACK.                                                      00218000
                                                                        00219000
       0000-99-FIM. EXIT.                                               00219100
      *------------------------------------------------------------     00219200
                                                                        00220000
      *------------------------------------------------------------     00231000
       1000-INIT                                           SECTION.     00232000
                                                                        00233000
           OPEN EXTEND ERROS.                                           00234000
                                                                        00235000
       1000-99-FIM.                                           EXIT.     00236000
      *------------------------------------------------------------     00237000
                                                                        00240000
      *------------------------------------------------------------     00250000
       2000-PREP-LNK                                       SECTION.     00260000
                                                                        00291000
           ACCEPT WRK-SYS-DATE FROM DATE YYYYMMDD.                      00291100
           ACCEPT WRK-SYS-TIME FROM TIME.                               00291200
                                                                        00291300
           MOVE   WRK-SYS-DATE TO LNK-DATE.                             00291400
           MOVE   WRK-SYS-TIME TO LNK-TIME.                             00291500
           MOVE   COMMAREA TO FD-ERROS.                                 00300000
                                                                        00310000
       2000-99-FIM.                                          EXIT.      00320000
      *------------------------------------------------------------     00330000
