      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16COVS.                                            00040033
                                                                        00061009
      *====================================================*            00062009
      *   AUTOR....:LUCIANO GUIMARAES                      *            00063009
      *   ANALISTA.:IVAN SANCHES                           *            00063110
      *   DATA ....:29/06/2022                             *            00063242
      *----------------------------------------------------*            00063309
      *   OBJETIVO:REALIZA UM CALL ENTRE DOIS PROGRAMAS    *            00063450
      *            FAZ A LEITURA DOS DADOS E RETORNA NO    *            00063550
      *            CICS.                                   *            00063850
      *                                                    *            00063950
      *----------------------------------------------------*            00064010
      *   BASE DE DADOS:                                   *            00066010
      *   TABELA.VSAM                                      *            00067033
      *    ------              I/O        INCLUDE/BOOK     *            00068010
      *====================================================*            00080009
      *====================================================             00081036
       ENVIRONMENT                               DIVISION.              00082036
      *====================================================             00083036
       CONFIGURATION                              SECTION.              00090036
                                                                        00091036
       SPECIAL-NAMES.                                                   00100036
           DECIMAL-POINT IS COMMA.                                      00110036
                                                                        00110136
      *====================================================             00111036
       DATA                                      DIVISION.              00119510
      *====================================================             00119636
       WORKING-STORAGE                           SECTION.               00138001
      *----------------------------------------------------             00138101
                                                                        00139414
            COPY DFHAID.                                                00139622
                                                                        00139710
      *----------------------------------------------------             00143610
       01 FILLER              PIC X(70) VALUE                           00143710
              '---------FILE STATUS E DADOS----------'.                 00143833
                                                                        00143944
       01 WRK-DADOS.                                                    00145133
          05 WRK-CHAVE        PIC X(05) VALUE SPACES.                   00145247
          05 WRK-NOME         PIC X(30) VALUE SPACES.                   00145347
          05 WRK-SETOR        PIC X(04) VALUE SPACES.                   00145447
          05 WRK-SALARIO      PIC X(10) VALUE SPACES.                   00145547
          05 WRK-DATAADM.                                               00145651
            10 WRK-DATADIA   PIC X(02).                                 00145751
            10 FILLER        PIC X(01) VALUE '/'.                       00145851
            10 WRK-DATAMES   PIC X(02).                                 00145951
            10 FILLER        PIC X(01) VALUE '/'.                       00146051
            09 WRK-DATAANO   PIC X(04).                                 00146151
          05 WRK-EMAIL        PIC X(40) VALUE SPACES.                   00146247
                                                                        00146333
       77 WRK-RESP            PIC S9(04) COMP.                          00146437
                                                                        00146550
      *----------------------------------------------------             00146650
       LINKAGE                                   SECTION.               00146750
      *----------------------------------------------------             00146850
        01 DFHCOMMAREA.                                                 00146950
           05 LNK-CHAVE     PIC X(05).                                  00147050
           05 LNK-NOME      PIC X(30).                                  00147150
           05 LNK-SETOR     PIC X(04).                                  00147250
           05 LNK-SALARIO   PIC X(10).                                  00147350
           05 WRK-DATAADM.                                              00147451
            10 LNK-DATADIA   PIC X(02).                                 00147551
            10 FILLER        PIC X(01) VALUE '/'.                       00147651
            10 LNK-DATAMES   PIC X(02).                                 00147751
            10 FILLER        PIC X(01) VALUE '/'.                       00147851
            10 LNK-DATAANO   PIC X(04).                                 00147951
           05 LNK-EMAIL     PIC X(40).                                  00148050
           05 LNK-STATUS    PIC X(01).                                  00149050
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR.                                   00157344
            PERFORM 2000-PROCESSAR                                      00157444
      *----------------------------------------------------             00158444
       0000-99-FIM.                               EXIT.                 00158700
      *----------------------------------------------------             00158800
      *****************************************************             00162325
      *             I N I C I A L I Z A R                 *             00162425
      *****************************************************             00162525
      *----------------------------------------------------             00166527
       1000-INICIALIZAR                           SECTION.              00166627
      *----------------------------------------------------             00166727
            MOVE LNK-CHAVE TO WRK-CHAVE.                                00166950
      *----------------------------------------------------             00168927
       1000-99-FIM.                                 EXIT.               00169027
      *----------------------------------------------------             00169127
      *----------------------------------------------------             00169227
      *****************************************************             00169327
      *               P R O C E S S A R                   *             00169427
      *****************************************************             00170027
      *----------------------------------------------------             00171727
       2000-PROCESSAR                             SECTION.              00171827
      *----------------------------------------------------             00171927
            EXEC CICS READ                                              00172050
                      FILE('FUNC')                                      00172150
                      RIDFLD(WRK-CHAVE)                                 00172250
                      INTO(WRK-DADOS)                                   00172350
                      RESP(WRK-RESP)                                    00172450
            END-EXEC.                                                   00172550
                                                                        00172744
            IF WRK-RESP EQUAL DFHRESP(NORMAL)                           00172850
               MOVE WRK-NOME     TO LNK-NOME                            00172950
               MOVE WRK-SETOR    TO LNK-SETOR                           00173050
               MOVE WRK-SALARIO  TO LNK-SALARIO                         00173150
               MOVE WRK-DATADIA  TO LNK-DATADIA                         00173252
               MOVE WRK-DATAMES  TO LNK-DATAMES                         00173352
               MOVE WRK-DATAANO  TO LNK-DATAANO                         00173452
               MOVE WRK-EMAIL    TO LNK-EMAIL                           00173550
               MOVE '1'          TO LNK-STATUS                          00173650
            ELSE                                                        00173750
               MOVE '2'          TO LNK-STATUS                          00173850
            END-IF.                                                     00173950
                                                                        00174050
            EXEC CICS                                                   00174150
              RETURN                                                    00175050
            END-EXEC.                                                   00176050
      *----------------------------------------------------             00176732
       2000-99-FIM.                                EXIT.                00176832
      *----------------------------------------------------             00176906
