      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CIP2.                                            00040033
                                                                        00061009
      *====================================================*            00062009
      *   AUTOR....:LUCIANO GUIMARAES                      *            00063009
      *   ANALISTA.:IVAN SANCHES                           *            00063110
      *   DATA ....:28/06/2022                             *            00063233
      *----------------------------------------------------*            00063309
      *   OBJETIVO:INVOCAR UM MAPA BMS CICS RELACIONADO    *            00063414
      *            COM UM ARQUIVO VSAM E EXECUTAR AS       *            00063533
      *            FUNCOES ESCOLHIDAS PELO USUARIOS        *            00063814
      *----------------------------------------------------*            00064010
      *   BASE DE DADOS:                                   *            00066010
      *   TABELA.VSAM                                      *            00067033
      *    ------              I/O        INCLUDE/BOOK     *            00068010
      *====================================================*            00080009
      *====================================================             00081036
       ENVIRONMENT                               DIVISION.              00082036
      *====================================================             00083036
       CONFIGURATION                              SECTION.              00090036
                                                                        00091036
       SPECIAL-NAMES.                                                   00100036
           DECIMAL-POINT IS COMMA.                                      00110036
                                                                        00110136
      *====================================================             00111036
       DATA                                      DIVISION.              00119510
      *====================================================             00119636
       WORKING-STORAGE                           SECTION.               00138001
      *----------------------------------------------------             00138101
                                                                        00139414
            COPY F16CIM1.                                               00139514
            COPY DFHAID.                                                00139622
                                                                        00139710
      *----------------------------------------------------             00143610
       01 FILLER              PIC X(70) VALUE                           00143710
              '---------FILE STATUS E DADOS----------'.                 00143833
                                                                        00144027
       01 WRK-DADOS.                                                    00144133
          05 WRK-CHAVE        PIC X(05).                                00144233
          05 WRK-NOME         PIC X(30).                                00144333
          05 WRK-SETOR        PIC X(04).                                00144433
          05 WRK-SALARIO      PIC X(10).                                00144534
          05 WRK-DATADIA      PIC X(02).                                00144840
          05 FILLER           PIC X(01) VALUE '-'.                      00144940
          05 WRK-DATAMES      PIC X(02).                                00145040
          05 FILLER           PIC X(01) VALUE '-'.                      00145140
          05 WRK-DATAANO      PIC X(04).                                00145240
          05 WRK-EMAIL        PIC X(40).                                00145333
                                                                        00145933
       77 WRK-RESP            PIC S9(04) COMP.                          00146037
       77 WRK-SAL-ED          PIC ZZ.ZZZ.ZZ9,99.                        00146135
                                                                        00146234
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR.                                   00157326
            PERFORM 2000-PROCESSAR.                                     00157526
                                                                        00157614
            EXEC CICS                                                   00157714
              RETURN TRANSID ('T162')                                   00157833
            END-EXEC.                                                   00157914
      *----------------------------------------------------             00158300
       0000-99-FIM.                               EXIT.                 00158400
      *----------------------------------------------------             00158500
      *****************************************************             00162325
      *             I N I C I A L I Z A R                 *             00162425
      *****************************************************             00162525
      *----------------------------------------------------             00166527
       1000-INICIALIZAR                           SECTION.              00166627
      *----------------------------------------------------             00166727
            PERFORM 0500-CICS-SEND.                                     00166827
      *----------------------------------------------------             00166927
       1000-99-FIM.                                 EXIT.               00167027
      *----------------------------------------------------             00167127
      *----------------------------------------------------             00167227
      *****************************************************             00167327
      *               P R O C E S S A R                   *             00167427
      *****************************************************             00167527
      *----------------------------------------------------             00171727
       2000-PROCESSAR                             SECTION.              00171827
      *----------------------------------------------------             00171927
            PERFORM 0600-CICS-RECEIVE.                                  00172127
                                                                        00172227
      *SAIDA:F10*                                                       00172328
            IF EIBAID = ':'                                             00172427
              PERFORM 0400-CICS-RETURN                                  00172528
            END-IF.                                                     00172827
                                                                        00172927
      *CONSULTA:F5*                                                     00173028
            IF EIBAID = '5'                                             00174027
              PERFORM 2100-READ-MOVE-VSAM                               00174533
            END-IF.                                                     00174627
                                                                        00174729
      *INCLUIR:F6*                                                      00174829
      *     IF EIBAID = '6'                                             00174933
      *       PERFORM 2200-INSERT-MOVE-VSAM                             00175033
      *     END-IF.                                                     00175133
                                                                        00175232
      *DELETAR:F7*                                                      00175332
      *     IF EIBAID = '7'                                             00175433
      *       PERFORM 2300-DELETE-MOVE-VSAM                             00175533
      *     END-IF.                                                     00175633
                                                                        00175732
            PERFORM 0700-CICS-SEND-FIM.                                 00175832
      *----------------------------------------------------             00175932
       2000-99-FIM.                                EXIT.                00176032
      *----------------------------------------------------             00176106
      *----------------------------------------------------             00176228
       0400-CICS-RETURN                           SECTION.              00176328
      *----------------------------------------------------             00176428
            EXEC CICS                                                   00176528
              RETURN                                                    00176628
            END-EXEC.                                                   00176728
      *----------------------------------------------------             00177328
       0400-99-FIM.                                 EXIT.               00177428
      *----------------------------------------------------             00177528
      *----------------------------------------------------             00177628
       0500-CICS-SEND                             SECTION.              00177728
      *----------------------------------------------------             00177828
            EXEC CICS SEND                                              00177928
               MAPSET('F16CIM1')                                        00178028
               MAP('MAPA01')                                            00178128
                ERASE                                                   00178228
               MAPONLY                                                  00178328
            END-EXEC.                                                   00178428
      *----------------------------------------------------             00178528
       0500-99-FIM.                                 EXIT.               00178628
      *----------------------------------------------------             00178728
      *----------------------------------------------------             00178828
       0600-CICS-RECEIVE                          SECTION.              00178928
      *----------------------------------------------------             00179028
            EXEC CICS RECEIVE                                           00179128
              MAPSET('F16CIM1')                                         00179228
              MAP('MAPA01')                                             00179328
              INTO(MAPA01I)                                             00179428
            END-EXEC.                                                   00179528
      *----------------------------------------------------             00179628
       0600-99-FIM.                                 EXIT.               00179728
      *----------------------------------------------------             00179828
      *----------------------------------------------------             00179928
       0700-CICS-SEND-FIM                         SECTION.              00180028
      *----------------------------------------------------             00180128
            EXEC CICS SEND                                              00180228
               MAPSET('F16CIM1')                                        00180328
               MAP('MAPA01')                                            00180428
               DATAONLY                                                 00180528
               FROM(MAPA01O)                                            00180628
            END-EXEC.                                                   00180728
      *----------------------------------------------------             00180828
       0700-99-FIM.                                 EXIT.               00180928
      *----------------------------------------------------             00181028
      *----------------------------------------------------             00181128
       2100-READ-MOVE-VSAM                        SECTION.              00181233
      *----------------------------------------------------             00181328
            MOVE IDI TO WRK-CHAVE                                       00181433
                                                                        00181533
            EXEC CICS READ                                              00181633
                      FILE('FUNC')                                      00181733
                      RIDFLD(WRK-CHAVE)                                 00181833
                      INTO(WRK-DADOS)                                   00181933
                      RESP(WRK-RESP)                                    00182037
            END-EXEC                                                    00182133
                                                                        00182233
            EVALUATE WRK-RESP                                           00182337
              WHEN DFHRESP(NORMAL)                                      00183034
                MOVE WRK-NOME     TO NOMEO                              00184034
                MOVE WRK-SETOR    TO SETORO                             00185034
                MOVE WRK-SALARIO  TO WRK-SAL-ED                         00185234
                MOVE WRK-SAL-ED   TO SALARIOO                           00185334
                MOVE WRK-DATADIA  TO DATADIAO                           00185434
                MOVE WRK-DATAMES  TO DATAMESO                           00185534
                MOVE WRK-DATAANO  TO DATAANOO                           00185634
                MOVE WRK-EMAIL    TO EMAILO                             00188034
                 IF WRK-SALARIO EQUAL ZEROS OR                          00189039
                    WRK-SALARIO NOT NUMERIC                             00189138
                   MOVE '**ATENCAO** INCONSISTENCIA NO SALARIO' TO MSGO 00190034
                 ELSE                                                   00200034
                   MOVE 'FUNCIONARIO ENCONTRADO' TO MSGO                00210034
                 END-IF                                                 00220034
              WHEN DFHRESP(NOTFND)                                      00240034
                MOVE 'FUNCIONARIO INEXISTENTE' TO MSGO                  00250034
              WHEN OTHER                                                00251034
                MOVE 'ERRO ' TO MSGO                                    00252034
                MOVE WRK-RESP TO MSGO(08:04)                            00253037
            END-EVALUATE.                                               00260034
      *----------------------------------------------------             00530028
       2100-99-FIM.                                EXIT.                00540028
      *----------------------------------------------------             00550028
