      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB13.                                            00040007
      *====================================================             00050011
      *             T R E I N A M E N T O                 *             00051011
      *====================================================             00052011
      * PROGRAMA......: FR16CB13.                         *             00053011
      * TIPO..........: OPERACOES ARITIMETICAS - COBOL    *             00054016
      *---------------------------------------------------*             00055011
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056011
      * DATA..........: 03/05/2022                        *             00057011
      * EMPRESA.......: FOURSYS                           *             00058011
      * INSTRUTOR.....: IVAN SANCHES                      *             00059013
      *---------------------------------------------------*             00059111
      * OBJETIVO......: CALCULO DA QUANTIDADE DE VENDAS E *             00059211
      *                 MEDIA MENSAL USANDO COMPUTE       *             00059311
      *                                                   *             00059411
      *----------------------------------------------------             00059511
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                             SECTION.               00090506
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-CODIGO-LOJA PIC 9(03)         VALUE ZEROS.             00091507
          05 WRK-PRODUTO     PIC X(30)         VALUE SPACES.            00091607
          05 WRK-QTD-VENDAS  PIC 9(03)         VALUE ZEROS.             00091707
          05 WRK-VLR-UNID    PIC 9(05)V99      VALUE ZEROS.             00091807
       77 WRK-MEDIA          PIC 9(05)V99 COMP VALUE ZEROS.             00091907
      *-----------------MASCARAS---------------------------             00092011
       77 WRK-MEDIA-ED       PIC ZZ.ZZ9,99.                             00092115
       77 WRK-VLR-UNID-ED    PIC ZZ.ZZ9,99.                             00092215
                                                                        00092310
      *====================================================             00092400
       PROCEDURE                                 DIVISION.              00092500
      *====================================================             00092600
      *****************************************************             00092714
      *          R O T I N A   P R I N C I P A L          *             00092814
      *****************************************************             00092914
      *----------------------------------------------------             00093012
       0000-PRINCIPAL                             SECTION.              00093112
      *----------------------------------------------------             00093212
           PERFORM 1000-INICIALIZAR.                                    00093312
           PERFORM 2000-PROCESSAR.                                      00093412
           PERFORM 3000-FINALIZAR.                                      00093512
           STOP RUN.                                                    00093612
      *----------------------------------------------------             00093712
       0000-99-FIM.                                EXIT.                00093812
      *----------------------------------------------------             00093912
      *****************************************************             00094014
      *             I N I C I A L I Z A R                 *             00094114
      *****************************************************             00094214
      *----------------------------------------------------             00094412
       1000-INICIALIZAR                           SECTION.              00094512
      *----------------------------------------------------             00094612
                                                                        00094712
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094812
                                                                        00094912
      *----------------------------------------------------             00095012
       1000-99-FIM.                                EXIT.                00095112
      *----------------------------------------------------             00095212
      *****************************************************             00095314
      *               P R O C E S S A R                   *             00095414
      *****************************************************             00095514
      *----------------------------------------------------             00095612
       2000-PROCESSAR                             SECTION.              00095712
      *----------------------------------------------------             00095812
                                                                        00095912
           COMPUTE WRK-MEDIA = WRK-QTD-VENDAS * WRK-VLR-UNID / 30.      00096015
           MOVE WRK-VLR-UNID TO WRK-VLR-UNID-ED.                        00096112
           MOVE WRK-MEDIA TO WRK-MEDIA-ED.                              00096212
                                                                        00096312
      *----------------------------------------------------             00096412
       2000-99-FIM.                                EXIT.                00096512
      *----------------------------------------------------             00096612
      *****************************************************             00096714
      *               F I N A L I Z A R                   *             00096814
      *****************************************************             00096914
      *----------------------------------------------------             00097112
       3000-FINALIZAR                             SECTION.              00097212
      *----------------------------------------------------             00097312
           DISPLAY 'CODIGO DA LOJA       : ' WRK-CODIGO-LOJA.           00097412
           DISPLAY 'PRODUTO              : ' WRK-PRODUTO.               00097512
           DISPLAY 'VENDAS MENSAIS       : ' WRK-QTD-VENDAS             00097615
           DISPLAY 'VALOR UNITARIO       : ' WRK-VLR-UNID-ED.           00097712
           DISPLAY 'MEDIA DIARIA         : ' WRK-MEDIA-ED.              00097812
      *----------------------------------------------------             00097912
       3000-99-FIM.                                EXIT.                00098012
      *----------------------------------------------------             00099012
