      *====================================================             00010001
       IDENTIFICATION                            DIVISION.              00020001
      *====================================================             00030001
       PROGRAM-ID. FR16CB02.                                            00040001
      *====================================================             00061005
      *             T R E I N A M E N T O                 *             00062005
      *====================================================             00063005
      * PROGRAMA......: FR16CB02.                         *             00064006
      *---------------------------------------------------*             00066005
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067005
      * DATA..........: 25/04/2022                        *             00068008
      * EMPRESA.......: FOURSYS                           *             00069005
      * INSTRUTOR.....: IVAN SANCHES                      *             00069107
      *---------------------------------------------------*             00069205
      * OBJETIVO......: IMPRESSAO MEU NOME                *             00069305
      *                                                   *             00069405
      *                                                   *             00069505
      *----------------------------------------------------             00069605
      *====================================================             00110001
       ENVIRONMENT                               DIVISION.              00120001
      *====================================================             00130001
       CONFIGURATION                             SECTION.               00171005
       SPECIAL-NAMES.                                                   00172005
           DECIMAL-POINT  IS COMMA.                                     00172105
      *====================================================             00172205
       DATA                                      DIVISION.              00172305
      *====================================================             00172405
       WORKING-STORAGE                           SECTION.               00180002
                                                                        00180105
       77 NOME    PICTURE  X(20) VALUE SPACES.                          00181003
       77 SALARIO PICTURE  9(05) VALUE ZEROS.                           00182003
                                                                        00183002
      *====================================================             00190001
       PROCEDURE                                 DIVISION.              00200001
      *====================================================             00210001
      *****************************************************             00210109
      *          R O T I N A   P R I N C I P A L          *             00210209
      *****************************************************             00210309
      *----------------------------------------------------             00210405
       0000-PRINCIPAL                             SECTION.              00210505
      *----------------------------------------------------             00210605
           PERFORM 1000-INICIALIZAR.                                    00210705
           PERFORM 3000-FINALIZAR.                                      00210805
           STOP RUN.                                                    00210905
      *----------------------------------------------------             00211005
       0000-99-FIM.                                EXIT.                00211105
      *----------------------------------------------------             00211205
      *****************************************************             00211309
      *             I N I C I A L I Z A R                 *             00211409
      *****************************************************             00211509
      *----------------------------------------------------             00211605
       1000-INICIALIZAR                           SECTION.              00211705
      *----------------------------------------------------             00211805
           ACCEPT NOME    FROM SYSIN.                                   00211910
           ACCEPT SALARIO FROM SYSIN.                                   00212010
      *----------------------------------------------------             00212105
       1000-99-FIM.                                EXIT.                00212205
      *----------------------------------------------------             00212305
      *****************************************************             00212409
      *               F I N A L I Z A R                   *             00212509
      *****************************************************             00212609
      *----------------------------------------------------             00212705
       3000-FINALIZAR                             SECTION.              00212805
      *----------------------------------------------------             00212905
           DISPLAY 'MEU NOME... ' NOME.                                 00213005
           DISPLAY 'SALARIO...  ' SALARIO.                              00213105
      *----------------------------------------------------             00213205
       3000-99-FIM.                                EXIT.                00213305
      *----------------------------------------------------             00213405
