      *====================================================             00010001
       IDENTIFICATION                            DIVISION.              00020001
      *====================================================             00030001
       PROGRAM-ID. FR16CB03.                                            00040002
                                                                        00050001
      *====================================================             00051005
      *             T R E I N A M E N T O                 *             00052005
      *====================================================             00053005
      * PROGRAMA......: FR16CB03.                         *             00054006
      *---------------------------------------------------*             00056005
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00057005
      * DATA..........: 25/04/2022                        *             00058010
      * EMPRESA.......: FOURSYS                           *             00059005
      * INSTRUTOR.....: IVAN SANCHES                      *             00059108
      *---------------------------------------------------*             00059205
      * OBJETIVO......: IMPRESSAO DE VARIAVEIS QUEBRANDO  *             00059306
      *                 EM VARIAVEIS MENORES              *             00059406
      *                                                   *             00059506
      *----------------------------------------------------             00059605
                                                                        00100001
      *====================================================             00110001
       ENVIRONMENT                               DIVISION.              00120001
      *====================================================             00130001
       CONFIGURATION                             SECTION.               00140007
       SPECIAL-NAMES.                                                   00150007
           DECIMAL-POINT  IS COMMA.                                     00160007
      *====================================================             00170001
       DATA                                      DIVISION.              00180007
      *====================================================             00181007
       WORKING-STORAGE                           SECTION.               00182007
                                                                        00183007
       01 WRK-DADOS.                                                    00190001
          05 WRK-CODIGO  PIC X(07) VALUE SPACES.                        00200001
          05 WRK-NOME    PIC X(23) VALUE SPACES.                        00210001
          05 WRK-AREA    PIC X(10) VALUE SPACES.                        00211001
          05 WRK-ESTADO  PIC X(02) VALUE SPACES.                        00212001
          05 WRK-SALARIO PIC 9(05) VALUE ZEROS.                         00213001
      *====================================================             00220001
       PROCEDURE                                 DIVISION.              00230001
      *====================================================             00240001
      *****************************************************             00240111
      *          R O T I N A   P R I N C I P A L          *             00240211
      *****************************************************             00240311
      *----------------------------------------------------             00241007
       0000-PRINCIPAL                             SECTION.              00242007
      *----------------------------------------------------             00242107
           PERFORM 1000-INICIALIZAR.                                    00242207
           PERFORM 3000-FINALIZAR.                                      00242407
           STOP RUN.                                                    00242507
      *----------------------------------------------------             00242607
       0000-99-FIM.                                EXIT.                00242707
      *----------------------------------------------------             00242807
      *****************************************************             00242911
      *             I N I C I A L I Z A R                 *             00243011
      *****************************************************             00243111
      *----------------------------------------------------             00243207
       1000-INICIALIZAR                           SECTION.              00243307
      *----------------------------------------------------             00244007
           ACCEPT WRK-DADOS FROM SYSIN.                                 00250007
      *----------------------------------------------------             00320007
       1000-99-FIM.                                EXIT.                00330007
      *----------------------------------------------------             00340007
      *****************************************************             00350011
      *               F I N A L I Z A R                   *             00351011
      *****************************************************             00352011
      *----------------------------------------------------             00360007
       3000-FINALIZAR                             SECTION.              00370007
      *----------------------------------------------------             00380007
           DISPLAY 'MEU CODIGO  : ' WRK-CODIGO.                         00391007
           DISPLAY 'MEU NOME    : ' WRK-NOME.                           00392007
           DISPLAY 'MINHA AREA  : ' WRK-AREA.                           00393007
           DISPLAY 'MEU ESTADO  : ' WRK-ESTADO.                         00394007
           DISPLAY 'MEU SALARIO : ' WRK-SALARIO.                        00395007
      *----------------------------------------------------             00400007
       3000-99-FIM.                                EXIT.                00410007
      *----------------------------------------------------             00420007
