      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB15.                                            00040016
      *====================================================             00050032
      *             T R E I N A M E N T O                 *             00051032
      *====================================================             00052032
      * PROGRAMA......: FR16CB15.                         *             00053032
      *---------------------------------------------------*             00055032
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056032
      * DATA..........: 05/05/2022                        *             00057032
      * EMPRESA.......: FOURSYS                           *             00058032
      * INSTRUTOR.....: IVAN SANCHES                      *             00059033
      *---------------------------------------------------*             00059135
      * OBJETIVO......: CALCULO DO FRETE PARA ESTADOS     *             00059232
      *                 USANDO IF                         *             00059332
      *                                                   *             00060032
      *----------------------------------------------------             00070032
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                             SECTION.               00090506
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-CODIGO    PIC 9(05)    VALUE ZEROS.                    00091516
          05 WRK-PRODUTO   PIC X(20)    VALUE SPACES.                   00091631
          05 WRK-VALOR     PIC 9(08)V99 VALUE ZEROS.                    00091730
          05 WRK-ESTADO    PIC X(02)    VALUE SPACES.                   00091816
                                                                        00091917
      *-----------------CALCULOS--------------------------              00092039
       77 WRK-FRETE        PIC 9(08)V99 COMP VALUE ZEROS.               00092129
       77 WRK-FLAG         PIC 9        VALUE 0.                        00092230
      *-----------------MASCARAS--------------------------              00092639
                                                                        00092739
       77 WRK-FRETE-ED     PIC $ZZ.ZZZ.ZZ9,99.                          00092839
       77 WRK-VALOR-ED     PIC $ZZ.ZZZ.ZZ9,99.                          00092939
                                                                        00093039
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093634
      *          R O T I N A   P R I N C I P A L          *             00093734
      *****************************************************             00093834
      *----------------------------------------------------             00093932
       0000-PRINCIPAL                             SECTION.              00094032
      *----------------------------------------------------             00094132
           PERFORM 1000-INICIALIZAR.                                    00094232
           PERFORM 2000-PROCESSAR.                                      00094332
           PERFORM 3000-FINALIZAR.                                      00094432
           STOP RUN.                                                    00094532
      *----------------------------------------------------             00094632
       0000-99-FIM.                                EXIT.                00094732
      *----------------------------------------------------             00094832
      *****************************************************             00094934
      *             I N I C I A L I Z A R                 *             00095034
      *****************************************************             00095134
      *----------------------------------------------------             00095332
       1000-INICIALIZAR                           SECTION.              00095432
      *----------------------------------------------------             00095532
                                                                        00095632
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095732
                                                                        00095832
      *----------------------------------------------------             00095932
       1000-99-FIM.                                EXIT.                00096032
      *----------------------------------------------------             00096132
      *****************************************************             00096234
      *               P R O C E S S A R                   *             00096334
      *****************************************************             00096434
      *----------------------------------------------------             00096532
       2000-PROCESSAR                             SECTION.              00096632
      *----------------------------------------------------             00096732
           IF WRK-VALOR LESS 1000                                       00096832
              DISPLAY 'FRETE INDISPONIVEL, FAVOR RETIRAR NA LOJA'       00096932
           ELSE                                                         00097032
              IF WRK-ESTADO EQUAL 'SP'                                  00097132
                COMPUTE WRK-FRETE = WRK-VALOR * 0,1                     00097232
                MOVE 1 TO WRK-FLAG                                      00097332
              END-IF                                                    00097432
              IF WRK-ESTADO EQUAL 'RJ'                                  00097532
                COMPUTE WRK-FRETE = WRK-VALOR * 0,15                    00097632
                MOVE 1 TO WRK-FLAG                                      00097732
              END-IF                                                    00097832
              IF WRK-ESTADO EQUAL 'MG'                                  00097932
                COMPUTE WRK-FRETE = WRK-VALOR * 0,20                    00098032
                MOVE 1 TO WRK-FLAG                                      00098132
              END-IF                                                    00098232
                                                                        00098330
              IF WRK-FLAG EQUAL 0                                       00098432
                DISPLAY 'NAO ENTREGAMOS NO SEU ESTADO'                  00098532
                END-IF                                                  00098632
           END-IF.                                                      00098732
                                                                        00098830
           MOVE WRK-FRETE TO WRK-FRETE-ED.                              00098932
           MOVE WRK-VALOR TO WRK-VALOR-ED.                              00099032
                                                                        00099130
      *----------------------------------------------------             00099732
       2000-99-FIM.                                EXIT.                00099832
      *----------------------------------------------------             00099932
      *****************************************************             00100034
      *               F I N A L I Z A R                   *             00100134
      *****************************************************             00100234
      *----------------------------------------------------             00101032
       3000-FINALIZAR                             SECTION.              00102032
      *----------------------------------------------------             00103032
           DISPLAY 'CODIGO DO PRODUTO: ' WRK-CODIGO.                    00103132
           DISPLAY 'PRODUTO          : ' WRK-PRODUTO.                   00103232
           DISPLAY 'VALOR DO PRODUTO : ' WRK-VALOR-ED.                  00103332
           DISPLAY 'ESTADO           : ' WRK-ESTADO.                    00103432
           DISPLAY 'FRETE            : ' WRK-FRETE-ED.                  00103532
      *----------------------------------------------------             00105032
       3000-99-FIM.                                EXIT.                00106032
      *----------------------------------------------------             00107032
