      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB14.                                            00040016
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00061017
      *====================================================             00062017
      * PROGRAMA......: FR16CB14.                         *             00063021
      *---------------------------------------------------*             00065017
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00066017
      * DATA..........: 04/05/2022                        *             00067018
      * EMPRESA.......: FOURSYS                           *             00068017
      * INSTRUTOR.....: IVAN SANCHES                      *             00069019
      *---------------------------------------------------*             00069117
      * OBJETIVO......: CALCULO DA VANTAGEM GASOLINA E AL-*             00069217
      *                 COOL UTILIZANDO IF E DIVIDE       *             00069317
      *                                                   *             00070017
      *----------------------------------------------------             00080017
      *====================================================             00090200
       ENVIRONMENT                                DIVISION.             00090317
      *====================================================             00090400
       CONFIGURATION                               SECTION.             00090517
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                       DIVISION.             00091017
      *====================================================             00091100
       WORKING-STORAGE                             SECTION.             00091217
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-GASOLINA  PIC 9(02)V99 VALUE ZEROS.                    00091511
          05 WRK-ALCOOL    PIC 9(02)V99 VALUE ZEROS.                    00091611
       77 WRK-REL          PIC 9(02)V99 VALUE ZEROS.                    00092312
                                                                        00092412
      *-----------------MASCARAS---------------------------             00092517
                                                                        00092612
       77 WRK-REL-ED       PIC 99,99.                                   00092714
       77 WRK-GASOLINA-ED  PIC 99,99.                                   00092814
       77 WRK-ALCOOL-ED    PIC 99,99.                                   00093014
      *====================================================             00093300
       PROCEDURE                                  DIVISION.             00093417
      *====================================================             00093500
      *****************************************************             00093620
      *          R O T I N A   P R I N C I P A L          *             00093720
      *****************************************************             00093820
      *----------------------------------------------------             00093917
       0000-PRINCIPAL                              SECTION.             00094017
      *----------------------------------------------------             00094117
           PERFORM 1000-INICIALIZAR.                                    00094217
           PERFORM 2000-PROCESSAR.                                      00094317
           PERFORM 3000-FINALIZAR.                                      00094417
           STOP RUN.                                                    00094517
      *----------------------------------------------------             00094617
       0000-99-FIM.                                   EXIT.             00094717
      *----------------------------------------------------             00094817
      *****************************************************             00094920
      *             I N I C I A L I Z A R                 *             00095020
      *****************************************************             00095120
      *----------------------------------------------------             00095317
       1000-INICIALIZAR                            SECTION.             00095417
      *----------------------------------------------------             00095517
                                                                        00095617
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095717
                                                                        00095817
      *----------------------------------------------------             00095917
       1000-99-FIM.                                   EXIT.             00096017
      *----------------------------------------------------             00096117
      *****************************************************             00096220
      *               P R O C E S S A R                   *             00096320
      *****************************************************             00096420
      *----------------------------------------------------             00096617
       2000-PROCESSAR                              SECTION.             00096717
      *----------------------------------------------------             00096817
           MOVE WRK-GASOLINA TO WRK-GASOLINA-ED                         00096912
           MOVE WRK-ALCOOL TO WRK-ALCOOL-ED                             00097012
                                                                        00097112
             IF WRK-GASOLINA IS NUMERIC AND WRK-ALCOOL IS NUMERIC       00097212
                                                                        00097315
               DISPLAY 'VALOR DA GASOLINA : R$' WRK-GASOLINA-ED         00097412
               DISPLAY 'VALOR DO ALCOOL   : R$' WRK-ALCOOL-ED           00097512
                                                                        00097612
               DIVIDE WRK-ALCOOL BY WRK-GASOLINA GIVING WRK-REL         00097714
                 ON SIZE ERROR                                          00097812
                    DISPLAY 'DIVISAO IMPOSSIVEL'                        00097912
                 NOT ON SIZE ERROR                                      00098012
                    MOVE WRK-REL TO WRK-REL-ED                          00098112
                    IF WRK-REL LESS THAN OR EQUAL 0,7                   00098212
                      DISPLAY 'A RELACAO EH DE: ' WRK-REL-ED            00098312
                              'PORTANTO ABASTECA COM ALCOOL'            00098412
                    ELSE                                                00098512
                      DISPLAY 'A RELACAO EH DE: ' WRK-REL-ED            00098612
                              ' PORTANTO ABASTECA COM GASOLINA'         00098715
                    END-IF                                              00098812
               END-DIVIDE                                               00098912
                                                                        00099015
              ELSE                                                      00099113
                DISPLAY 'VALORES INSERIDOS INVALIDOS'                   00099213
             END-IF.                                                    00099323
      *----------------------------------------------------             00099417
       2000-99-FIM.                                   EXIT.             00099517
      *----------------------------------------------------             00099617
      *****************************************************             00099720
      *               F I N A L I Z A R                   *             00099820
      *****************************************************             00099920
      *----------------------------------------------------             00100017
       3000-FINALIZAR                              SECTION.             00100117
      *----------------------------------------------------             00100217
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00101017
      *----------------------------------------------------             00110017
       3000-99-FIM.                                   EXIT.             00120023
      *----------------------------------------------------             00130017
