      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB18.                                            00040041
                                                                        00050052
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00060152
      *====================================================             00061052
      * PROGRAMA......: FR16CB18.                         *             00070052
      * TIPO..........: PRINCIPIOS DO COBOL               *             00071052
      *---------------------------------------------------*             00072052
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00073052
      * DATA..........: 06/05/2022                        *             00074052
      * EMPRESA.......: FOURSYS                           *             00080052
      * INSTRUTOR.....: IVAN SANCHES                      *             00081057
      *---------------------------------------------------*             00082052
      * OBJETIVO......: USO DE VARIAVEL 88 COM IF E ELSE  *             00083053
      *                 PARA DETALHAR TIPO DE OPERACAO    *             00084056
      *                 CONTABIL FOI REALIZADA            *             00085056
      *----------------------------------------------------             00090052
                                                                        00090155
      *====================================================             00090255
       ENVIRONMENT                               DIVISION.              00090355
      *====================================================             00090455
       CONFIGURATION                             SECTION.               00090555
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-DIA        PIC X(02)    VALUE SPACES.                  00091542
          05 WRK-MES        PIC X(02)    VALUE SPACES.                  00091642
          05 WRK-ANO        PIC X(04)    VALUE SPACES.                  00091742
          05 WRK-VALOR      PIC 9(05)V99 VALUE ZEROS.                   00091841
          05 WRK-FINALIDADE PIC X(30)    VALUE SPACES.                  00091942
          05 WRK-TIPO       PIC X(01)    VALUE SPACES.                  00092041
             88 WRK-TIPO-VALIDO VALUE 'C' 'D'.                          00092141
                                                                        00092217
       77 WRK-MEDIA       PIC 9(02)V99 COMP VALUE ZEROS.                00092333
                                                                        00092433
      *=================MASCARAS===========================             00092512
                                                                        00092612
       77 WRK-VALOR-ED     PIC ZZ.ZZ9,99.                               00092743
                                                                        00093016
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093658
      *          R O T I N A   P R I N C I P A L          *             00093758
      *****************************************************             00093858
      *----------------------------------------------------             00093950
       0000-PRINCIPAL                             SECTION.              00094050
      *----------------------------------------------------             00094150
           PERFORM 1000-INICIALIZAR.                                    00094250
           PERFORM 2000-PROCESSAR.                                      00094350
           PERFORM 3000-FINALIZAR.                                      00094450
           STOP RUN.                                                    00094550
      *----------------------------------------------------             00094650
       0000-99-FIM.                                EXIT.                00094750
      *----------------------------------------------------             00094850
      *****************************************************             00094958
      *             I N I C I A L I Z A R                 *             00095058
      *****************************************************             00095158
      *----------------------------------------------------             00095350
       1000-INICIALIZAR                           SECTION.              00095450
      *----------------------------------------------------             00095550
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095650
      *----------------------------------------------------             00095750
       1000-99-FIM.                                EXIT.                00095850
      *----------------------------------------------------             00095950
      *****************************************************             00096058
      *               P R O C E S S A R                   *             00096158
      *****************************************************             00096258
      *----------------------------------------------------             00096350
       2000-PROCESSAR                             SECTION.              00096450
      *----------------------------------------------------             00096550
                                                                        00096641
            IF NOT WRK-TIPO-VALIDO                                      00096754
               DISPLAY 'REGISTRO INVALIDO'                              00096854
            ELSE                                                        00096954
               MOVE WRK-VALOR TO WRK-VALOR-ED                           00097054
               DISPLAY 'DATA       :  ' WRK-DIA '/' WRK-MES '/' WRK-ANO 00097154
               DISPLAY 'VALOR      :R$' WRK-VALOR-ED                    00097254
               DISPLAY 'FINALIDADE :  ' WRK-FINALIDADE                  00097354
                                                                        00097445
               EVALUATE WRK-TIPO                                        00097554
                 WHEN 'C'                                               00097654
                   DISPLAY 'LANCAMENTO :  CREDITO'                      00097754
                 WHEN OTHER                                             00097854
                   DISPLAY 'LANCAMENTO :  DEBITO'                       00097954
               END-EVALUATE                                             00098054
            END-IF.                                                     00098159
      *----------------------------------------------------             00099051
       2000-99-FIM.                                EXIT.                00100051
      *----------------------------------------------------             00110051
      *****************************************************             00111058
      *               F I N A L I Z A R                   *             00112058
      *****************************************************             00113058
      *----------------------------------------------------             00130051
       3000-FINALIZAR                             SECTION.              00140051
      *----------------------------------------------------             00141051
            DISPLAY ' '.                                                00141159
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00142051
      *----------------------------------------------------             00143051
       3000-99-FIM.                                EXIT.                00150051
      *----------------------------------------------------             00160051
                                                                        00180050
      *----------------------------------------------------             00190051
       9000-TRATA-ERROS                            SECTION.             00200051
      *----------------------------------------------------             00210051
      *----------------------------------------------------             00220051
       9000-99-FIM.                                EXIT.                00230051
      *----------------------------------------------------             00240051
