      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16DB04.                                            00040010
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: FR16DB04.                         *             00064010
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 08/06/2022                        *             00068005
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: ACESSAR A TABELA DB2 FUNC, E      *             00069309
      *                 DELETAR UM REGISTRO               *             00069410
      *                                                   *             00070000
      *----------------------------------------------------             00080000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       WORKING-STORAGE                           SECTION.               00138001
      *----------------------------------------------------             00138101
                                                                        00138201
           EXEC SQL                                                     00139001
              INCLUDE #BKFUNC                                           00139101
           END-EXEC.                                                    00139201
                                                                        00139301
           EXEC SQL                                                     00139401
              INCLUDE SQLCA                                             00139501
           END-EXEC.                                                    00139601
                                                                        00139701
      *----------------VARIAVEIS DE APOIO------------------             00139803
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00139910
       77 WRK-SQLCODE         PIC -999.                                 00140006
                                                                        00151003
      *====================================================             00154300
       PROCEDURE                                 DIVISION.              00154400
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
                                                                        00157200
            PERFORM 1000-INICIALIZAR.                                   00157302
            IF WRK-ID IS NUMERIC AND WRK-ID GREATER 0                   00157408
             PERFORM 2000-PROCESSAR                                     00157508
            END-IF.                                                     00157608
            PERFORM 3000-FINALIZAR.                                     00157805
            STOP RUN.                                                   00157905
                                                                        00158000
      *----------------------------------------------------             00158100
       0000-99-FIM.                               EXIT.                 00158200
      *----------------------------------------------------             00158300
      *****************************************************             00158400
      *             I N I C I A L I Z A R                 *             00158500
      *****************************************************             00158600
      *----------------------------------------------------             00158700
       1000-INICIALIZAR                           SECTION.              00158800
      *----------------------------------------------------             00158900
                                                                        00159000
             ACCEPT WRK-ID FROM SYSIN.                                  00159110
                                                                        00159706
      *----------------------------------------------------             00159800
       1000-99-FIM.                                 EXIT.               00159900
      *----------------------------------------------------             00160000
      *****************************************************             00160100
      *               P R O C E S S A R                   *             00160200
      *****************************************************             00160300
      *----------------------------------------------------             00160400
       2000-PROCESSAR                             SECTION.              00160500
      *----------------------------------------------------             00160600
            MOVE WRK-ID TO DB2-ID.                                      00160810
                                                                        00160910
            EXEC SQL                                                    00161010
              DELETE FROM IVAN.FUNC WHERE ID = :DB2-ID                  00161110
            END-EXEC.                                                   00161210
                                                                        00161310
            EVALUATE SQLCODE                                            00161410
             WHEN 0                                                     00161710
              DISPLAY 'REGISTRO DELETADO: ' WRK-ID                      00161811
             WHEN 100                                                   00161910
              DISPLAY 'REGISTRO NAO ENCONTRADO: ' DB2-ID                00162011
             WHEN OTHER                                                 00162110
              MOVE SQLCODE TO WRK-SQLCODE                               00162210
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00162310
             END-EVALUATE.                                              00164010
                                                                        00164500
                                                                        00164600
      *----------------------------------------------------             00164700
       2000-99-FIM.                                EXIT.                00164800
      *----------------------------------------------------             00164900
      *****************************************************             00165000
      *               F I N A L I Z A R                   *             00165100
      *****************************************************             00165200
      *----------------------------------------------------             00165300
       3000-FINALIZAR                             SECTION.              00165400
      *----------------------------------------------------             00165500
                                                                        00165600
            DISPLAY ' '.                                                00165702
            DISPLAY '-FIM DO PROGRAMA-'.                                00165802
                                                                        00165900
      *----------------------------------------------------             00166000
       3000-99-FIM.                                  EXIT.              00166100
      *----------------------------------------------------             00167000
