      *=============================================================*   00010000
       IDENTIFICATION                            DIVISION.              00020000
      *=============================================================*   00030000
                                                                        00040000
       PROGRAM-ID. FR16EX03.                                            00050012
      *=============================================================*   00060000
      *             T R E I N A M E N T O                           *   00061000
      *=============================================================*   00062000
      * PROGRAMA......: FR16EX03.                                   *   00062112
      *-------------------------------------------------------------*   00062200
      * PROGRAMADOR...: LUCIANO GUIMARAES.                          *   00062300
      * DATA..........: 26/05/2022                                  *   00062400
      * EMPRESA.......: FOURSYS                                     *   00062500
      * INSTRUTOR.....: IVAN SANCHES                                *   00062600
      *-------------------------------------------------------------*   00062700
      * OBJETIVO......: BALANCE LINE DOS ARQUIVOS CLIENTES E MOV3105*   00062812
      *                 GRAVACAO DE RELATORIO NO CLI3505 DE ACORDO  *   00062912
      *                 COM A REGRAD DE NEGOCIO                     *   00063012
      *-------------------------------------------------------------*   00064000
      *   ARQUIVOS...:                                              *   00065000
      *    DDNAME              I/O                                  *   00066000
      *    CLIENTES            I                                   *    00067012
      *    MOV3105              I                                   *   00067112
      *    CLI3105              O                                   *   00068012
      *-------------------------------------------------------------*   00070000
      *   MODULOS....:                             INCLUDE/BOOK     *   00080000
      *   GRAVALOG -   TRATAMENTO DE ERROS            GLOG2         *   00090000
      *=============================================================*   00100000
                                                                        00120000
      *=============================================================*   00130000
       ENVIRONMENT                               DIVISION.              00140000
      *=============================================================*   00150000
      *-------------------------------------------------------------*   00160000
       CONFIGURATION                             SECTION.               00170000
      *-------------------------------------------------------------*   00180000
       SPECIAL-NAMES.                                                   00190000
           DECIMAL-POINT IS COMMA.                                      00200000
                                                                        00210000
       INPUT-OUTPUT                              SECTION.               00220000
       FILE-CONTROL.                                                    00230000
            SELECT CLIENTES  ASSIGN TO CLIENTES                         00240012
                FILE STATUS  IS WRK-FS-CLIENTES.                        00250012
                                                                        00251000
            SELECT MOV3105   ASSIGN TO MOV3105                          00260012
                FILE STATUS  IS WRK-FS-MOV3105.                         00261012
                                                                        00261104
            SELECT CLI3105 ASSIGN TO CLI3105                            00262012
                FILE STATUS  IS WRK-FS-CLI3105.                         00263012
      *=============================================================*   00270000
       DATA                                      DIVISION.              00280000
      *=============================================================*   00290000
       FILE                                      SECTION.               00300000
      *-------------------------------------------------------------*   00300100
                                                                        00301000
       FD CLIENTES                                                      00310012
           RECORDING MODE IS F                                          00320000
           BLOCK CONTAINS 0 RECORDS.                                    00340000
                                                                        00350000
       01 FD-CLIENTES.                                                  00351012
          05 FD-CLIENTES-CHAVE.                                         00351112
             10 FD-CLIENTES-AGENCIA    PIC X(04).                       00352012
             10 FD-CLIENTES-CONTA      PIC X(04).                       00353015
          05 FD-CLIENTES-NOME       PIC X(30).                          00354012
          05 FD-CLIENTES-SALDO      PIC 9(08).                          00355012
                                                                        00355100
                                                                        00355200
       FD MOV3105                                                       00355312
           RECORDING  MODE IS F                                         00355400
           BLOCK CONTAINS 0 RECORDS.                                    00355500
                                                                        00355600
       01 FD-MOV3105.                                                   00355712
          05 FD-MOV3105-CHAVE.                                          00355812
             10 FD-MOV3105-AGENCIA    PIC X(04).                        00355912
             10 FD-MOV3105-CONTA      PIC X(04).                        00356015
          05 FD-MOV3105-MOVIMENTO  PIC X(30).                           00356112
          05 FD-MOV3105-VALORMOV   PIC 9(08).                           00356212
          05 FD-MOV3105-TIPOMOV    PIC X(01).                           00356312
                                                                        00357004
                                                                        00358004
       FD CLI3105                                                       00359012
           RECORDING  MODE IS F.                                        00360004
                                                                        00370004
       01 FD-CLI3105.                                                   00380012
          05 FD-CLI3105-AGENCIA    PIC X(04).                           00390012
          05 FD-CLI3105-CONTA      PIC X(04).                           00400015
          05 FD-CLI3105-MOVIMENTO  PIC X(30).                           00410012
          05 FD-CLI3105-SALDO      PIC 9(08).                           00420012
      *-------------------------------------------------------------*   00480000
       WORKING-STORAGE                           SECTION.               00490000
      *-------------------------------------------------------------*   00500000
                                                                        00501000
      *-------------------------------------------------------------*   00501100
       01 FILLER PIC X(45) VALUE                                        00501200
              '------------------#GLOG----------------------'.          00501300
      *-------------------------------------------------------------*   00501400
                                                                        00501500
       COPY '#GLOG'.                                                    00502000
                                                                        00503000
                                                                        00516500
      *-------------------------------------------------------------*   00516600
       01 FILLER PIC X(45) VALUE                                        00516700
              '-----------DADOS E FILE STATUS---------------'.          00516810
      *-------------------------------------------------------------*   00516900
       77 WRK-FS-CLIENTES   PIC 9(02).                                  00520012
       77 WRK-FS-MOV3105    PIC 9(02).                                  00521012
       77 WRK-FS-CLI3105    PIC 9(02).                                  00521112
       77 WRK-ERRORLOG      PIC X(08) VALUE 'ERRORLOG'.                 00521205
       77 WRK-GRAVADOS      PIC 9(02).                                  00521316
       77 WRK-CONTADOR      PIC 9(01) VALUE ZEROS.                      00521415
       77 WRK-SALDOINSU     PIC 9(02) VALUE ZEROS.                      00521515
                                                                        00521615
      *=============================================================*   00540000
       PROCEDURE                                 DIVISION.              00550000
      *=============================================================*   00560000
      ***************************************************************   00570000
      *          R O T I N A   P R I N C I P A L                    *   00571000
      ***************************************************************   00572000
      *--------------------------------------------------------------   00573000
       0000-PRINCIPAL                            SECTION.               00574000
      *--------------------------------------------------------------   00575000
             PERFORM 1000-INICIALIZAR.                                  00580000
             PERFORM 2000-PROCESSAR UNTIL WRK-FS-CLIENTES EQUAL 10 AND  00590012
                                          WRK-FS-MOV3105  EQUAL 10.     00591012
             PERFORM 3000-FINALIZAR.                                    00600000
             STOP RUN.                                                  00610000
      *--------------------------------------------------------------   00611000
       0000-99-FIM.                              EXIT.                  00612000
      *--------------------------------------------------------------   00613000
      ***************************************************************   00614000
      *             I N I C I A L I Z A R                           *   00615000
      ***************************************************************   00616000
      *--------------------------------------------------------------   00617000
       1000-INICIALIZAR                          SECTION.               00618000
      *--------------------------------------------------------------   00619000
             OPEN INPUT CLIENTES MOV3105                                00630012
                 OUTPUT CLI3105.                                        00640012
                  PERFORM 5100-TESTAR-STATUS.                           00640100
                  PERFORM 5200-TESTAR-VAZIO.                            00640207
      *--------------------------------------------------------------   00671000
       1000-99-FIM.                              EXIT.                  00672000
      *--------------------------------------------------------------   00673000
      ***************************************************************   00676900
      *               P R O C E S S A R                             *   00677000
      ***************************************************************   00677100
      *--------------------------------------------------------------   00677200
       2000-PROCESSAR                            SECTION.               00678000
      *--------------------------------------------------------------   00679000
                                                                        00679809
            PERFORM 5500-TESTA-FIM.                                     00679910
                                                                        00680010
            EVALUATE TRUE                                               00681007
             WHEN FD-CLIENTES-CHAVE LESS  FD-MOV3105-CHAVE              00690012
               WRITE FD-CLI3105 FROM FD-CLIENTES                        00700013
                IF WRK-CONTADOR GREATER 0                               00700115
                 ADD 1 TO WRK-GRAVADOS                                  00700215
                 MOVE 0 TO WRK-CONTADOR                                 00700315
                END-IF                                                  00700415
               READ CLIENTES                                            00700513
             WHEN FD-CLIENTES-CHAVE EQUAL FD-MOV3105-CHAVE              00701012
               IF FD-MOV3105-TIPOMOV EQUAL 'C'                          00703013
                 ADD FD-MOV3105-VALORMOV TO FD-CLIENTES-SALDO           00703113
               ELSE                                                     00703213
                 IF FD-CLIENTES-SALDO GREATER OR EQUAL                  00703313
                    FD-MOV3105-VALORMOV                                 00703413
                  SUBTRACT FD-MOV3105-VALORMOV FROM FD-CLIENTES-SALDO   00703513
                  MOVE 1 TO WRK-CONTADOR                                00703615
                 ELSE                                                   00703713
                  DISPLAY 'SALDO INSUFICIENTE DO CLIENTE '              00703815
                                                     FD-CLIENTES-NOME   00703915
                  ADD 1 TO WRK-SALDOINSU                                00704015
                 END-IF                                                 00704112
               END-IF                                                   00704213
               READ MOV3105                                             00704313
            END-EVALUATE.                                               00704409
      *-------------------------------------------------------------    00704509
       2000-99-FIM.                              EXIT.                  00704609
      *--------------------------------------------------------------   00704709
      ***************************************************************   00704809
      *               F I N A L I Z A R                             *   00705000
      ***************************************************************   00706000
      *--------------------------------------------------------------   00707000
       3000-FINALIZAR                            SECTION.               00708000
      *--------------------------------------------------------------   00709000
            CLOSE CLIENTES MOV3105 CLI3105.                             00710112
            DISPLAY ' '.                                                00710200
            DISPLAY 'TOTAL DE REGISTROS GRAVADOS : ' WRK-GRAVADOS.      00710315
            DISPLAY '--------------------'                              00710400
            DISPLAY 'MOVIMENTOS NAO PROCESSADOS  : ' WRK-SALDOINSU.     00710515
            DISPLAY '--------------------'                              00710615
            DISPLAY 'FIM DO PROCESSAMENTO'.                             00710715
            DISPLAY '--------------------'                              00710815
            DISPLAY ' '.                                                00710915
      *--------------------------------------------------------------   00731000
       3000-99-FIM.                              EXIT.                  00732000
      *--------------------------------------------------------------   00733000
      *--------------------------------------------------------------   00830000
       5100-TESTAR-STATUS                        SECTION.               00840000
      *--------------------------------------------------------------   00850000
            EVALUATE TRUE                                               00860004
             WHEN WRK-FS-CLIENTES NOT EQUAL 0                           00860112
               MOVE 'FR16EX03'             TO WRK-PROGRAMA              00861012
               MOVE '5100'                 TO WRK-SECAO                 00861100
               MOVE 'ERRO NO OPEN CLIENTES' TO WRK-MENSAGEM             00861212
               MOVE WRK-FS-CLIENTES        TO WRK-STATUS                00861312
                 PERFORM 6000-TRATA-ERROS                               00862000
             WHEN WRK-FS-MOV3105 NOT EQUAL 0                            00862112
               MOVE 'FR16EX03'             TO WRK-PROGRAMA              00863012
               MOVE '5100'                 TO WRK-SECAO                 00864004
               MOVE 'ERRO NO OPEN MOV3105' TO WRK-MENSAGEM              00865012
               MOVE WRK-FS-CLIENTES        TO WRK-STATUS                00866012
                 PERFORM 6000-TRATA-ERROS                               00867004
             WHEN WRK-FS-CLI3105 NOT EQUAL 0                            00868012
               MOVE 'FR16EX03'             TO WRK-PROGRAMA              00869012
               MOVE '5100'                 TO WRK-SECAO                 00870004
               MOVE 'ERRO NO OPEN CLI3105' TO WRK-MENSAGEM              00871012
               MOVE WRK-FS-CLIENTES        TO WRK-STATUS                00872012
                 PERFORM 6000-TRATA-ERROS                               00873004
            END-EVALUATE.                                               00874004
      *--------------------------------------------------------------   00880000
       5100-99-FIM.                              EXIT.                  00890000
      *--------------------------------------------------------------   00900000
      *--------------------------------------------------------------   00910004
       5200-TESTAR-VAZIO                         SECTION.               00920004
      *--------------------------------------------------------------   00930004
            IF WRK-FS-CLIENTES NOT EQUAL 0                              00940012
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00950010
               MOVE '5200'                 TO WRK-SECAO                 00960010
               MOVE 'ERRO NO READ CLIENTES' TO WRK-MENSAGEM             00970012
               MOVE WRK-FS-CLIENTES        TO WRK-STATUS                00980012
                 PERFORM 6000-TRATA-ERROS                               00981010
            ELSE                                                        00981110
               READ CLIENTES                                            00981212
            END-IF.                                                     00982010
            IF WRK-FS-MOV3105 NOT EQUAL 0                               00982112
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00982210
               MOVE '5200'                 TO WRK-SECAO                 00982310
               MOVE 'ERRO NO READ CLIENTES' TO WRK-MENSAGEM             00982412
               MOVE WRK-FS-MOV3105         TO WRK-STATUS                00982512
                 PERFORM 6000-TRATA-ERROS                               00982610
            ELSE                                                        00982710
               READ MOV3105                                             00982812
            END-IF.                                                     00982910
      *--------------------------------------------------------------   00983210
       5200-99-FIM.                              EXIT.                  00984004
      *--------------------------------------------------------------   00985004
      *--------------------------------------------------------------   00986010
       5500-TESTA-FIM                            SECTION.               00987010
      *--------------------------------------------------------------   00988010
            IF WRK-FS-MOV3105 EQUAL 10                                  00989012
               MOVE HIGH-VALUES TO FD-MOV3105-CHAVE                     00989112
            END-IF.                                                     00989211
                                                                        00989310
      *     IF WRK-FS-CLIENTES EQUAL 10                                 00989412
      *        MOVE HIGH-VALUES TO FD-CLIENTES-IDCLIENTES               00989512
      *     END-IF.                                                     00989612
      *--------------------------------------------------------------   00989710
       5500-99-FIM.                              EXIT.                  00989810
      *--------------------------------------------------------------   00989910
      *--------------------------------------------------------------   00990000
       6000-TRATA-ERROS                          SECTION.               01000000
      *--------------------------------------------------------------   01010000
            CALL WRK-ERRORLOG USING WRK-DADOS.                          01011100
            GOBACK.                                                     01012000
      *--------------------------------------------------------------   01020000
       6000-99-FIM.                              EXIT.                  01030000
      *--------------------------------------------------------------   01040000
