      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16DB10.                                            00040011
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: FR16DB09.                         *             00064006
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 17/06/2022                        *             00068006
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: ACESSAR A TABELA DB2 FUNC E LER   *             00069302
      *                 UM REGISTRO.                      *             00069402
      *                                                   *             00070000
      *----------------------------------------------------             00080000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       WORKING-STORAGE                           SECTION.               00138001
      *----------------------------------------------------             00138101
                                                                        00138201
           EXEC SQL                                                     00139001
              INCLUDE #BKFUNC                                           00139101
           END-EXEC.                                                    00139201
                                                                        00139301
           EXEC SQL                                                     00139401
              INCLUDE SQLCA                                             00139501
           END-EXEC.                                                    00139601
                                                                        00139701
      *----------------VARIAVEIS DE APOIO------------------             00139803
       77 WRK-ID              PIC 9(05) VALUE ZEROS.                    00139903
       77 WRK-SQLCODE         PIC -999.                                 00140003
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00150003
                                                                        00151003
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
                                                                        00157200
            PERFORM 1000-INICIALIZAR.                                   00157302
              PERFORM 1100-LER-ARQUIVO.                                 00157510
             IF SQLCODE EQUAL 0                                         00157610
              PERFORM  2000-PROCESSAR                                   00157710
             END-IF.                                                    00157810
            PERFORM 3000-FINALIZAR.                                     00157907
            STOP RUN.                                                   00158010
                                                                        00158100
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
                                                                        00159100
            ACCEPT WRK-ID FROM SYSIN.                                   00159202
                                                                        00159400
      *----------------------------------------------------             00159800
       1000-99-FIM.                                 EXIT.               00159900
      *----------------------------------------------------             00160000
      *----------------------------------------------------             00160106
       1300-LEITURA                              SECTION.               00160206
      *----------------------------------------------------             00160306
            MOVE WRK-ID TO DB2-ID.                                      00160406
                                                                        00160506
            EXEC SQL                                                    00160606
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00160706
             INTO :DB2-ID,                                              00160806
                  :DB2-NOME,                                            00160906
                  :DB2-SETOR,                                           00161006
                  :DB2-SALARIO,                                         00161106
                  :DB2-DATAADM,                                         00161206
                  :DB2-EMAIL     :WRK-NULL-EMAIL                        00161306
             FROM IVAN.FUNC                                             00161406
              WHERE ID= :DB2-ID                                         00161506
              FETCH FIRST ROW ONLY                                      00161606
            END-EXEC.                                                   00161706
                                                                        00161806
            IF (SQLCODE  NOT EQUAL ZEROS AND 100) OR                    00161906
               (SQLWARN0 EQUAL 'W')                                     00162006
               MOVE SQLCODE TO WRK-SQLCODE                              00162106
               DISPLAY 'ERRO NA LEITURA - ' WRK-SQLCODE                 00162206
            END-IF.                                                     00162306
                                                                        00162406
            IF SQLCODE EQUAL 100                                        00162506
              DISPLAY 'NAO ENCONTRADO - ' DB2-ID                        00162606
            END-IF.                                                     00162806
                                                                        00162906
      *----------------------------------------------------             00163006
       1300-99-FIM.                                 EXIT.               00163306
      *----------------------------------------------------             00163506
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
                                                                        00165506
                DISPLAY '.............................'.                00165806
                DISPLAY 'ID      : ' DB2-ID.                            00165906
                DISPLAY 'NOME    : ' DB2-NOME.                          00166006
                DISPLAY 'SETOR   : ' DB2-SETOR.                         00166106
                DISPLAY 'SALARIO : ' DB2-SALARIO.                       00166206
                DISPLAY 'DATAADM : ' DB2-DATAADM.                       00166306
                IF WRK-NULL-EMAIL = 0                                   00166406
                   DISPLAY 'EMAIL   : ' DB2-EMAIL                       00166508
                ELSE                                                    00166606
                   DISPLAY 'EMAIL NULO'                                 00166706
                END-IF.                                                 00166806
                                                                        00167606
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
                                                                        00168606
            DISPLAY ' '.                                                00168706
            DISPLAY '-FIM DO PROGRAMA-'.                                00168806
                                                                        00168906
      *----------------------------------------------------             00169006
       3000-99-FIM.                                  EXIT.              00169106
      *----------------------------------------------------             00170000
