      *=============================================================*   00010000
       IDENTIFICATION                            DIVISION.              00020000
      *=============================================================*   00030000
                                                                        00040000
       PROGRAM-ID. FR16EX02.                                            00050004
      *=============================================================*   00060000
      *             T R E I N A M E N T O                           *   00061000
      *=============================================================*   00062000
      * PROGRAMA......: FR16EX02.                                   *   00062104
      *-------------------------------------------------------------*   00062200
      * PROGRAMADOR...: LUCIANO GUIMARAES.                          *   00062300
      * DATA..........: 26/05/2022                                  *   00062400
      * EMPRESA.......: FOURSYS                                     *   00062500
      * INSTRUTOR.....: IVAN SANCHES                                *   00062600
      *-------------------------------------------------------------*   00062700
      * OBJETIVO......: BALANCE LINE DOS ARQUIVOS FUNC2 E PROJ E    *   00062804
      *                 GRAVACAO DE RELATORIO NO FUNPROJ.           *   00062904
      *-------------------------------------------------------------*   00063000
      *   ARQUIVOS...:                                              *   00065000
      *    DDNAME              I/O                                  *   00066000
      *    FUNC2                I                                   *   00067003
      *    PROJ                 I                                   *   00067103
      *    FUNPROJ              O                                   *   00068003
      *-------------------------------------------------------------*   00070000
      *   MODULOS....:                             INCLUDE/BOOK     *   00080000
      *   GRAVALOG -   TRATAMENTO DE ERROS            GLOG2         *   00090000
      *=============================================================*   00100000
                                                                        00120000
      *=============================================================*   00130000
       ENVIRONMENT                               DIVISION.              00140000
      *=============================================================*   00150000
      *-------------------------------------------------------------*   00160000
       CONFIGURATION                             SECTION.               00170000
      *-------------------------------------------------------------*   00180000
       SPECIAL-NAMES.                                                   00190000
           DECIMAL-POINT IS COMMA.                                      00200000
                                                                        00210000
       INPUT-OUTPUT                              SECTION.               00220000
       FILE-CONTROL.                                                    00230000
            SELECT FUNC   ASSIGN TO FUNC                                00240004
                FILE STATUS  IS WRK-FS-FUNC.                            00250000
                                                                        00251000
            SELECT PROJ      ASSIGN TO PROJ                             00260004
                FILE STATUS  IS WRK-FS-PROJ.                            00261004
                                                                        00261104
            SELECT FUNPROJ   ASSIGN TO FUNPROJ                          00262004
                FILE STATUS  IS WRK-FS-FUNPROJ.                         00263004
      *=============================================================*   00270000
       DATA                                      DIVISION.              00280000
      *=============================================================*   00290000
       FILE                                      SECTION.               00300000
      *-------------------------------------------------------------*   00300100
                                                                        00301000
       FD FUNC                                                          00310000
           RECORDING MODE IS F                                          00320000
           BLOCK CONTAINS 0 RECORDS.                                    00340000
                                                                        00350000
       01 FD-FUNC.                                                      00351000
          05 FD-FUNC-IDFUNC      PIC X(05).                             00352008
          05 FD-FUNC-NOMEFUNC    PIC X(30).                             00353007
          05 FD-FUNC-SETORFUNC   PIC X(04).                             00354007
                                                                        00355100
                                                                        00355200
       FD PROJ                                                          00355304
           RECORDING  MODE IS F                                         00355400
           BLOCK CONTAINS 0 RECORDS.                                    00355500
                                                                        00355600
       01 FD-PROJ.                                                      00355704
          05 FD-PROJ-IDFUNC  PIC X(05).                                 00355804
          05 FD-PROJ-PROJETO PIC X(20).                                 00355904
          05 FD-PROJ-QTHORAS PIC 9(03).                                 00356004
                                                                        00357004
                                                                        00358004
       FD FUNPROJ                                                       00359004
           RECORDING  MODE IS F.                                        00360004
                                                                        00370004
       01 FD-FUNPROJ.                                                   00380004
          05 FD-IDFUNC   PIC 9(05).                                     00390004
          05 FD-NOMEFUNC PIC X(30).                                     00400004
          05 FD-PROJETO  PIC X(20).                                     00410004
          05 FD-QTHORAS  PIC 9(03).                                     00420004
      *-------------------------------------------------------------*   00480000
       WORKING-STORAGE                           SECTION.               00490000
      *-------------------------------------------------------------*   00500000
                                                                        00501000
      *-------------------------------------------------------------*   00501100
       01 FILLER PIC X(45) VALUE                                        00501200
              '------------------#GLOG----------------------'.          00501300
      *-------------------------------------------------------------*   00501400
                                                                        00501500
       COPY '#GLOG'.                                                    00502000
                                                                        00503000
                                                                        00516500
      *-------------------------------------------------------------*   00516600
       01 FILLER PIC X(45) VALUE                                        00516700
              '-----------DADOS E FILE STATUS---------------'.          00516810
      *-------------------------------------------------------------*   00516900
       77 WRK-SEM-FUNC      PIC X(23) VALUE 'PROJETO SEM FUNCIONARIO'.  00517010
       77 WRK-FS-FUNC       PIC 9(02).                                  00520000
       77 WRK-FS-PROJ       PIC 9(02).                                  00521004
       77 WRK-FS-FUNPROJ    PIC 9(02).                                  00521104
       77 WRK-ERRORLOG      PIC X(08) VALUE 'ERRORLOG'.                 00521205
                                                                        00521304
      *=============================================================*   00540000
       PROCEDURE                                 DIVISION.              00550000
      *=============================================================*   00560000
      ***************************************************************   00570000
      *          R O T I N A   P R I N C I P A L                    *   00571000
      ***************************************************************   00572000
      *--------------------------------------------------------------   00573000
       0000-PRINCIPAL                            SECTION.               00574000
      *--------------------------------------------------------------   00575000
             PERFORM 1000-INICIALIZAR.                                  00580000
             PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL 10 AND      00590007
                                          WRK-FS-PROJ EQUAL 10.         00591007
             PERFORM 3000-FINALIZAR.                                    00600000
             STOP RUN.                                                  00610000
      *--------------------------------------------------------------   00611000
       0000-99-FIM.                              EXIT.                  00612000
      *--------------------------------------------------------------   00613000
      ***************************************************************   00614000
      *             I N I C I A L I Z A R                           *   00615000
      ***************************************************************   00616000
      *--------------------------------------------------------------   00617000
       1000-INICIALIZAR                          SECTION.               00618000
      *--------------------------------------------------------------   00619000
             OPEN INPUT FUNC PROJ                                       00630004
                 OUTPUT FUNPROJ.                                        00640004
                  PERFORM 5100-TESTAR-STATUS.                           00640100
                  PERFORM 5200-TESTAR-VAZIO.                            00640207
      *--------------------------------------------------------------   00671000
       1000-99-FIM.                              EXIT.                  00672000
      *--------------------------------------------------------------   00673000
      ***************************************************************   00676900
      *               P R O C E S S A R                             *   00677000
      ***************************************************************   00677100
      *--------------------------------------------------------------   00677200
       2000-PROCESSAR                            SECTION.               00678000
      *--------------------------------------------------------------   00679000
                                                                        00679809
            PERFORM 5500-TESTA-FIM.                                     00679910
                                                                        00680010
            EVALUATE TRUE                                               00681007
             WHEN FD-FUNC-IDFUNC LESS FD-PROJ-IDFUNC                    00690007
               READ FUNC                                                00700007
             WHEN FD-FUNC-IDFUNC EQUAL FD-PROJ-IDFUNC                   00701007
               MOVE FD-FUNC-IDFUNC   TO FD-IDFUNC                       00701610
               MOVE FD-FUNC-NOMEFUNC TO FD-NOMEFUNC                     00701707
               MOVE FD-PROJ-PROJETO  TO FD-PROJETO                      00701807
               MOVE FD-PROJ-QTHORAS  TO FD-QTHORAS                      00701907
                WRITE FD-FUNPROJ                                        00702007
                READ PROJ                                               00702107
             WHEN FD-FUNC-IDFUNC GREATER FD-PROJ-IDFUNC                 00703510
               MOVE FD-PROJ-PROJETO  TO FD-PROJETO                      00703610
               MOVE FD-PROJ-QTHORAS  TO FD-QTHORAS                      00703710
               MOVE WRK-SEM-FUNC     TO FD-NOMEFUNC                     00703810
                WRITE FD-FUNPROJ                                        00703910
                READ PROJ                                               00704010
            END-EVALUATE.                                               00704309
      *-------------------------------------------------------------    00704409
       2000-99-FIM.                              EXIT.                  00704509
      *--------------------------------------------------------------   00704609
      ***************************************************************   00704709
      *               F I N A L I Z A R                             *   00705000
      ***************************************************************   00706000
      *--------------------------------------------------------------   00707000
       3000-FINALIZAR                            SECTION.               00708000
      *--------------------------------------------------------------   00709000
            CLOSE FUNC PROJ FUNPROJ.                                    00710104
            DISPLAY ' '.                                                00710200
            DISPLAY '--------------------'                              00710300
            DISPLAY 'FIM DO PROCESSAMENTO'.                             00710500
            DISPLAY '--------------------'                              00710600
            DISPLAY ' '.                                                00710700
      *--------------------------------------------------------------   00731000
       3000-99-FIM.                              EXIT.                  00732000
      *--------------------------------------------------------------   00733000
      *--------------------------------------------------------------   00830000
       5100-TESTAR-STATUS                        SECTION.               00840000
      *--------------------------------------------------------------   00850000
            EVALUATE TRUE                                               00860004
             WHEN WRK-FS-FUNC NOT EQUAL 0                               00860104
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00861004
               MOVE '5100'                 TO WRK-SECAO                 00861100
               MOVE 'ERRO NO OPEN FUNC'    TO WRK-MENSAGEM              00861200
               MOVE WRK-FS-FUNC            TO WRK-STATUS                00861300
                 PERFORM 6000-TRATA-ERROS                               00862000
             WHEN WRK-FS-PROJ NOT EQUAL 0                               00862104
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00863004
               MOVE '5100'                 TO WRK-SECAO                 00864004
               MOVE 'ERRO NO OPEN PROJ'    TO WRK-MENSAGEM              00865004
               MOVE WRK-FS-FUNC            TO WRK-STATUS                00866004
                 PERFORM 6000-TRATA-ERROS                               00867004
             WHEN WRK-FS-FUNPROJ NOT EQUAL 0                            00868004
               MOVE 'FR16EX01'             TO WRK-PROGRAMA              00869004
               MOVE '5100'                 TO WRK-SECAO                 00870004
               MOVE 'ERRO NO OPEN FUNPROJ' TO WRK-MENSAGEM              00871004
               MOVE WRK-FS-FUNC            TO WRK-STATUS                00872004
                 PERFORM 6000-TRATA-ERROS                               00873004
            END-EVALUATE.                                               00874004
      *--------------------------------------------------------------   00880000
       5100-99-FIM.                              EXIT.                  00890000
      *--------------------------------------------------------------   00900000
      *--------------------------------------------------------------   00910004
       5200-TESTAR-VAZIO                         SECTION.               00920004
      *--------------------------------------------------------------   00930004
            IF WRK-FS-FUNC NOT EQUAL 0                                  00940010
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00950010
               MOVE '5200'                 TO WRK-SECAO                 00960010
               MOVE 'ERRO NO READ FUNC'    TO WRK-MENSAGEM              00970010
               MOVE WRK-FS-FUNC            TO WRK-STATUS                00980010
                 PERFORM 6000-TRATA-ERROS                               00981010
            ELSE                                                        00981110
               READ FUNC                                                00981210
            END-IF.                                                     00982010
            IF WRK-FS-PROJ NOT EQUAL 0                                  00982110
               MOVE 'FR16EX02'             TO WRK-PROGRAMA              00982210
               MOVE '5200'                 TO WRK-SECAO                 00982310
               MOVE 'ERRO NO READ FUNC'    TO WRK-MENSAGEM              00982410
               MOVE WRK-FS-PROJ            TO WRK-STATUS                00982510
                 PERFORM 6000-TRATA-ERROS                               00982610
            ELSE                                                        00982710
               READ PROJ                                                00982810
            END-IF.                                                     00982910
      *--------------------------------------------------------------   00983210
       5200-99-FIM.                              EXIT.                  00984004
      *--------------------------------------------------------------   00985004
      *--------------------------------------------------------------   00986010
       5500-TESTA-FIM                            SECTION.               00987010
      *--------------------------------------------------------------   00988010
            IF WRK-FS-PROJ EQUAL 10                                     00989010
               MOVE HIGH-VALUES TO FD-PROJ-IDFUNC                       00989110
            END-IF.                                                     00989211
                                                                        00989310
            IF WRK-FS-FUNC EQUAL 10                                     00989410
               MOVE HIGH-VALUES TO FD-FUNC-IDFUNC                       00989510
            END-IF.                                                     00989611
      *--------------------------------------------------------------   00989710
       5500-99-FIM.                              EXIT.                  00989810
      *--------------------------------------------------------------   00989910
      *--------------------------------------------------------------   00990000
       6000-TRATA-ERROS                          SECTION.               01000000
      *--------------------------------------------------------------   01010000
            CALL WRK-ERRORLOG USING WRK-DADOS.                          01011100
            GOBACK.                                                     01012000
      *--------------------------------------------------------------   01020000
       6000-99-FIM.                              EXIT.                  01030000
      *--------------------------------------------------------------   01040000
