      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB20.                                            00040066
                                                                        00050052
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00060152
      *====================================================             00061052
      * PROGRAMA......: FR16CB20.                         *             00070065
      * TIPO..........: PRINCIPIOS DO COBOL               *             00071052
      *---------------------------------------------------*             00072052
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00073052
      * DATA..........: 09/05/2022                        *             00074057
      * EMPRESA.......: FOURSYS                           *             00080052
      * INSTRUTOR.....: IVAN SANCHES                      *             00081078
      *---------------------------------------------------*             00082052
      * OBJETIVO......: CALCULAR A TABUADA DE UM NUMERO   *             00083057
      *                 AO CONTARIO UTILIZANDO PERFORM    *             00084057
      *                 TIMES E SOMANDO O RESULTADO       *             00085065
      *----------------------------------------------------             00090052
                                                                        00090155
      *====================================================             00090255
       ENVIRONMENT                               DIVISION.              00090355
      *====================================================             00090455
       CONFIGURATION                             SECTION.               00090555
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091363
       01 WRK-DADOS.                                                    00091400
          05 WRK-NUMERO     PIC 9(02)      VALUE ZEROS.                 00091565
                                                                        00091657
       77 WRK-CONT          PIC 9(02)      VALUE 10.                    00092165
       77 WRK-RESULT        PIC 9(03) COMP VALUE ZEROS.                 00092265
       77 WRK-TOTAL         PIC 9(03) COMP VALUE ZEROS.                 00092365
                                                                        00092480
      *--------------------MASCARAS------------------------             00092580
       77 WRK-RESULT-ED     PIC ZZ9.                                    00092680
       77 WRK-TOTAL-ED      PIC ZZ9.                                    00092780
                                                                        00092858
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093679
      *          R O T I N A   P R I N C I P A L          *             00093779
      *****************************************************             00093879
      *----------------------------------------------------             00093950
       0000-PRINCIPAL                             SECTION.              00094050
      *----------------------------------------------------             00094150
           PERFORM 1000-INICIALIZAR.                                    00094250
           IF WRK-NUMERO IS NUMERIC                                     00094377
             PERFORM 2000-PROCESSAR 10 TIMES                            00094477
           ELSE                                                         00094577
             PERFORM 9000-TRATAR-ERROS                                  00094677
           END-IF.                                                      00094777
           PERFORM 3000-FINALIZAR.                                      00094850
           STOP RUN.                                                    00094950
      *----------------------------------------------------             00095050
       0000-99-FIM.                                EXIT.                00095150
      *----------------------------------------------------             00095250
      *****************************************************             00095379
      *             I N I C I A L I Z A R                 *             00095479
      *****************************************************             00095579
      *----------------------------------------------------             00095750
       1000-INICIALIZAR                           SECTION.              00095850
      *----------------------------------------------------             00095950
                                                                        00096060
           ACCEPT WRK-DADOS FROM SYSIN.                                 00096150
           DISPLAY ' '.                                                 00096280
           DISPLAY 'TABUADA DO NUMERO ' WRK-NUMERO.                     00096380
           DISPLAY ' '.                                                 00096480
      *----------------------------------------------------             00096560
       1000-99-FIM.                                EXIT.                00096650
      *----------------------------------------------------             00096750
      *****************************************************             00096879
      *               P R O C E S S A R                   *             00096979
      *****************************************************             00097079
      *----------------------------------------------------             00097150
       2000-PROCESSAR                             SECTION.              00097250
      *----------------------------------------------------             00097350
           COMPUTE WRK-RESULT = WRK-NUMERO * WRK-CONT.                  00097461
                                                                        00097580
           MOVE WRK-RESULT TO WRK-RESULT-ED.                            00097680
                                                                        00097780
           DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-RESULT-ED.       00097880
             SUBTRACT 1 FROM WRK-CONT.                                  00097957
                                                                        00098072
           COMPUTE WRK-TOTAL = WRK-TOTAL + WRK-RESULT.                  00098175
                                                                        00098280
           MOVE WRK-TOTAL TO WRK-TOTAL-ED.                              00098380
      *----------------------------------------------------             00099051
       2000-99-FIM.                                EXIT.                00100051
      *----------------------------------------------------             00110051
      *****************************************************             00111079
      *               F I N A L I Z A R                   *             00112079
      *****************************************************             00113079
      *----------------------------------------------------             00130051
       3000-FINALIZAR                             SECTION.              00140051
      *----------------------------------------------------             00141080
           DISPLAY ' '.                                                 00141180
           DISPLAY 'TOTAL DOS RESULTADOS :  ' WRK-TOTAL-ED.             00141380
           DISPLAY ' '.                                                 00141480
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00141580
      *----------------------------------------------------             00143051
       3000-99-FIM.                                EXIT.                00150051
      *----------------------------------------------------             00160051
      *****************************************************             00170079
      *               E R R O S                           *             00171079
      *****************************************************             00172079
      *----------------------------------------------------             00190051
       9000-TRATAR-ERROS                           SECTION.             00200077
      *----------------------------------------------------             00210051
                                                                        00211060
           DISPLAY 'IMPOSSIVEL MULTIPLICAR UMA STRING'.                 00212064
           DISPLAY 'ESCREVA UM NUMERO VALIDO'.                          00213064
                                                                        00215060
      *----------------------------------------------------             00220051
       9000-99-FIM.                                EXIT.                00230051
      *----------------------------------------------------             00240051
