      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB17.                                            00040034
                                                                        00050000
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00061041
      *====================================================             00062041
      * PROGRAMA......: FR16CB17.                         *             00063042
      *---------------------------------------------------*             00065041
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00066041
      * DATA..........: 06/05/2022                        *             00067041
      * EMPRESA.......: FOURSYS                           *             00068041
      * INSTRUTOR.....: IVAN SANCHES                      *             00069045
      *---------------------------------------------------*             00069141
      * OBJETIVO......: USO DE COMPUTE E EVALUATE PARA    *             00069242
      *                 ENCONTRAR MEDIA DE NOTAS          *             00070042
      *----------------------------------------------------             00080041
      *====================================================             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                             SECTION.               00090506
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-NOTA1    PIC 9(02)V99 VALUE ZEROS.                     00091533
          05 WRK-NOTA2    PIC 9(02)V99 VALUE ZEROS.                     00091634
                                                                        00091917
       77 WRK-MEDIA       PIC 9(02)V99 COMP VALUE ZEROS.                00092033
                                                                        00092133
      *-----------------MASCARAS---------------------------             00092544
                                                                        00092612
       77 WRK-MEDIA-ED     PIC 99,99.                                   00092733
       77 WRK-NOTA1-ED     PIC 99,99.                                   00092833
       77 WRK-NOTA2-ED     PIC 99,99.                                   00092933
                                                                        00093016
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093646
      *          R O T I N A   P R I N C I P A L          *             00093746
      *****************************************************             00093846
      *----------------------------------------------------             00093943
       0000-PRINCIPAL                             SECTION.              00094043
      *----------------------------------------------------             00094143
           PERFORM 1000-INICIALIZAR.                                    00094243
           PERFORM 2000-PROCESSAR.                                      00094343
           PERFORM 3000-FINALIZAR.                                      00094443
           STOP RUN.                                                    00094543
      *----------------------------------------------------             00094643
       0000-99-FIM.                                EXIT.                00094743
      *----------------------------------------------------             00094843
      *****************************************************             00094946
      *             I N I C I A L I Z A R                 *             00095046
      *****************************************************             00095146
      *----------------------------------------------------             00095343
       1000-INICIALIZAR                           SECTION.              00095443
      *----------------------------------------------------             00095543
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095643
      *----------------------------------------------------             00095743
       1000-99-FIM.                                EXIT.                00095843
      *----------------------------------------------------             00095943
      *****************************************************             00096046
      *               P R O C E S S A R                   *             00096146
      *****************************************************             00096246
      *----------------------------------------------------             00096343
       2000-PROCESSAR                             SECTION.              00096443
      *----------------------------------------------------             00096543
                                                                        00096639
             MOVE WRK-NOTA1 TO WRK-NOTA1-ED.                            00096739
             MOVE WRK-NOTA2 TO WRK-NOTA2-ED.                            00096839
             DISPLAY 'NOTA 1: ' WRK-NOTA1-ED.                           00096940
             DISPLAY 'NOTA 2: ' WRK-NOTA2-ED.                           00097040
                                                                        00097139
             COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2          00097249
                MOVE WRK-MEDIA TO WRK-MEDIA-ED.                         00097343
                DISPLAY 'MEDIA : ' WRK-MEDIA-ED.                        00097443
                                                                        00097539
             EVALUATE TRUE                                              00097638
                WHEN WRK-MEDIA LESS 2                                   00097738
                   DISPLAY 'ALUNO REPROVADO'                            00097833
                WHEN WRK-MEDIA GREATER THAN 2 AND WRK-MEDIA LESS THAN 6 00097938
                   DISPLAY 'ALUNO EM RECUPERACAO'                       00098033
                WHEN WRK-MEDIA GREATER THAN 5,99 AND                    00098138
                               WRK-MEDIA LESS THAN 9                    00098238
                   DISPLAY 'ALUNO APROVADO'                             00098333
                WHEN WRK-MEDIA GREATER THAN 8,99 AND                    00098438
                           WRK-MEDIA LESS THAN 10,01                    00098538
                   DISPLAY 'ALUNO APROVADO COM LOUVOR'                  00098648
                WHEN OTHER                                              00098733
                   DISPLAY 'MEDIA INCORRETA/FORA DE ARRANJO'            00098839
             END-EVALUATE.                                              00098933
                                                                        00099043
      *----------------------------------------------------             00100043
       2000-99-FIM.                                EXIT.                00110043
      *----------------------------------------------------             00120043
      *****************************************************             00121046
      *               F I N A L I Z A R                   *             00122046
      *****************************************************             00123046
      *----------------------------------------------------             00140043
       3000-FINALIZAR                             SECTION.              00150043
      *----------------------------------------------------             00160043
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00170043
      *----------------------------------------------------             00171043
       3000-99-FIM.                                EXIT.                00172043
      *----------------------------------------------------             00173043
                                                                        00174043
      *----------------------------------------------------             00175043
       9000-TRATA-ERROS                            SECTION.             00176043
      *----------------------------------------------------             00177043
      *----------------------------------------------------             00178043
       9000-99-FIM.                                EXIT.                00179043
      *----------------------------------------------------             00179143
