      *====================================================             00001029
       IDENTIFICATION                            DIVISION.              00002029
      *====================================================             00010021
       PROGRAM-ID. FR16CB11.                                            00020043
      *====================================================             00030053
      *             T R E I N A M E N T O                 *             00031053
      *====================================================             00032053
      * PROGRAMA......: FR16CB11.                         *             00033053
      *---------------------------------------------------*             00035053
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00036053
      * DATA..........: 29/04/2022                        *             00037054
      * EMPRESA.......: FOURSYS                           *             00038053
      * INSTRUTOR.....: IVAN SANCHES                      *             00039053
      *---------------------------------------------------*             00039153
      * OBJETIVO......: CALCULAR NUMERO DE VENDAS POR FUNC*             00039253
      *                 IONARIO USANDO DIVIDE             *             00039353
      *                                                   *             00040053
      *----------------------------------------------------             00050053
      *====================================================             00090021
       ENVIRONMENT                               DIVISION.              00100021
      *====================================================             00110021
       CONFIGURATION                             SECTION.               00111049
       SPECIAL-NAMES.                                                   00120049
           DECIMAL-POINT  IS COMMA.                                     00121049
      *====================================================             00130021
       DATA                                      DIVISION.              00140021
      *====================================================             00150021
       WORKING-STORAGE                           SECTION.               00160021
                                                                        00170021
       01 WRK-DADOS.                                                    00180021
          05 WRK-MES          PIC 9(02)  VALUE ZEROS.                   00190051
          05 WRK-TOTAL-VENDAS PIC 9(08)  VALUE ZEROS.                   00200051
          05 WRK-TOTAL-FUNC   PIC 9(03)  VALUE ZEROS.                   00201051
                                                                        00202053
       77 WRK-MEDIA           PIC 9(09)  VALUE 0.                       00222051
      *-----------------MASCARAS---------------------------             00222153
       77 WRK-MEDIA-EDT       PIC ZZZ.ZZZ.ZZ9,99.                       00223056
       77 WRK-MES-EDT         PIC Z9.                                   00223156
       77 WRK-TOTAL-VEND-EDT  PIC ZZ.ZZZ.ZZ9.                           00223256
       77 WRK-TOTAL-FUNC-EDT  PIC ZZ9.                                  00223356
                                                                        00224052
      *====================================================             00320021
       PROCEDURE                                 DIVISION.              00330021
      *====================================================             00340055
      *****************************************************             00340155
      *          R O T I N A   P R I N C I P A L          *             00340255
      *****************************************************             00340355
      *----------------------------------------------------             00341053
       0000-PRINCIPAL                             SECTION.              00342053
      *----------------------------------------------------             00343053
           PERFORM 1000-INICIALIZAR.                                    00344053
           PERFORM 2000-PROCESSAR.                                      00345053
           PERFORM 3000-FINALIZAR.                                      00346053
           STOP RUN.                                                    00347053
      *----------------------------------------------------             00348053
       0000-99-FIM.                                EXIT.                00349053
      *----------------------------------------------------             00349153
      *****************************************************             00349255
      *             I N I C I A L I Z A R                 *             00349355
      *****************************************************             00349455
      *----------------------------------------------------             00349553
       1000-INICIALIZAR                           SECTION.              00349653
      *----------------------------------------------------             00349753
                                                                        00349853
           ACCEPT WRK-DADOS FROM SYSIN.                                 00349953
                                                                        00350153
      *----------------------------------------------------             00350253
       1000-99-FIM.                                EXIT.                00350353
      *----------------------------------------------------             00350453
      *****************************************************             00350555
      *               P R O C E S S A R                   *             00350655
      *****************************************************             00350755
      *----------------------------------------------------             00350853
       2000-PROCESSAR                             SECTION.              00350953
      *----------------------------------------------------             00351053
           DIVIDE WRK-TOTAL-VENDAS BY WRK-TOTAL-FUNC GIVING WRK-MEDIA   00361053
            ON SIZE ERROR                                               00362053
              DISPLAY 'DIVISAO COM ERRO  : '                            00362153
            NOT ON SIZE ERROR                                           00362356
              DISPLAY 'CALCULADORA DE VENDAS : '                        00362456
              DISPLAY ' '                                               00362556
           END-DIVIDE.                                                  00362656
      *----------------------------------------------------             00380055
       2000-99-FIM.                                EXIT.                00390055
      *----------------------------------------------------             00400055
      *****************************************************             00401055
      *               F I N A L I Z A R                   *             00402055
      *****************************************************             00403055
      *----------------------------------------------------             00420055
       3000-FINALIZAR                             SECTION.              00430055
      *----------------------------------------------------             00440055
           MOVE WRK-MEDIA        TO WRK-MEDIA-EDT.                      00440156
           MOVE WRK-MES          TO WRK-MES-EDT.                        00440256
           MOVE WRK-TOTAL-VENDAS TO WRK-TOTAL-VEND-EDT.                 00440356
           MOVE WRK-TOTAL-FUNC   TO WRK-TOTAL-FUNC-EDT.                 00440456
                                                                        00440556
           DISPLAY 'NUMERO DO MES         : ' WRK-MES-EDT.              00441056
           DISPLAY 'TOTAL DE VENDAS       : ' WRK-TOTAL-VEND-EDT.       00442056
           DISPLAY 'TOTAL DE FUNCIONARIOS : ' WRK-TOTAL-FUNC-EDT.       00443056
           DISPLAY 'MEDIA DE VENDAS       : ' WRK-MEDIA-EDT.            00444056
      *----------------------------------------------------             00460055
       3000-99-FIM.                                EXIT.                00470056
      *----------------------------------------------------             00480055
