      *====================================================             00001029
       IDENTIFICATION                            DIVISION.              00002029
      *====================================================             00010021
       PROGRAM-ID. FR16CB10.                                            00020040
      *====================================================             00030054
      *             T R E I N A M E N T O                 *             00031054
      *====================================================             00032054
      * PROGRAMA......: FR16CB10.                         *             00033054
      *---------------------------------------------------*             00035054
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00036054
      * DATA..........: 28/04/2022                        *             00037056
      * EMPRESA.......: FOURSYS                           *             00038054
      * INSTRUTOR.....: IVAN SANCHES                      *             00039054
      *---------------------------------------------------*             00040054
      * OBJETIVO......: TRABALHAR COM DESCONTO UTILIZANDO *             00050054
      *                 COMANDO SUBTRACT E MASCARAS       *             00060054
      *                                                   *             00070054
      *----------------------------------------------------             00080054
      *====================================================             00090021
       ENVIRONMENT                               DIVISION.              00100021
      *====================================================             00110021
       CONFIGURATION                             SECTION.               00111044
       SPECIAL-NAMES.                                                   00112044
           DECIMAL-POINT  IS COMMA.                                     00113044
      *====================================================             00130021
       DATA                                      DIVISION.              00140021
      *====================================================             00150021
       WORKING-STORAGE                           SECTION.               00160021
                                                                        00170021
       01 WRK-DADOS.                                                    00180021
          05 WRK-PRODUTO    PIC X(20)    VALUE SPACES.                  00190052
          05 WRK-VALOR-PROD PIC 9(03)V99 VALUE ZEROS.                   00200051
          05 WRK-DESCONTO   PIC 9(02)V99 VALUE ZEROS.                   00201051
       77 WRK-FIM           PIC 9(03)V99 VALUE 0.                       00222058
      *-----------------MASCARAS---------------------------             00222359
       77 WRK-VLR-PROD-ED   PIC ZZ9,99.                                 00222460
       77 WRK-VLR-DESC-ED   PIC ZZ9,99.                                 00222560
       77 WRK-FIM-EDT       PIC ZZ9,99.                                 00223060
                                                                        00224053
      *====================================================             00320021
       PROCEDURE                                 DIVISION.              00330021
      *====================================================             00340021
      *****************************************************             00341057
      *          R O T I N A   P R I N C I P A L          *             00342057
      *****************************************************             00343057
      *----------------------------------------------------             00350054
       0000-PRINCIPAL                             SECTION.              00351054
      *----------------------------------------------------             00352054
           PERFORM 1000-INICIALIZAR.                                    00353054
           PERFORM 2000-PROCESSAR.                                      00354054
           PERFORM 3000-FINALIZAR.                                      00355054
           STOP RUN.                                                    00356054
      *----------------------------------------------------             00357054
       0000-99-FIM.                                EXIT.                00358054
      *----------------------------------------------------             00359054
      *****************************************************             00359157
      *             I N I C I A L I Z A R                 *             00359257
      *****************************************************             00359357
      *----------------------------------------------------             00359454
       1000-INICIALIZAR                           SECTION.              00359554
      *----------------------------------------------------             00359654
           ACCEPT WRK-DADOS FROM SYSIN.                                 00359754
      *----------------------------------------------------             00360154
       1000-99-FIM.                                EXIT.                00360254
      *----------------------------------------------------             00360354
      *****************************************************             00360457
      *               P R O C E S S A R                   *             00360557
      *****************************************************             00360657
      *----------------------------------------------------             00360754
       2000-PROCESSAR                             SECTION.              00360854
      *----------------------------------------------------             00360954
                                                                        00361054
           SUBTRACT WRK-DESCONTO FROM WRK-VALOR-PROD GIVING WRK-FIM.    00361158
           MOVE WRK-FIM TO WRK-FIM-EDT.                                 00361258
           MOVE WRK-VALOR-PROD TO WRK-VLR-PROD-ED.                      00361359
           MOVE WRK-DESCONTO TO WRK-VLR-DESC-ED.                        00361459
                                                                        00361559
      *----------------------------------------------------             00361659
       2000-99-FIM.                                EXIT.                00361759
      *----------------------------------------------------             00361859
      *****************************************************             00361959
      *               F I N A L I Z A R                   *             00362059
      *****************************************************             00362159
      *----------------------------------------------------             00362259
       3000-FINALIZAR                             SECTION.              00362359
      *----------------------------------------------------             00362459
           DISPLAY 'PRODUTO COMPRADO      : ' WRK-PRODUTO.              00362559
           DISPLAY 'VALOR DO PRODUTO      : ' WRK-VLR-PROD-ED.          00362659
           DISPLAY 'VALOR DO DESCONTO     : ' WRK-VLR-DESC-ED.          00362759
           DISPLAY 'VALOR FINAL DO PRODUTO: ' WRK-FIM-EDT.              00362859
      *----------------------------------------------------             00362959
       3000-99-FIM.                                EXIT.                00363059
      *----------------------------------------------------             00364059
