      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB23.                                            00040073
                                                                        00050052
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00060172
      *====================================================             00061052
      * PROGRAMA......: FR16CB23.                         *             00070073
      * TIPO..........: PRINCIPIOS DO COBOL               *             00071052
      *---------------------------------------------------*             00072052
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00073052
      * DATA..........: 09/05/2022                        *             00074057
      * EMPRESA.......: FOURSYS                           *             00080052
      * INSTRUTOR.....: IVAN SANCHES                      *             00081070
      *---------------------------------------------------*             00082052
      * OBJETIVO......: RECEBER UM VALOR E CALCULAR O JUR *             00083073
      *                 OS A PARTIR DA QUANTIDADE DE MESES*             00084073
      *                 UTILIZANDO PERFORMS               *             00085073
      *----------------------------------------------------             00090052
                                                                        00090155
      *====================================================             00090255
       ENVIRONMENT                               DIVISION.              00090355
      *====================================================             00090455
       CONFIGURATION                             SECTION.               00090555
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091363
       01 WRK-DADOS.                                                    00091400
          05 WRK-AGENCIA    PIC X(04)    VALUE SPACES.                  00091566
          05 WRK-CONTA      PIC 9(05)    VALUE ZEROS.                   00091665
          05 WRK-VALOR      PIC 9(05)V99 VALUE ZEROS.                   00091765
          05 WRK-MESES      PIC 9(02)    VALUE ZEROS.                   00091868
                                                                        00091957
       77 WRK-CALC-JUR      PIC 9(05)V99 COMP VALUE ZEROS.              00092165
       77 WRK-CONT          PIC X(01)    VALUE SPACES.                  00092267
                                                                        00092358
      *----------------MASCARAS----------------------------             00092458
                                                                        00092517
       77 WRK-CALC-JUR-ED   PIC ZZ.ZZ9,99.                              00092665
       77 WRK-VALOR-ED      PIC ZZ.ZZ9,99.                              00092766
                                                                        00092858
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093671
      *          R O T I N A   P R I N C I P A L          *             00093771
      *****************************************************             00093871
      *----------------------------------------------------             00093950
       0000-PRINCIPAL                             SECTION.              00094050
      *----------------------------------------------------             00094150
           PERFORM 1000-INICIALIZAR.                                    00094250
           PERFORM 2000-PROCESSAR UNTIL WRK-AGENCIA EQUAL 9999.         00094373
           PERFORM 3000-FINALIZAR.                                      00094450
           STOP RUN.                                                    00094550
      *----------------------------------------------------             00094650
       0000-99-FIM.                                EXIT.                00094750
      *----------------------------------------------------             00094850
      *****************************************************             00094971
      *             I N I C I A L I Z A R                 *             00095071
      *****************************************************             00095171
      *----------------------------------------------------             00095250
       1000-INICIALIZAR                           SECTION.              00095350
      *----------------------------------------------------             00095450
                                                                        00095560
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095650
                                                                        00095760
      *----------------------------------------------------             00095860
       1000-99-FIM.                                EXIT.                00095950
      *----------------------------------------------------             00096050
      *****************************************************             00096171
      *               P R O C E S S A R                   *             00096271
      *****************************************************             00096371
      *----------------------------------------------------             00096450
       2000-PROCESSAR                             SECTION.              00096550
      *----------------------------------------------------             00096650
           MOVE WRK-VALOR TO WRK-VALOR-ED.                              00096766
                                                                        00096866
           DISPLAY 'AGENCIA         : ' WRK-AGENCIA.                    00096969
           DISPLAY 'CONTA           : ' WRK-CONTA.                      00097069
           DISPLAY 'VALOR           : ' WRK-VALOR-ED.                   00097169
           DISPLAY 'MESES           : ' WRK-MESES.                      00097269
                                                                        00097366
           MOVE WRK-VALOR TO WRK-CALC-JUR.                              00097466
           PERFORM 2100-JUROS WRK-MESES TIMES.                          00097567
           MOVE WRK-CALC-JUR TO WRK-CALC-JUR-ED.                        00097666
                                                                        00097766
           DISPLAY 'VALOR CORRIGIDO : ' WRK-CALC-JUR-ED.                00097869
           DISPLAY ' '.                                                 00097973
                                                                        00098073
           ACCEPT WRK-DADOS FROM SYSIN.                                 00098173
                                                                        00098257
      *----------------------------------------------------             00099051
       2000-99-FIM.                                EXIT.                00100051
      *----------------------------------------------------             00110051
                                                                        00111066
      *----------------------------------------------------             00112066
       2100-JUROS                                SECTION.               00113066
      *----------------------------------------------------             00114066
                                                                        00115066
           COMPUTE WRK-CALC-JUR = WRK-CALC-JUR * 1,05.                  00116066
                                                                        00117166
      *----------------------------------------------------             00117266
       2100-99-FIM.                                  EXIT.              00118066
      *----------------------------------------------------             00120066
      *****************************************************             00120171
      *               F I N A L I Z A R                   *             00120271
      *****************************************************             00121071
      *----------------------------------------------------             00130051
       3000-FINALIZAR                             SECTION.              00140051
      *----------------------------------------------------             00141051
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00142057
      *----------------------------------------------------             00143051
       3000-99-FIM.                                EXIT.                00150051
      *----------------------------------------------------             00160051
                                                                        00180050
      *----------------------------------------------------             00190051
       9000-TRATA-ERROS                            SECTION.             00200051
      *----------------------------------------------------             00210051
                                                                        00211060
      *    DISPLAY 'IMPOSSIVEL MULTIPLICAR UMA STRING'.                 00212069
      *    DISPLAY 'ESCREVA UM NUMERO VALIDO'.                          00213069
                                                                        00215060
      *----------------------------------------------------             00220051
       9000-99-FIM.                                EXIT.                00230051
      *----------------------------------------------------             00240051
