      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16DB03.                                            00040005
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: FR16DB03.                         *             00064005
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 08/06/2022                        *             00068005
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: ACESSAR A TABELA DB2 FUNC, E      *             00069309
      *                 INSERIR UM REGISTRO               *             00069409
      *                                                   *             00070000
      *----------------------------------------------------             00080000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       WORKING-STORAGE                           SECTION.               00138001
      *----------------------------------------------------             00138101
                                                                        00138201
           EXEC SQL                                                     00139001
              INCLUDE #BKFUNC                                           00139101
           END-EXEC.                                                    00139201
                                                                        00139301
           EXEC SQL                                                     00139401
              INCLUDE SQLCA                                             00139501
           END-EXEC.                                                    00139601
                                                                        00139701
      *----------------VARIAVEIS DE APOIO------------------             00139803
       77 WRK-SQLCODE         PIC -999.                                 00139906
                                                                        00151003
       01 WRK-ID.                                                       00152005
          02 FILLER          PIC X(10).                                 00152105
          02 WRK-ID-AC       PIC 9(05).                                 00152212
                                                                        00152305
       01 WRK-NOME.                                                     00152405
          02 FILLER          PIC X(10).                                 00152505
          02 WRK-NOME-AC     PIC X(30).                                 00152605
                                                                        00152705
       01 WRK-SETOR.                                                    00152805
          02 FILLER          PIC X(10).                                 00152905
          02 WRK-SETOR-AC    PIC X(04).                                 00153005
                                                                        00153105
       01 WRK-SALARIO.                                                  00153205
          02 FILLER          PIC X(10).                                 00153305
          02 WRK-SALARIO-AC  PIC 9(08)V99.                              00153405
                                                                        00153505
       01 WRK-DATAADM.                                                  00153605
          02 FILLER          PIC X(10).                                 00153705
          02 WRK-DATAADM-AC  PIC X(10).                                 00153805
                                                                        00153905
       01 WRK-EMAIL.                                                    00154005
          02 FILLER          PIC X(10).                                 00154105
          02 WRK-EMAIL-AC    PIC X(40).                                 00154205
      *====================================================             00154300
       PROCEDURE                                 DIVISION.              00154400
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
                                                                        00157200
            PERFORM 1000-INICIALIZAR.                                   00157302
             IF WRK-ID-AC IS NUMERIC AND WRK-ID-AC GREATER 0            00157413
               PERFORM 2000-PROCESSAR                                   00157513
             ELSE                                                       00157613
               DISPLAY 'ID INVALIDO'.                                   00157713
            PERFORM 3000-FINALIZAR.                                     00157805
            STOP RUN.                                                   00157905
                                                                        00158000
      *----------------------------------------------------             00158100
       0000-99-FIM.                               EXIT.                 00158200
      *----------------------------------------------------             00158300
      *****************************************************             00158400
      *             I N I C I A L I Z A R                 *             00158500
      *****************************************************             00158600
      *----------------------------------------------------             00158700
       1000-INICIALIZAR                           SECTION.              00158800
      *----------------------------------------------------             00158900
                                                                        00159000
            ACCEPT WRK-ID.                                              00159105
            ACCEPT WRK-NOME.                                            00159205
            ACCEPT WRK-SETOR.                                           00159305
            ACCEPT WRK-SALARIO.                                         00159406
            ACCEPT WRK-DATAADM.                                         00159506
            ACCEPT WRK-EMAIL.                                           00159606
                                                                        00159706
      *----------------------------------------------------             00159800
       1000-99-FIM.                                 EXIT.               00159900
      *----------------------------------------------------             00160000
      *****************************************************             00160100
      *               P R O C E S S A R                   *             00160200
      *****************************************************             00160300
      *----------------------------------------------------             00160400
       2000-PROCESSAR                             SECTION.              00160500
      *----------------------------------------------------             00160600
            MOVE WRK-ID-AC      TO DB2-ID.                              00160805
            MOVE WRK-NOME-AC    TO DB2-NOME.                            00160905
            MOVE WRK-SETOR-AC   TO DB2-SETOR.                           00161005
            MOVE WRK-SALARIO-AC TO DB2-SALARIO.                         00161105
            MOVE WRK-DATAADM-AC TO DB2-DATAADM.                         00161205
            MOVE WRK-EMAIL-AC   TO DB2-EMAIL.                           00161306
                                                                        00161406
            EXEC SQL                                                    00161506
             INSERT INTO                                                00161606
              IVAN.FUNC(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)            00161706
             VALUES (:DB2-ID,                                           00161806
                     :DB2-NOME,                                         00161906
                     :DB2-SETOR,                                        00162006
                     :DB2-SALARIO,                                      00162106
                     :DB2-DATAADM,                                      00162206
                     :DB2-EMAIL)                                        00162306
            END-EXEC.                                                   00162406
                                                                        00162506
            EVALUATE SQLCODE                                            00162606
             WHEN 0                                                     00162706
              DISPLAY 'DADOS GRAVADOS'                                  00162806
              DISPLAY 'ID:'      DB2-ID                                 00162906
              DISPLAY 'NOME:'    DB2-NOME                               00163006
              DISPLAY 'SETOR:'   DB2-SETOR                              00163106
              DISPLAY 'SALARIO:' DB2-SALARIO                            00163206
              DISPLAY 'DATAADM:' DB2-DATAADM                            00163306
              DISPLAY 'EMAIL:'   DB2-EMAIL                              00163406
             WHEN -181                                                  00163506
              DISPLAY 'DATA FORMATO ERRADO' WRK-DATAADM-AC              00163606
             WHEN OTHER                                                 00163706
              MOVE SQLCODE TO WRK-SQLCODE                               00163806
              DISPLAY 'ERRO'  WRK-SQLCODE                               00163906
            END-EVALUATE.                                               00164006
                                                                        00164500
                                                                        00164600
      *----------------------------------------------------             00164700
       2000-99-FIM.                                EXIT.                00164800
      *----------------------------------------------------             00164900
      *****************************************************             00165000
      *               F I N A L I Z A R                   *             00165100
      *****************************************************             00165200
      *----------------------------------------------------             00165300
       3000-FINALIZAR                             SECTION.              00165400
      *----------------------------------------------------             00165500
                                                                        00165600
            DISPLAY ' '.                                                00165702
            DISPLAY '-FIM DO PROGRAMA-'.                                00165802
                                                                        00165900
      *----------------------------------------------------             00166000
       3000-99-FIM.                                  EXIT.              00166100
      *----------------------------------------------------             00167000
