      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB21.                                            00040078
                                                                        00050052
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00060152
      *====================================================             00061052
      * PROGRAMA......: FR16CB21.                         *             00070078
      * TIPO..........: PRINCIPIOS DO COBOL               *             00071052
      *---------------------------------------------------*             00072052
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00073052
      * DATA..........: 10/05/2022                        *             00074084
      * EMPRESA.......: FOURSYS                           *             00080052
      * INSTRUTOR.....: IVAN SANCHES                      *             00081085
      *---------------------------------------------------*             00082052
      * OBJETIVO......: APLICAR CONHECIMENTO DO UNTIL     *             00083078
      *                 NO COMANDO PERFOM                 *             00084078
      *                                                   *             00085078
      *----------------------------------------------------             00090052
                                                                        00090155
      *====================================================             00090255
       ENVIRONMENT                               DIVISION.              00090355
      *====================================================             00090455
       CONFIGURATION                             SECTION.               00090555
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091363
       01 WRK-DADOS.                                                    00091400
          05 WRK-CODIGO     PIC 9(03)         VALUE ZEROS.              00091580
          05 WRK-ITEM       PIC X(30)         VALUE SPACES.             00091680
          05 WRK-VALOR      PIC 9(05)V99      VALUE ZEROS.              00091780
          05 WRK-QUANT      PIC 9(03)         VALUE ZEROS.              00091980
                                                                        00092057
      *----------------------------------------------------             00092180
                                                                        00092280
       77 WRK-SOMA          PIC 9(08)V99 COMP VALUE ZEROS.              00092380
       77 WRK-QUANT-L       PIC 9(02)         VALUE ZEROS.              00092480
       77 WRK-CONTADOR      PIC 9(02)         VALUE ZEROS.              00092580
                                                                        00092679
      *----------------------------------------------------             00092780
                                                                        00092879
       77 WRK-VALOR-ED      PIC ZZ.ZZ9,99.                              00092980
       77 WRK-SOMA-ED       PIC ZZ.ZZZ.ZZ9,99.                          00093180
                                                                        00093358
      *====================================================             00093400
       PROCEDURE                                 DIVISION.              00093500
      *====================================================             00093600
      ****************************************************              00093786
      *          R O T I N A   P R I N C I P A L                        00093886
      ****************************************************              00093986
      *----------------------------------------------------             00094050
       0000-PRINCIPAL                             SECTION.              00094150
      *----------------------------------------------------             00094250
                                                                        00094379
           PERFORM 1000-INICIALIZAR.                                    00094450
           PERFORM 2000-PROCESSAR UNTIL WRK-CODIGO EQUAL 999.           00094581
           PERFORM 3000-FINALIZAR.                                      00094650
           STOP RUN.                                                    00094750
                                                                        00094879
      *----------------------------------------------------             00094950
       0000-99-FIM.                                EXIT.                00095050
      *----------------------------------------------------             00095150
      *****************************************************             00095286
      *             I N I C I A L I Z A R                 *             00095386
      *****************************************************             00095486
      *----------------------------------------------------             00095650
       1000-INICIALIZAR                           SECTION.              00095750
      *----------------------------------------------------             00095850
                                                                        00095960
           ACCEPT WRK-DADOS FROM SYSIN.                                 00096050
                                                                        00096160
      *----------------------------------------------------             00096260
       1000-99-FIM.                                EXIT.                00096350
      *----------------------------------------------------             00096450
      *****************************************************             00096586
      *               P R O C E S S A R                   *             00096686
      *****************************************************             00096786
      *----------------------------------------------------             00096950
       2000-PROCESSAR                             SECTION.              00097050
      *----------------------------------------------------             00097150
           COMPUTE WRK-SOMA = WRK-SOMA + WRK-VALOR.                     00097280
                                                                        00097381
           MOVE WRK-VALOR TO WRK-VALOR-ED.                              00097482
           DISPLAY 'CODIGO           : ' WRK-CODIGO.                    00097582
           DISPLAY 'ITEM             : ' WRK-ITEM.                      00097681
           DISPLAY 'VALOR            : ' WRK-VALOR-ED.                  00097784
           DISPLAY 'QUANTIDADE       : ' WRK-QUANT.                     00097881
           DISPLAY '-----------------------------'                      00097981
                                                                        00098081
           ADD 1 TO WRK-CONTADOR.                                       00098181
           ACCEPT WRK-DADOS FROM SYSIN.                                 00098283
                                                                        00098372
      *----------------------------------------------------             00099051
       2000-99-FIM.                                EXIT.                00100051
      *----------------------------------------------------             00110051
      *****************************************************             00111086
      *               F I N A L I Z A R                   *             00112086
      *****************************************************             00113086
      *----------------------------------------------------             00130051
       3000-FINALIZAR                             SECTION.              00140051
      *----------------------------------------------------             00141051
                                                                        00141183
           MOVE WRK-SOMA TO WRK-SOMA-ED.                                00141281
                                                                        00141381
           DISPLAY 'SOMA DOS VALORES : ' WRK-SOMA-ED.                   00141481
           DISPLAY 'REGISTROS LIDOS  : ' WRK-CONTADOR.                  00141581
                                                                        00141681
      *----------------------------------------------------             00143051
       3000-99-FIM.                                EXIT.                00150051
      *----------------------------------------------------             00160051
                                                                        00180050
      *----------------------------------------------------             00190051
       9000-TRATAR-ERROS                           SECTION.             00200077
      *----------------------------------------------------             00210051
                                                                        00211060
      *    DISPLAY 'O CODIGO DEVE SER UM VALOR INTEIRO'.                00212081
                                                                        00215060
      *----------------------------------------------------             00220051
       9000-99-FIM.                                EXIT.                00230051
      *----------------------------------------------------             00240051
