      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB08.                                            00040001
      *====================================================             00050003
      *             T R E I N A M E N T O                 *             00051003
      *====================================================             00052003
      * PROGRAMA......: FR16CB08.                         *             00053003
      *---------------------------------------------------*             00055003
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056003
      * DATA..........: 27/04/2022                        *             00057005
      * EMPRESA.......: FOURSYS                           *             00058003
      * INSTRUTOR.....: IVAN SANCHES                      *             00059005
      *---------------------------------------------------*             00059103
      * OBJETIVO......: RECEBER 3 VARIAVEIS E FAZER UM ADD*             00059203
      *----------------------------------------------------             00059503
      *====================================================             00059603
       ENVIRONMENT                               DIVISION.              00059703
      *====================================================             00059803
       CONFIGURATION                             SECTION.               00059903
       SPECIAL-NAMES.                                                   00060003
           DECIMAL-POINT  IS COMMA.                                     00060103
      *====================================================             00060203
       DATA                                      DIVISION.              00060303
      *====================================================             00060403
       WORKING-STORAGE                           SECTION.               00060503
       01 WRK-DADOS.                                                    00108100
          05 WRK-N1         PIC 9(03) VALUE ZEROS.                      00108202
          05 WRK-N2         PIC 9(03) VALUE ZEROS.                      00108302
       77 WRK-N3            PIC 9(04) VALUE ZEROS.                      00108407
      *====================================================             00110200
       PROCEDURE                                 DIVISION.              00110300
      *====================================================             00110400
      *****************************************************             00110506
      *          R O T I N A   P R I N C I P A L          *             00110606
      *****************************************************             00110706
      *----------------------------------------------------             00110803
       0000-PRINCIPAL                             SECTION.              00110903
      *----------------------------------------------------             00111003
           PERFORM 1000-INICIALIZAR.                                    00111103
           PERFORM 2000-PROCESSAR.                                      00111203
           PERFORM 3000-FINALIZAR.                                      00111303
           STOP RUN.                                                    00111403
      *----------------------------------------------------             00111503
       0000-99-FIM.                                EXIT.                00111603
      *----------------------------------------------------             00111703
      *****************************************************             00111806
      *             I N I C I A L I Z A R                 *             00111906
      *****************************************************             00112006
                                                                        00112103
      *----------------------------------------------------             00112203
       1000-INICIALIZAR                           SECTION.              00112303
      *----------------------------------------------------             00112403
                                                                        00112503
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112603
                                                                        00112703
      *----------------------------------------------------             00112803
       1000-99-FIM.                                EXIT.                00112903
      *----------------------------------------------------             00113003
                                                                        00113103
      *----------------------------------------------------             00113203
       2000-PROCESSAR                             SECTION.              00113303
      *----------------------------------------------------             00113403
                                                                        00113503
           ADD WRK-N1 WRK-N2    TO WRK-N3.                              00113603
                                                                        00113903
      *----------------------------------------------------             00114003
       2000-99-FIM.                                EXIT.                00114103
      *----------------------------------------------------             00114203
      *****************************************************             00114306
      *               F I N A L I Z A R                   *             00114406
      *****************************************************             00114506
      *----------------------------------------------------             00114703
       3000-FINALIZAR                             SECTION.              00114803
      *----------------------------------------------------             00114903
           DISPLAY 'N1        ..  ' WRK-N1.                             00115003
           DISPLAY 'N2        ..  ' WRK-N2.                             00115103
           DISPLAY 'N3        ..  ' WRK-N3.                             00115203
      *----------------------------------------------------             00115303
       3000-99-FIM.                                EXIT.                00115403
      *----------------------------------------------------             00115503
