      *====================================================             00001005
       IDENTIFICATION                            DIVISION.              00010000
      *====================================================             00011005
       PROGRAM-ID.  FR16CB01.                                           00020004
      *====================================================             00021005
      *             T R E I N A M E N T O                 *             00021105
      *====================================================             00021205
      * PROGRAMA......: FR16CB01.                         *             00021306
      *---------------------------------------------------*             00021505
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00021605
      * DATA..........: 26/04/2022                        *             00021709
      * EMPRESA.......: FOURSYS                           *             00021805
      * INSTRUTOR.....: IVAN SANCHES                      *             00021907
      *---------------------------------------------------*             00022005
      * OBJETIVO......: PRIMEIRO PROGRAMA                 *             00022105
      *                                                   *             00022205
      *                                                   *             00022305
      *----------------------------------------------------             00022405
                                                                        00022505
      *====================================================             00022605
       ENVIRONMENT                               DIVISION.              00030005
      *====================================================             00031005
       DATA                                      DIVISION.              00040005
      *====================================================             00041005
       PROCEDURE DIVISION.                                              00050000
      *====================================================             00051005
           DISPLAY 'MEU PRIMEIRO PROGRAMA - LUCIANO'                    00060003
           STOP RUN.                                                    00070002
