      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR26CB22.                                            00040002
      *====================================================             00061001
      *             T R E I N A M E N T O                 *             00062001
      *====================================================             00063001
      * PROGRAMA......: FR16CB22.                         *             00064008
      * TIPO..........: PRINCIPIOS DO COBOL               *             00065001
      *---------------------------------------------------*             00066001
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067001
      * DATA..........: 09/05/2022                        *             00068001
      * EMPRESA.......: FOURSYS                           *             00069001
      * INSTRUTOR.....: IVAN SANCHES                      *             00069105
      *---------------------------------------------------*             00069201
      * OBJETIVO......: CALCULAR A TABUADA DE  VARIOS     *             00069307
      *                 NUMEROS PELO SYSIN USANDO PERFORM *             00069402
      *                 TIMES E UNTIL                     *             00070002
      *----------------------------------------------------             00080001
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       WORKING-STORAGE                         SECTION.                 00138000
       01 WRK-DADOS.                                                    00139000
          05 WRK-NUMERO        PIC 9(02)    VALUE ZEROES.               00140008
                                                                        00150004
       77 WRK-CONT             PIC 9(02)    VALUE 1.                    00151008
       77 WRK-TOTAL            PIC 9(04)    VALUE ZEROES.               00152008
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155106
      *          R O T I N A   P R I N C I P A L          *             00155206
      *****************************************************             00155306
      *----------------------------------------------------             00156006
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157106
                                                                        00157208
           PERFORM 1000-INICIALIZAR.                                    00157300
           IF WRK-NUMERO NOT EQUAL 0                                    00157407
             PERFORM 2000-PROCESSAR UNTIL WRK-NUMERO EQUAL 99           00157508
           END-IF.                                                      00157603
           PERFORM 3000-FINALIZAR.                                      00157800
           STOP RUN.                                                    00157906
                                                                        00158004
      *----------------------------------------------------             00158106
       0000-99-FIM.                               EXIT.                 00158206
      *----------------------------------------------------             00158306
      *****************************************************             00158406
      *             I N I C I A L I Z A R                 *             00158506
      *****************************************************             00158606
      *----------------------------------------------------             00158706
       1000-INICIALIZAR                           SECTION.              00158806
      *----------------------------------------------------             00158906
                                                                        00159006
           ACCEPT WRK-DADOS FROM SYSIN.                                 00159106
                                                                        00159208
      *----------------------------------------------------             00159808
       1000-99-FIM.                                 EXIT.               00159908
      *----------------------------------------------------             00160008
      *****************************************************             00160108
      *               P R O C E S S A R                   *             00160208
      *****************************************************             00160308
      *----------------------------------------------------             00160408
       2000-PROCESSAR                             SECTION.              00160508
      *----------------------------------------------------             00160608
                                                                        00160708
            DISPLAY ' '.                                                00160808
            DISPLAY 'TABUADA DO NUMERO ' WRK-NUMERO.                    00160908
            DISPLAY ' '.                                                00161008
            PERFORM 10 TIMES                                            00161108
                                                                        00161208
            COMPUTE WRK-TOTAL = WRK-NUMERO * WRK-CONT                   00161308
            DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-TOTAL           00161408
             ADD 1 TO WRK-CONT                                          00161508
            END-PERFORM.                                                00161608
                                                                        00161708
            MOVE 1 TO WRK-CONT.                                         00161808
            ACCEPT WRK-DADOS FROM SYSIN.                                00161908
                                                                        00162008
      *----------------------------------------------------             00162108
       2000-99-FIM.                                EXIT.                00162208
      *----------------------------------------------------             00162308
      *****************************************************             00162408
      *               F I N A L I Z A R                   *             00162508
      *****************************************************             00162608
      *----------------------------------------------------             00162708
       3000-FINALIZAR                             SECTION.              00162808
      *----------------------------------------------------             00162908
                                                                        00163008
            DISPLAY ' '.                                                00163108
            DISPLAY '----------- FIM DO PROGRAMA'.                      00163208
                                                                        00163308
      *----------------------------------------------------             00163408
       3000-99-FIM.                                  EXIT.              00163508
      *----------------------------------------------------             00164008
