      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020037
      *====================================================             00030000
       PROGRAM-ID. FR16CB19.                                            00040057
                                                                        00050052
      *====================================================             00060000
      *             T R E I N A M E N T O                 *             00060152
      *====================================================             00061052
      * PROGRAMA......: FR16CB19.                         *             00070057
      * TIPO..........: PRINCIPIOS DO COBOL               *             00071052
      *---------------------------------------------------*             00072052
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00073052
      * DATA..........: 09/05/2022                        *             00074057
      * EMPRESA.......: FOURSYS                           *             00080052
      * INSTRUTOR.....: IVAN SANCHES                      *             00081065
      *---------------------------------------------------*             00082052
      * OBJETIVO......: CALCULAR A TABUADA DE UM NUMERO   *             00083057
      *                 AO CONTARIO UTILIZANDO PERFORM    *             00084057
      *                 TIMES                             *             00085057
      *----------------------------------------------------             00090052
                                                                        00090155
      *====================================================             00090255
       ENVIRONMENT                               DIVISION.              00090355
      *====================================================             00090455
       CONFIGURATION                             SECTION.               00090555
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091363
       01 WRK-DADOS.                                                    00091400
          05 WRK-NUMERO     PIC 9(02)   VALUE ZEROS.                    00091557
                                                                        00091657
       77 WRK-CONT          PIC 9(02)   VALUE 10.                       00092157
       77 WRK-RESULT        PIC 9(03)   VALUE ZEROS.                    00092258
                                                                        00092358
      *----------------MASCARAS----------------------------             00092458
                                                                        00092517
       77 WRK-RESULT-ED     PIC ZZ9.                                    00092661
                                                                        00092758
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093666
      *          R O T I N A   P R I N C I P A L          *             00093766
      *****************************************************             00093866
      *----------------------------------------------------             00093950
       0000-PRINCIPAL                             SECTION.              00094050
      *----------------------------------------------------             00094150
           PERFORM 1000-INICIALIZAR.                                    00094250
           PERFORM 2000-PROCESSAR 10 TIMES.                             00094357
           PERFORM 3000-FINALIZAR.                                      00094450
           STOP RUN.                                                    00094550
      *----------------------------------------------------             00094650
       0000-99-FIM.                                EXIT.                00094750
      *----------------------------------------------------             00094850
      *****************************************************             00094966
      *             I N I C I A L I Z A R                 *             00095066
      *****************************************************             00095166
      *----------------------------------------------------             00095350
       1000-INICIALIZAR                           SECTION.              00095450
      *----------------------------------------------------             00095550
                                                                        00095660
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095750
           IF WRK-NUMERO IS NOT NUMERIC                                 00095862
              PERFORM 9000-TRATA-ERROS                                  00095960
           ELSE                                                         00096067
              DISPLAY ' '                                               00096267
              DISPLAY 'TABUADA DO NUMERO ' WRK-NUMERO                   00096367
              DISPLAY ' '                                               00096467
           END-IF.                                                      00096667
                                                                        00096767
      *----------------------------------------------------             00096860
       1000-99-FIM.                                EXIT.                00096950
      *----------------------------------------------------             00097050
      *****************************************************             00097166
      *               P R O C E S S A R                   *             00097266
      *****************************************************             00097366
      *----------------------------------------------------             00097450
       2000-PROCESSAR                             SECTION.              00097550
      *----------------------------------------------------             00097650
                                                                        00097759
           COMPUTE WRK-RESULT = WRK-NUMERO * WRK-CONT.                  00097867
           MOVE WRK-RESULT TO WRK-RESULT-ED.                            00097967
           DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-RESULT-ED.       00098067
           SUBTRACT 1 FROM WRK-CONT.                                    00098167
                                                                        00098257
      *----------------------------------------------------             00099051
       2000-99-FIM.                                EXIT.                00100051
      *----------------------------------------------------             00110051
      *****************************************************             00111066
      *               F I N A L I Z A R                   *             00112066
      *****************************************************             00113066
      *----------------------------------------------------             00130051
       3000-FINALIZAR                             SECTION.              00140051
      *----------------------------------------------------             00141051
           DISPLAY ' '.                                                 00141167
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00142057
      *----------------------------------------------------             00143051
       3000-99-FIM.                                EXIT.                00150051
      *----------------------------------------------------             00160051
      *****************************************************             00170066
      *               E R R O S                           *             00171066
      *****************************************************             00172066
      *----------------------------------------------------             00190051
       9000-TRATA-ERROS                            SECTION.             00200051
      *----------------------------------------------------             00210051
                                                                        00211060
           DISPLAY 'IMPOSSIVEL MULTIPLICAR UMA STRING'.                 00212064
           DISPLAY 'ESCREVA UM NUMERO VALIDO'.                          00213064
                                                                        00215060
      *----------------------------------------------------             00220051
       9000-99-FIM.                                EXIT.                00230051
      *----------------------------------------------------             00240051
