      *====================================================             00001029
       IDENTIFICATION                            DIVISION.              00002029
      *====================================================             00010021
       PROGRAM-ID. FR16CB07.                                            00020028
      *====================================================             00030037
      *             T R E I N A M E N T O                 *             00040037
      *====================================================             00041037
      * PROGRAMA......: FR16CB07.                         *             00042038
      *---------------------------------------------------*             00044037
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00045037
      * DATA..........: 27/04/2022                        *             00046040
      * EMPRESA.......: FOURSYS                           *             00047037
      * INSTRUTOR.....: IVAN SANCHES                      *             00048039
      *---------------------------------------------------*             00049037
      * OBJETIVO......: UTILIZACAO DE FILLERS E REDEFINES *             00049138
      *                 IMPRIMINDO APENAS A PARTE DESEJADA*             00049238
      *                                                   *             00049338
      *----------------------------------------------------             00049437
                                                                        00049537
      *====================================================             00049637
       ENVIRONMENT                               DIVISION.              00049737
      *====================================================             00049837
       CONFIGURATION                             SECTION.               00050037
       SPECIAL-NAMES.                                                   00060037
           DECIMAL-POINT  IS COMMA.                                     00070037
      *====================================================             00130021
       DATA                                      DIVISION.              00140021
      *====================================================             00150021
       WORKING-STORAGE                           SECTION.               00160021
                                                                        00170021
       01 WRK-DADOS.                                                    00180021
          05 WRK-ID            PIC 9(05) VALUE ZEROS.                   00190036
          05 WRK-NOME          PIC X(19) VALUE SPACES.                  00200036
          05 WRK-ENDERECO      PIC X(40) VALUE SPACES.                  00201042
                                                                        00222034
       01 WRK-DADOS-RED     REDEFINES WRK-DADOS.                        00230026
          05 FILLER            PIC X(24).                               00250036
          05 WRK-END-RED.                                               00261035
            10 WRK-RUA-RED     PIC X(30).                               00311042
            10 WRK-BAIRRO-RED  PIC X(07).                               00311142
            10 WRK-ESTADO-RED  PIC X(02).                               00313042
      *====================================================             00320021
       PROCEDURE                                 DIVISION.              00330021
      *====================================================             00340021
      *****************************************************             00341041
      *          R O T I N A   P R I N C I P A L          *             00342041
      *****************************************************             00343041
      *----------------------------------------------------             00350037
       0000-PRINCIPAL                             SECTION.              00351037
      *----------------------------------------------------             00352037
           PERFORM 1000-INICIALIZAR.                                    00353037
           PERFORM 3000-FINALIZAR.                                      00355037
           STOP RUN.                                                    00356037
      *----------------------------------------------------             00357037
       0000-99-FIM.                                EXIT.                00358037
      *----------------------------------------------------             00359037
      *****************************************************             00359141
      *             I N I C I A L I Z A R                 *             00359241
      *****************************************************             00359341
      *----------------------------------------------------             00359437
       1000-INICIALIZAR                           SECTION.              00359537
      *----------------------------------------------------             00359637
           ACCEPT WRK-DADOS FROM SYSIN.                                 00359737
      *----------------------------------------------------             00360137
       1000-99-FIM.                                EXIT.                00360237
      *----------------------------------------------------             00360337
      *****************************************************             00360441
      *               F I N A L I Z A R                   *             00360541
      *****************************************************             00360641
      *----------------------------------------------------             00360737
       3000-FINALIZAR                             SECTION.              00360837
      *----------------------------------------------------             00360937
           DISPLAY 'DADOS INTEIROS..' WRK-DADOS.                        00361037
           DISPLAY 'SO ENDERECO  ...' WRK-END-RED.                      00361137
           DISPLAY 'SO BAIRRO    ...' WRK-BAIRRO-RED.                   00361237
      *----------------------------------------------------             00361337
       3000-99-FIM.                                EXIT.                00361437
      *----------------------------------------------------             00361537
