      *====================================================             00010013
       IDENTIFICATION                            DIVISION.              00020013
      *====================================================             00030013
       PROGRAM-ID. FR16CB09.                                            00040013
      *====================================================             00050019
      *             T R E I N A M E N T O                 *             00051019
      *====================================================             00052019
      * PROGRAMA......: FR16CB09.                         *             00053019
      *---------------------------------------------------*             00055019
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056019
      * DATA..........: 28/04/2022                        *             00057021
      * EMPRESA.......: FOURSYS                           *             00058019
      * INSTRUTOR.....: IVAN SANCHES                      *             00059020
      *---------------------------------------------------*             00060019
      * OBJETIVO......: RECEBER 3 NOTAS E SOMAR           *             00070019
      *                 TAMBEM USAR VARIAVEL EDITADA      *             00080019
      *                 MASCARA                           *             00090019
      *----------------------------------------------------             00100019
      *====================================================             00110013
       ENVIRONMENT                               DIVISION.              00120013
      *====================================================             00130013
       CONFIGURATION                             SECTION.               00140014
       SPECIAL-NAMES.                                                   00150014
           DECIMAL-POINT  IS COMMA.                                     00160014
      *====================================================             00170014
       DATA                                      DIVISION.              00180014
      *====================================================             00190014
       WORKING-STORAGE                         SECTION.                 00200014
       01 WRK-DADOS.                                                    00210014
          05 WRK-N1         PIC 9(02)    VALUE ZEROS.                   00220018
          05 WRK-N2         PIC 9(02)    VALUE ZEROS.                   00230018
          05 WRK-N3         PIC 9(02)    VALUE ZEROS.                   00240018
                                                                        00241019
       77 WRK-N4            PIC 9(03)V99 VALUE 0.                       00241119
      *--------------MASCARAS------------------------------             00242019
       77 WRK-N4-ED         PIC ZZ9,99.                                 00260014
      *====================================================             00300014
       PROCEDURE                                 DIVISION.              00310014
      *====================================================             00320014
      *****************************************************             00330022
      *          R O T I N A   P R I N C I P A L          *             00331022
      *****************************************************             00332022
      *----------------------------------------------------             00340019
       0000-PRINCIPAL                             SECTION.              00341019
      *----------------------------------------------------             00342019
           PERFORM 1000-INICIALIZAR.                                    00343019
           PERFORM 2000-PROCESSAR.                                      00344019
           PERFORM 3000-FINALIZAR.                                      00345019
           STOP RUN.                                                    00346019
      *----------------------------------------------------             00347019
       0000-99-FIM.                                EXIT.                00348019
      *----------------------------------------------------             00349019
      *****************************************************             00349122
      *             I N I C I A L I Z A R                 *             00349222
      *****************************************************             00349322
      *----------------------------------------------------             00349419
       1000-INICIALIZAR                           SECTION.              00349519
      *----------------------------------------------------             00349619
                                                                        00349719
           ACCEPT WRK-DADOS FROM SYSIN.                                 00349819
                                                                        00349919
      *----------------------------------------------------             00350019
       1000-99-FIM.                                EXIT.                00351019
      *----------------------------------------------------             00360019
      *****************************************************             00360122
      *               P R O C E S S A R                   *             00360222
      *****************************************************             00360322
      *----------------------------------------------------             00361019
       2000-PROCESSAR                             SECTION.              00362019
      *----------------------------------------------------             00363019
                                                                        00364019
            ADD WRK-N1 WRK-N2 WRK-N3   TO WRK-N4.                       00365019
            MOVE WRK-N4 TO WRK-N4-ED.                                   00367019
                                                                        00369019
      *----------------------------------------------------             00369119
       2000-99-FIM.                                EXIT.                00369219
      *----------------------------------------------------             00369319
      *****************************************************             00369422
      *               F I N A L I Z A R                   *             00369522
      *****************************************************             00369622
      *----------------------------------------------------             00369819
       3000-FINALIZAR                             SECTION.              00369919
      *----------------------------------------------------             00370019
           DISPLAY 'N1        ..  ' WRK-N1.                             00371019
           DISPLAY 'N2        ..  ' WRK-N2.                             00380015
           DISPLAY 'N3        ..  ' WRK-N3.                             00390015
           DISPLAY 'N4        ..  ' WRK-N4-ED.                          00430016
      *----------------------------------------------------             00440019
       2000-99-FIM.                                EXIT.                00450019
      *----------------------------------------------------             00460019
