      *====================================================             00010010
       IDENTIFICATION                            DIVISION.              00020010
      *====================================================             00030010
       PROGRAM-ID. FR16CB06.                                            00040020
      *====================================================             00050021
      *             T R E I N A M E N T O                 *             00051021
      *====================================================             00052021
      * PROGRAMA......: FR16CB06.                         *             00053021
      *---------------------------------------------------*             00053221
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00054021
      * DATA..........: 26/04/2022                        *             00055024
      * EMPRESA.......: FOURSYS                           *             00056021
      * INSTRUTOR.....: IVAN SANCHES                      *             00057023
      *---------------------------------------------------*             00058021
      * OBJETIVO......: RECEBER DADOS E UTILIZAR REDEFINES*             00060021
      *                 E FILLER                          *             00070021
      *                                                   *             00080021
      *----------------------------------------------------             00090021
      *====================================================             00110010
       ENVIRONMENT                               DIVISION.              00120010
      *====================================================             00121021
       CONFIGURATION                             SECTION.               00122021
       SPECIAL-NAMES.                                                   00123021
           DECIMAL-POINT  IS COMMA.                                     00130021
      *====================================================             00140021
       DATA                                      DIVISION.              00150021
      *====================================================             00160021
       WORKING-STORAGE                           SECTION.               00180010
                                                                        00190010
       01 WRK-DADOS.                                                    00200010
          05 WRK-ID         PIC 9(05) VALUE ZEROS.                      00210010
          05 WRK-NOME       PIC X(30) VALUE SPACES.                     00220010
          05 WRK-ENDERECO   PIC X(30) VALUE SPACES.                     00230010
                                                                        00240010
       01 WRK-DADOS-RED1    REDEFINES WRK-DADOS.                        00250010
          05 WRK-ID-RED1    PIC 9(05).                                  00260010
          05 WRK-NOME-RED1  PIC X(30).                                  00270010
                                                                        00280010
       01 WRK-DADOS-RED2    REDEFINES WRK-DADOS.                        00290010
          05 WRK-ID-RED2    PIC 9(05).                                  00300010
                                                                        00301010
       01 WRK-DADOS-RED3    REDEFINES WRK-DADOS.                        00302012
          05 FILLER         PIC X(35).                                  00306026
          05 WRK-END-RED    PIC X(30).                                  00307018
      *====================================================             00310010
       PROCEDURE                                 DIVISION.              00320010
      *====================================================             00330010
      *****************************************************             00330125
      *          R O T I N A   P R I N C I P A L          *             00330225
      *****************************************************             00330325
      *----------------------------------------------------             00331021
       0000-PRINCIPAL                             SECTION.              00332021
      *----------------------------------------------------             00332121
           PERFORM 1000-INICIALIZAR.                                    00332221
           PERFORM 3000-FINALIZAR.                                      00332421
           STOP RUN.                                                    00332521
      *----------------------------------------------------             00332621
       0000-99-FIM.                                EXIT.                00332721
      *----------------------------------------------------             00332821
      *****************************************************             00332925
      *             I N I C I A L I Z A R                 *             00333025
      *****************************************************             00333125
      *----------------------------------------------------             00333221
       1000-INICIALIZAR                           SECTION.              00333321
      *----------------------------------------------------             00333421
                                                                        00333521
           ACCEPT WRK-DADOS FROM SYSIN.                                 00333621
                                                                        00333721
      *----------------------------------------------------             00333821
       1000-99-FIM.                                EXIT.                00333921
      *----------------------------------------------------             00334021
      *****************************************************             00334125
      *               F I N A L I Z A R                   *             00334225
      *****************************************************             00334325
      *----------------------------------------------------             00334421
       3000-FINALIZAR                             SECTION.              00334521
      *----------------------------------------------------             00334621
           DISPLAY 'WRK-DADOS     ..' WRK-DADOS.                        00334721
           DISPLAY 'WRK-DADOS-RED1..' WRK-DADOS-RED1.                   00334821
           DISPLAY 'WRK-DADOS-RED2..' WRK-DADOS-RED2.                   00334921
           DISPLAY 'ENDERECO........' WRK-END-RED.                      00335026
      *----------------------------------------------------             00335121
       3000-99-FIM.                                EXIT.                00335221
      *----------------------------------------------------             00335321
