      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB12.                                            00040001
      *====================================================             00050009
      *             T R E I N A M E N T O                 *             00051009
      *====================================================             00052009
      * PROGRAMA......: FR16CB12.                         *             00053009
      *---------------------------------------------------*             00055009
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056009
      * DATA..........: 02/05/2022                        *             00057010
      * EMPRESA.......: FOURSYS                           *             00058009
      * INSTRUTOR.....: IVAN SANCHES                      *             00059009
      *---------------------------------------------------*             00059109
      * OBJETIVO......: CALCULAR VALOR DA COMISSAO POR VEN*             00059209
      *                 DA UTILIZANDO COMANDO MULTIPLY    *             00059309
      *                                                   *             00060009
      *----------------------------------------------------             00070009
      * EMPRESA: FOURSYS                                                00080000
      *====================================================             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                             SECTION.               00090506
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091308
       01 WRK-DADOS.                                                    00091400
          05 WRK-FUNCIONARIO   PIC X(15) VALUE SPACES.                  00091503
          05 WRK-TOT-VENDAS    PIC 9(05)V99 VALUE ZEROS.                00091612
          05 WRK-COMISSAO      PIC 9(02)V99 VALUE ZEROS.                00091712
                                                                        00092012
      *-----------------CALCULO----------------------------             00092112
       77 WRK-VLR-COMS         PIC 9(08)V99 VALUE 0.                    00092213
      *-----------------MASCARAS---------------------------             00092309
       77 WRK-COMISSAO-ED      PIC Z9,99.                               00092412
       77 WRK-TOT-VENDAS-ED    PIC ZZ.ZZ9,99.                           00092513
       77 WRK-VLR-COMS-ED      PIC ZZ.ZZZ.ZZ9,99.                       00092612
                                                                        00092712
      *====================================================             00092812
       PROCEDURE                                 DIVISION.              00092912
      *====================================================             00093012
      *****************************************************             00093112
      *          R O T I N A   P R I N C I P A L          *             00093212
      *****************************************************             00093312
      *----------------------------------------------------             00093412
       0000-PRINCIPAL                             SECTION.              00093512
      *----------------------------------------------------             00093612
           PERFORM 1000-INICIALIZAR.                                    00093712
           PERFORM 2000-PROCESSAR.                                      00093812
           PERFORM 3000-FINALIZAR.                                      00093912
           STOP RUN.                                                    00094012
      *----------------------------------------------------             00094112
       0000-99-FIM.                                EXIT.                00094212
      *----------------------------------------------------             00094312
      *****************************************************             00094412
      *             I N I C I A L I Z A R                 *             00094512
      *****************************************************             00094612
      *----------------------------------------------------             00094712
       1000-INICIALIZAR                           SECTION.              00094812
      *----------------------------------------------------             00094912
                                                                        00095012
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095112
                                                                        00095212
      *----------------------------------------------------             00095312
       1000-99-FIM.                                EXIT.                00095412
      *----------------------------------------------------             00095512
      *****************************************************             00095612
      *               P R O C E S S A R                   *             00095712
      *****************************************************             00095812
      *----------------------------------------------------             00095912
       2000-PROCESSAR                             SECTION.              00096012
      *----------------------------------------------------             00096112
                                                                        00096212
           MULTIPLY WRK-TOT-VENDAS BY WRK-COMISSAO                      00096312
                              GIVING WRK-VLR-COMS.                      00096412
                                                                        00096612
      *----------------------------------------------------             00096712
       2000-99-FIM.                                EXIT.                00096812
      *----------------------------------------------------             00096912
      *****************************************************             00097012
      *               F I N A L I Z A R                   *             00097112
      *****************************************************             00097212
      *----------------------------------------------------             00097312
       3000-FINALIZAR                             SECTION.              00097412
      *----------------------------------------------------             00097512
           MOVE WRK-VLR-COMS TO WRK-VLR-COMS-ED.                        00097612
           MOVE WRK-TOT-VENDAS TO WRK-TOT-VENDAS-ED.                    00097712
           MOVE WRK-COMISSAO   TO WRK-COMISSAO-ED.                      00097812
                                                                        00097912
           DISPLAY 'NOME DO FUNCIONARIO  : ' WRK-FUNCIONARIO.           00098012
           DISPLAY 'TOTAL DE VENDAS      : ' WRK-TOT-VENDAS-ED.         00098112
           DISPLAY 'COMISSAO             : ' WRK-COMISSAO-ED.           00098212
           DISPLAY 'VALOR DA COMISSAO    : ' WRK-VLR-COMS-ED.           00098312
      *----------------------------------------------------             00098412
       3000-99-FIM.                                EXIT.                00098512
      *----------------------------------------------------             00099012
