      *====================================================             00010002
       IDENTIFICATION                            DIVISION.              00020002
      *====================================================             00030002
       PROGRAM-ID. FR16CB04.                                            00040003
      *====================================================             00050006
      *             T R E I N A M E N T O                 *             00060006
      *====================================================             00061006
      * PROGRAMA......: FR16CB04.                         *             00062007
      *---------------------------------------------------*             00064006
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00065006
      * DATA..........: 25/04/2022                        *             00066011
      * EMPRESA.......: FOURSYS                           *             00067006
      * INSTRUTOR.....: IVAN SANCHES                      *             00068009
      *---------------------------------------------------*             00069006
      * OBJETIVO......: UTILIZACAO DE FILLER              *             00069106
      *                                                   *             00069206
      *                                                   *             00069306
      *----------------------------------------------------             00069406
                                                                        00069506
      *====================================================             00069606
       ENVIRONMENT                               DIVISION.              00069706
      *====================================================             00069806
       CONFIGURATION                             SECTION.               00070006
       SPECIAL-NAMES.                                                   00080006
           DECIMAL-POINT  IS COMMA.                                     00090006
      *====================================================             00100006
       DATA                                      DIVISION.              00110006
      *====================================================             00120006
       WORKING-STORAGE                           SECTION.               00180002
       01 WRK-DADOS.                                                    00190002
          05 WRK-ID       PIC X(05) VALUE SPACES.                       00200005
          05 WRK-PRODUTO  PIC X(30) VALUE SPACES.                       00210003
          05 FILLER       PIC X(10) VALUE SPACES.                       00220003
          05 WRK-PRECO    PIC X(06) VALUE SPACES.                       00230003
      *====================================================             00250002
       PROCEDURE                                 DIVISION.              00260002
      *====================================================             00270002
      *****************************************************             00271012
      *          R O T I N A   P R I N C I P A L          *             00272012
      *****************************************************             00273012
      *----------------------------------------------------             00280006
        0000-PRINCIPAL                             SECTION.             00280106
      *----------------------------------------------------             00280206
           PERFORM 1000-INICIALIZAR.                                    00280306
           PERFORM 3000-FINALIZAR.                                      00280506
           STOP RUN.                                                    00280606
      *----------------------------------------------------             00281006
       0000-99-FIM.                                EXIT.                00281106
      *----------------------------------------------------             00281206
      *****************************************************             00281312
      *             I N I C I A L I Z A R                 *             00281412
      *****************************************************             00281512
      *----------------------------------------------------             00281606
       1000-INICIALIZAR                           SECTION.              00281706
      *----------------------------------------------------             00281806
                                                                        00281906
           ACCEPT WRK-DADOS FROM SYSIN.                                 00282006
                                                                        00282306
      *----------------------------------------------------             00282406
       1000-99-FIM.                                EXIT.                00282506
      *----------------------------------------------------             00282606
      *****************************************************             00282712
      *               F I N A L I Z A R                   *             00282812
      *****************************************************             00282912
      *----------------------------------------------------             00283006
       3000-FINALIZAR                             SECTION.              00283106
      *----------------------------------------------------             00284006
           DISPLAY 'ID.....      : ' WRK-ID.                            00284106
           DISPLAY 'PRODUTO..... : ' WRK-PRODUTO.                       00284206
           DISPLAY 'PRECO.....   : ' WRK-PRECO.                         00284306
      *----------------------------------------------------             00285006
       3000-99-FIM.                                EXIT.                00286006
      *----------------------------------------------------             00301006
