      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB05.                                            00040007
      *====================================================             00050009
      *             T R E I N A M E N T O                 *             00051009
      *====================================================             00052009
      * PROGRAMA......: FR16CB05.                         *             00053009
      *---------------------------------------------------*             00055009
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056009
      * DATA..........: 26/04/2022                        *             00057012
      * EMPRESA.......: FOURSYS                           *             00058009
      * INSTRUTOR.....: IVAN SANCHES                      *             00059011
      *---------------------------------------------------*             00059109
      * OBJETIVO......: RECEBER UMA DATA E IMPRIMIR       *             00059209
      *                 FORMATADA                         *             00059309
      *                                                   *             00059409
      *----------------------------------------------------             00059509
                                                                        00059609
      *====================================================             00059709
       ENVIRONMENT                               DIVISION.              00059809
      *====================================================             00059909
       CONFIGURATION                             SECTION.               00060009
       SPECIAL-NAMES.                                                   00060109
           DECIMAL-POINT  IS COMMA.                                     00060209
      *====================================================             00060309
       DATA                                      DIVISION.              00060409
      *====================================================             00060509
       WORKING-STORAGE                           SECTION.               00180000
       01 WRK-DATA.                                                     00190000
          05 WRK-ANO     PIC 9(04) VALUE ZEROS.                         00210000
          05 WRK-MES     PIC 9(02) VALUE ZEROS.                         00220000
          05 WRK-DIA     PIC 9(02) VALUE ZEROS.                         00230000
      *====================================================             00240000
       PROCEDURE                                 DIVISION.              00250000
      *====================================================             00260013
      *****************************************************             00261013
      *          R O T I N A   P R I N C I P A L          *             00262013
      *****************************************************             00263013
      *----------------------------------------------------             00270009
       0000-PRINCIPAL                             SECTION.              00280009
      *----------------------------------------------------             00290009
           PERFORM 1000-INICIALIZAR.                                    00300009
           PERFORM 3000-FINALIZAR.                                      00300209
           STOP RUN.                                                    00300309
      *----------------------------------------------------             00300409
       0000-99-FIM.                                EXIT.                00300509
      *----------------------------------------------------             00300609
      *****************************************************             00300713
      *             I N I C I A L I Z A R                 *             00300813
      *****************************************************             00300913
      *----------------------------------------------------             00301009
       1000-INICIALIZAR                           SECTION.              00302009
      *----------------------------------------------------             00303009
                                                                        00304009
           ACCEPT WRK-DATA FROM SYSIN.                                  00305014
                                                                        00306009
      *----------------------------------------------------             00309109
       1000-99-FIM.                                EXIT.                00309309
      *----------------------------------------------------             00309409
      *****************************************************             00309513
      *               F I N A L I Z A R                   *             00309613
      *****************************************************             00309713
      *----------------------------------------------------             00320009
       3000-FINALIZAR                             SECTION.              00330009
      *----------------------------------------------------             00340009
           DISPLAY 'SAO PAULO, ' WRK-DIA ' DO '                         00351009
                    WRK-MES ' DE ' WRK-ANO.                             00352009
      *----------------------------------------------------             00360009
       3000-99-FIM.                                EXIT.                00370009
      *----------------------------------------------------             00380009
