      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR16CB16.                                            00040032
      *====================================================             00050033
      *             T R E I N A M E N T O                 *             00051033
      *====================================================             00052033
      * PROGRAMA......: FR16CB16.                         *             00053033
      *---------------------------------------------------*             00055033
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00056033
      * DATA..........: 05/05/2022                        *             00057033
      * EMPRESA.......: FOURSYS                           *             00058033
      * INSTRUTOR.....: IVAN SANCHES                      *             00059033
      *---------------------------------------------------*             00059133
      * OBJETIVO......: CALCULO DO FRETE PARA ESTADOS     *             00059233
      *                 UTILIZANDO IF E EVALUATE          *             00059333
      *                                                   *             00060033
      *----------------------------------------------------             00070033
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                             SECTION.               00090506
       SPECIAL-NAMES.                                                   00090606
           DECIMAL-POINT  IS COMMA.                                     00090706
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
       WORKING-STORAGE                           SECTION.               00091200
                                                                        00091310
       01 WRK-DADOS.                                                    00091400
          05 WRK-CODIGO    PIC 9(05)    VALUE ZEROS.                    00091516
          05 WRK-PRODUTO   PIC X(20)    VALUE SPACES.                   00091631
          05 WRK-VALOR     PIC 9(08)V99 VALUE ZEROS.                    00091730
          05 WRK-ESTADO    PIC X(02)    VALUE SPACES.                   00091816
                                                                        00091917
       77 WRK-FRETE        PIC 9(08)V99 COMP VALUE ZEROS.               00092029
       77 WRK-FLAG         PIC 9        VALUE 0.                        00092130
      *=================MASCARAS===========================             00092512
                                                                        00092612
       77 WRK-FRETE-ED     PIC ZZ.ZZZ.ZZ9,99.                           00092728
       77 WRK-VALOR-ED     PIC ZZ.ZZZ.ZZ9,99.                           00092831
                                                                        00092916
      *====================================================             00093300
       PROCEDURE                                 DIVISION.              00093400
      *====================================================             00093500
      *****************************************************             00093634
      *          R O T I N A   P R I N C I P A L          *             00093734
      *****************************************************             00093834
      *----------------------------------------------------             00093933
       0000-PRINCIPAL                             SECTION.              00094033
      *----------------------------------------------------             00094133
           PERFORM 1000-INICIALIZAR.                                    00094233
           PERFORM 2000-PROCESSAR.                                      00094333
           PERFORM 3000-FINALIZAR.                                      00094433
           STOP RUN.                                                    00094533
      *----------------------------------------------------             00094633
       0000-99-FIM.                                EXIT.                00094733
      *----------------------------------------------------             00094833
      *****************************************************             00094934
      *             I N I C I A L I Z A R                 *             00095034
      *****************************************************             00095134
      *----------------------------------------------------             00095233
       1000-INICIALIZAR                           SECTION.              00095333
      *----------------------------------------------------             00095433
           ACCEPT WRK-DADOS FROM SYSIN.                                 00095533
      *----------------------------------------------------             00095633
       1000-99-FIM.                                EXIT.                00095733
      *----------------------------------------------------             00095833
      *****************************************************             00095934
      *               P R O C E S S A R                   *             00096034
      *****************************************************             00096134
      *----------------------------------------------------             00096233
       2000-PROCESSAR                             SECTION.              00096333
      *----------------------------------------------------             00096433
           IF WRK-VALOR LESS 1000                                       00096533
              DISPLAY 'FRETE INDISPONIVEL, FAVOR RETIRAR NA LOJA'       00096633
           ELSE                                                         00097033
               EVALUATE WRK-ESTADO                                      00097133
                 WHEN 'SP'                                              00097233
                   COMPUTE WRK-FRETE = WRK-VALOR * 0,1                  00097333
                 WHEN 'RJ'                                              00097633
                   COMPUTE WRK-FRETE = WRK-VALOR * 0,15                 00097733
                 WHEN 'MG'                                              00098033
                   COMPUTE WRK-FRETE = WRK-VALOR * 0,2                  00098133
                 WHEN OTHER                                             00098233
                   DISPLAY 'NAO ENTREGAMOS NO SEU ESTADO'               00098333
                   MOVE 1 TO WRK-FLAG                                   00098433
               END-EVALUATE                                             00098533
           END-IF.                                                      00098633
           IF WRK-FLAG EQUAL 0                                          00098733
               MOVE WRK-FRETE TO WRK-FRETE-ED                           00099235
               MOVE WRK-VALOR TO WRK-VALOR-ED                           00099335
                                                                        00099430
                 DISPLAY 'CODIGO DO PRODUTO: ' WRK-CODIGO               00099535
                 DISPLAY 'PRODUTO          : ' WRK-PRODUTO              00099635
                 DISPLAY 'VALOR DO PRODUTO : ' WRK-VALOR-ED             00099735
                 DISPLAY 'ESTADO           : ' WRK-ESTADO               00099835
                 DISPLAY 'FRETE            : ' WRK-FRETE-ED             00099935
           END-IF.                                                      00100035
      *----------------------------------------------------             00110033
       2000-99-FIM.                                EXIT.                00120033
      *----------------------------------------------------             00130033
      *****************************************************             00131034
      *               F I N A L I Z A R                   *             00132034
      *****************************************************             00133034
      *----------------------------------------------------             00150033
       3000-FINALIZAR                             SECTION.              00160033
      *----------------------------------------------------             00170033
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00180033
      *----------------------------------------------------             00190033
       3000-99-FIM.                                EXIT.                00200033
      *----------------------------------------------------             00210033
