                      ___________________                               00000106
----------------------|LUCIANO GUIMARAES|------------------------------ 00000206
                       _________________                                00000306
-----------------------|PROGRAMAS COBOL|--------------------------------00000406
     |*FR16CB01: PRIMEIRO PROGRAMA - USO DE UM DISPLAY.                 00000504
     |*FR16CB02: DISPLAY DE NOME E SALARIO COM VARIAVEIS NA SYSIN.      00000604
     |*FR16CB03: QUEBRA DE VARIAVEL EM FILHOS E USO DE DISPLAY.         00000704
     |*FR16CB04: UTILIZACAO DE FILLER EM VARIAVEL.                      00000804
     |*FR16CB05: RECEBER UMA DATA DO SISTEMA E DAR DISPLAY.             00000904
     |*FR16CB06: RECEBER DADOS E UTILIZAR O REDEFINES E FILLER.         00001004
     |*FR16CB07: UTILIZACAO DE FILLER E REDEFINES PARA DISPLAY EXATO.   00001104
     |*FR16CB08: RECEBER DADOS NUMERICOS E UTILIZAR O ADD.              00001204
     |*FR16CB09: RECEBER DADOS NUMERICOS E UTILIZAR O ADD COM MASCARA.  00001304
     |*FR16CB10: CALCULAR DESCONTO UTILIZANDO SUBTRACT E MASCARAS.      00001404
     |*FR16CB11: CALCULAR NUMERO DE VENDAS UTILIZANDO DIVIDE.           00001504
     |*FR16CB12: CALCULAR VALOR DA COMISSAO POR VENDA USANDO MULTIPLY.  00001604
     |*FR16CB13: CALCULO DA QUANTIDADE DE VENDAS E MEDIA USANDO COMPUTE.00001804
     |*FR16CB14: CALCULO DA VANTAGEM GASOLINA E ALCOOL COM IF E DIVIDE. 00002004
     |*FR16CB15: CALCULO DO FRETE PARA ESTADOS USANDO IF.               00002104
     |*FR16CB16: CALCULO DO FRETE PARA ESTADOS USANDO IF E EVALUATE.    00002204
     |*FR16CB17: USO DE COMPUTE E EVALUATE PARA CALCULAR MEDIA DE NOTAS.00002304
     |*FR16CB18: USO DE VARIAVEL 88 COM IF E ELSE PARA DETALHAR A OPERA-00002404
     |*-CAO CONTABIL UTILIZADA.                                         00002504
     |*FR16CB19: CALCULO DA TABUADA INVERSA UTILIZANDO PERFORM TIMES.   00002604
     |*FR16CB20: CALCULO DA TABUADA INVERSA UTILIZANDO PERFORM TIMES E -00002704
     |*-SOMANDO O RESULTADO.                                            00002804
     |*FR16CB21: UTILIZACAO DO PERFORM UNTIL PARA LEITURA DE ITENS.     00002904
     |*FR16CB22: CALCULO DA TABUADA DE VARIOS NUMEROS RECEBIDOS PELA   -00003004
     |*-SYSIN UTILIZANDO PERFORM TIMES E UNTIL.                         00003104
     |*FR16CB23: CALCULO DA TABUADA DE UM NUMERO USANDO VARYING.        00003206
                   ________________________                             00003306
-------------------|TRATAMENTO DE ARQUIVOS|-----------------------------00003406
     |*ARQ1601 : LEITURA DE UM ARQUIVO E IMPRIMIR NA SYSOUT A QUANTIDADE00003506
     |*-DE REGISTROS LIDOS.                                             00003606
     |*ARQ1602 : LEITURA DE UM ARQUIVO E IMPRIMIR NA SYSOUT A QUANTIDADE00003706
     |*-DE REGISTROS LIDOS, DIFERENCIANDO O CARGO DE ANALISTA.          00003806
     |*ARQ1603 : LEITURA DE UM ARQUIVO E MOSTRAR NA SYSOUT A LISTA DE  -00003906
     |*-FUNCIONARIOS, REGISTROS LIDOS E SETOR INVALIDO.                 00004006
     |*ARQ1604 : LEITURA DE UM ARQUIVO COM NOTAS E ALUNOS, CALCULAR    -00004207
     |*-A MEDIA E GRAVAR EM UM ARQUIVO QUEM PASSOU POR MEDIA.           00004307
     |*GRAVALOG: PROGRAMA QUE GRAVA EM UM ARQUIVO O LOG DE COMPILACAO.  00004406
     |*FR16EX02: ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS DOS   -00004507
     |*-ARQUIVOS DE ENTRADA FUNC E PROJ, FAZER O BALANCE-LINE E GRAVAR  00004607
     |*-NO ARQUIVO DE SAIDA FUNPROJ.                                    00004707
     |*FR16EX03: ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS DOS   -00004807
     |*-ARQUIVOS DE ENTRADA CLIENTES E MOV310 FAZER O BALANCE-LINE      00004907
     |*-E GRAVAR NO ARQUIVO DE SAIDA CLI310                             00005007
     |*FR16EX04: ESTE PROGRAMA TEM A FINALIDADE DE RECEBER DADOS DOS   -00005107
     |*-ARQUIVOS DE ENTRADA CLIENTES E MOV0106 FAZER O BALANCE-LINE     00005207
     |*-E GRAVAR NOS ARQUIVOS DE SAIDA MOV0106A, MOV0106C.              00005307
                    _______________________                             00005407
--------------------|GERACAO DE RELATORIOS|-----------------------------00005507
     |*REL1601 : LEITURA DE UM ARQUIVO PRODUTOS E DISPLAY DE UM RELATORI00005607
     |*-O DOS PROTUDOS.                                                 00005707
     |*REL1602 : LEITURA DE UM ARQUIVO PRODUTOS E DISPLAY DE UM RELATORI00005807
     |*-O DOS PROTUDOS COM CONTAGEM DE LEITURAS.                        00005907
     |*REL1603 : LEITURA DE UM ARQUIVO PRODUTOS E DISPLAY DE UM RELATORI00006007
     |*-O DOS PROTUDOS COM CONTAGEM DE LEITURAS.                        00006107
     |*REL1604 : LEITURA DE UM ARQUIVO DE FUNCIONARIOS E DISPLAY DE UM -00006207
     |*-RELATORIO DOS FUNCIONARIOS LIDOS.                               00006307
     |*REL1605 : LEITURA DE UM ARQUIVO DE FUNCIONARIOS E DISPLAY DE UM -00006407
     |*-RELATORIO DOS FUNCIONARIOS LIDOS.                               00006507
     |*REL1605 : LEITURA DE UM ARQUIVO DE FUNCIONARIOS E GRAVACAO DO   -00006607
     |*-RELATORIO EM UM ARQUIVO.                                        00006707
     |*RELBENE : CRIACAO DE UM RELATORIO COM FUNCIONARIOS E PLANOS DE SA00006807
     |*-UDE E GRAVACAO EM UM ARQUIVO.                                   00006907
     |*FR16EX01: CRIACAO DE UM RELATORIO COM FUNCIONARIOS E E GRAVACAO  00007007
     |*-EM UM ARQUIVO.                                                  00007107
                    ___________________________                         00007207
--------------------|COBOL COM DB2,CICS E VSAM|-------------------------00008007
     |*FR16DB01: ACESSAR UMA TABELA DB2 E LER UM REGISTRO.              00009007
     |*FR16DB02: ACESSAR UMA TABELA DB2 E LER TODOS OS REGISTROS.       00010007
     |*FR16DB03: ACESSAR UMA TABELA DB2 E INSERIR UM REGISTRO.          00020007
     |*FR16DB04: ACESSAR UMA TABELA DB2 E DELETAR UM REGISTRO.          00030007
     |*FR16DB05: ACESSAR UMA TABELA DB2 E ATUALIZAR UM REGISTRO.        00040007
     |*FR16DB06: ACESSAR UMA TABELA DB2 E GRAVAR INFORMACOES EM UM     -00050007
     |*-ARQUIVO.                                                        00051007
     |*FR16DB07: ACESSAR UMA TABELA DB2 E UTILIZAR CURSOR,JOIN.         00060007
     |*FR16DB08: ACESSAR UMA TABELA DB2 E UTILIZAR CURSOR,JOIN.         00070007
     |*FR16DB09: ACESSAR UMA TABELA DB2 E UTILIZAR CURSOR,    -         00072007
     |*-LEFT EXCLUDE JOIN.                                              00073007
     |*FR16JOIN: LEITURA DE ARQUIVOS DB2 E USO DE JOIN COM GRAVACAO EM  00074007
     |*-UM ARQUIVO.                                                     00075007
     |*FR16LVSR: LEITURA DE UM ARQUIVO VSAM E DISPLAY DE DADOS LIDOS.   00090007
     |*FR16LVSW: LEITURA DE UM ARQUIVO VSAM E INCLUSAO DE DADOS.        00100007
     |*F16CIM1 : MAPA BMS PARA UTILIZACAO DE PROGRAMA NO CICS.          00110007
     |*FR1CIP1 : INVOCAR UM MAPA BMS RELACIONADO COM UM ARQUIVO DB2 E  -00120007
     |*-REALIZAR FUNCOES ESCOLHIDAS PELO USUARIO(DELETE, INSERT, SELECT)00130007
     |*FR1CIP2 : INVOCAR UM MAPA BMS RELACIONADO COM UM ARQUIVO DB2 E  -00140007
     |*-REALIZAR FUNCOES ESCOLHIDAS PELO USUARIO(DELETE, INSERT, SELECT)00150007
     |*-COM LOGICA PSEUDO PARA SAIDA DA ROTINA CICS SEM ABEND.          00160007
     |*FR1CIP3 : REALIZA UM CALL ENTRE DOIS PROGRAMAS UTILIZANDO CICS  -00170007
     |*-LINK.                                                           00180007
     |*FR1COVS : REALIZA UM CALL ENTRE DOIS PROGRAMAS UTILIZANDO CICS  -00181007
     |*-LINK.                                                           00182007
