      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. REL1604.                                             00040048
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: REL1604.                          *             00064048
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 29/06/2022                        *             00068041
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E CRIAR UM  *             00069341
      *                 RELATORIO COM LEITURA TOTAL       *             00069443
      *                                                   *             00070041
      *---------------------------------------------------*             00080031
      *  ARQUIVOS   :                                     *             00090031
      *   DDNAME          I/O             INCLUDE/BOOK    *             00100031
      *   RELFUNC          I                    -         *             00101046
      *===================================================*             00102031
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT RELFUNC  ASSIGN TO RELFUNC                           00133445
                FILE STATUS IS WRK-FS-RELFUNC.                          00133545
                                                                        00133633
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD RELFUNC                                                       00137345
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137641
      *-LRECL: 45-                                                      00137752
                                                                        00137841
        01 FD-RELFUNC.                                                  00137945
           05 FD-ID      PIC 9(05).                                     00138045
           05 FD-NOME    PIC X(30).                                     00138145
           05 FD-SETOR   PIC X(04).                                     00138245
           05 FD-SALARIO PIC 9(06).                                     00138345
                                                                        00138445
                                                                        00138548
                                                                        00138648
                                                                        00138748
                                                                        00138848
      *----------------------------------------------------             00138913
       WORKING-STORAGE                           SECTION.               00139001
      *----------------------------------------------------             00139101
      *----------------------------------------------------             00139240
       01 FILLER              PIC X(70) VALUE                           00139340
              '---------GRAVALOG-----------------'.                     00139440
                                                                        00139540
           COPY '#GLOG'.                                                00139640
                                                                        00139740
                                                                        00139840
       77 WRK-ERRORLOG        PIC X(08) VALUE 'ERRORLOG'.               00139940
                                                                        00140026
      *----------------------------------------------------             00140143
       01 FILLER              PIC X(70) VALUE                           00140226
              '---------VARIAVEL DADOS E STATUS--'.                     00140333
                                                                        00140445
       01 WRK-RELFUNC.                                                  00140545
          05 WRK-ID      PIC 9(05).                                     00140645
          05 FILLER      PIC X(04) VALUE SPACES.                        00140748
          05 WRK-NOME    PIC X(30).                                     00140845
          05 WRK-SETOR   PIC X(04).                                     00141048
          05 FILLER      PIC X(07) VALUE SPACES.                        00141148
          05 WRK-SALARIO PIC 9(06).                                     00141245
                                                                        00141345
       01 WRK-CABECALHO.                                                00141449
          05 FILLER      PIC X(10) VALUE SPACES.                        00141545
          05 WRK-CABEC   PIC X(40) VALUE 'RELATORIO DE FUNCIONARIOS'.   00141645
          05 WRK-PAG     PIC X(05) VALUE 'PAG: '.                       00141749
          05 WRK-PAGINA  PIC 9(02) VALUE 1.                             00141849
                                                                        00141948
       01 WRK-CABECALHO-2.                                              00142049
          05 WRK-IDD      PIC X(02) VALUE 'ID'.                         00142145
          05 FILLER       PIC X(07) VALUE SPACES.                       00142245
          05 WRK-NOMEE    PIC X(30) VALUE 'NOME'.                       00142345
          05 WRK-SETORR   PIC X(06) VALUE 'SETOR'.                      00142445
          05 FILLER       PIC X(05) VALUE SPACES.                       00142548
          05 WRK-SALARIOO PIC X(07) VALUE 'SALARIO'.                    00142645
                                                                        00142738
       77 WRK-FS-RELFUNC      PIC 9(02).                                00142846
       77 WRK-SPACES          PIC X(30) VALUE SPACES.                   00142941
       77 WRK-REG-LIDOS       PIC 9(02).                                00143043
       77 WRK-CONTA-REG       PIC 9(02).                                00143149
       77 WRK-SALARIO-TOTAL   PIC 9(07).                                00143245
       77 WRK-SALARIO-PAGINA  PIC 9(07).                                00143351
                                                                        00144041
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 7000-TESTA-VAZIO                                    00157336
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-RELFUNC EQUAL 10.       00157446
            PERFORM 3000-FINALIZAR.                                     00157514
            STOP RUN.                                                   00157634
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT RELFUNC.                                         00159151
                                                                        00159334
            PERFORM 4000-TESTAR-STATUS.                                 00159434
            PERFORM 3500-IMPRIME-CABECALHO.                             00159549
            READ RELFUNC.                                               00159946
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
            IF WRK-CONTA-REG EQUAL 4                                    00164249
              DISPLAY WRK-SPACES                                        00164351
              DISPLAY 'TOTAL DA PAGINA : ' WRK-SALARIO-PAGINA           00164451
              ADD 1 TO WRK-PAGINA                                       00164548
              PERFORM 3500-IMPRIME-CABECALHO                            00164649
              MOVE 0 TO WRK-CONTA-REG                                   00164850
              MOVE 0 TO WRK-SALARIO-PAGINA                              00165051
            END-IF.                                                     00165149
              ADD 1 TO WRK-REG-LIDOS                                    00165248
              ADD 1 TO WRK-CONTA-REG                                    00165349
              ADD FD-SALARIO TO WRK-SALARIO-TOTAL                       00165449
              ADD FD-SALARIO TO WRK-SALARIO-PAGINA                      00165551
              MOVE FD-ID TO WRK-ID                                      00165649
              MOVE FD-NOME TO WRK-NOME                                  00165749
              MOVE FD-SETOR TO WRK-SETOR                                00165849
              MOVE FD-SALARIO TO WRK-SALARIO                            00165949
              DISPLAY WRK-RELFUNC                                       00166048
            READ RELFUNC.                                               00167049
      *                                                                 00167151
      *----------------------------------------------------             00167806
       2000-99-FIM.                                EXIT.                00167906
      *----------------------------------------------------             00168006
      *****************************************************             00168106
      *               F I N A L I Z A R                   *             00168206
      *****************************************************             00168306
      *----------------------------------------------------             00168406
       3000-FINALIZAR                             SECTION.              00168506
      *----------------------------------------------------             00168606
            CLOSE RELFUNC.                                              00169047
            PERFORM 4000-TESTAR-STATUS.                                 00169140
            DISPLAY WRK-SPACES                                          00169251
            DISPLAY 'TOTAL DA PAGINA : ' WRK-SALARIO-PAGINA             00169351
            DISPLAY WRK-SPACES.                                         00169443
            DISPLAY 'TOTAL DE REGISTROS LIDOS: ' WRK-REG-LIDOS.         00169543
            DISPLAY 'TOTAL DE SALARIOS       : ' WRK-SALARIO-TOTAL.     00169649
            DISPLAY WRK-SPACES.                                         00169749
            DISPLAY '-----FIM DE PROCESSAMENTO----'.                    00170040
      *----------------------------------------------------             00170823
       3000-99-FIM.                                  EXIT.              00170923
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00260015
       3500-IMPRIME-CABECALHO                     SECTION.              00270049
      *----------------------------------------------------             00280015
            DISPLAY WRK-SPACES                                          00290049
            DISPLAY WRK-CABECALHO                                       00300049
            DISPLAY WRK-SPACES                                          00301049
            DISPLAY WRK-CABECALHO-2.                                    00302049
      *----------------------------------------------------             00310021
       3500-99-FIM.                                  EXIT.              00320049
      *----------------------------------------------------             00330021
      *----------------------------------------------------             00331049
       4000-TESTAR-STATUS                         SECTION.              00332049
      *----------------------------------------------------             00333049
             IF WRK-FS-RELFUNC NOT EQUAL 0                              00334049
               MOVE '4000'                TO WRK-SECAO                  00335049
               MOVE 'ERRO NO OPEN RELFUNC' TO WRK-MENSAGEM              00336049
               MOVE WRK-FS-RELFUNC        TO WRK-STATUS                 00337049
               PERFORM 8000-TRATA-ERROS                                 00338049
            END-IF.                                                     00339049
      *----------------------------------------------------             00339149
       4000-99-FIM.                                  EXIT.              00339249
      *----------------------------------------------------             00339349
      *----------------------------------------------------             00340034
       7000-TESTA-VAZIO                           SECTION.              00350035
      *----------------------------------------------------             00360034
            IF WRK-FS-RELFUNC EQUAL 10                                  00370046
              DISPLAY 'FIM DO ARQUIVO'                                  00380035
              GO TO 3000-FINALIZAR                                      00390035
            END-IF.                                                     00400034
      *----------------------------------------------------             00410034
       7000-99-FIM.                                  EXIT.              00420046
      *----------------------------------------------------             00430034
      *----------------------------------------------------             00440035
       8000-TRATA-ERROS                           SECTION.              00450046
      *----------------------------------------------------             00460035
            MOVE 'REL1601'   TO    WRK-PROGRAMA.                        00470042
            CALL WRK-ERRORLOG USING WRK-DADOS.                          00480040
            DISPLAY WRK-DADOS.                                          00490039
            GOBACK.                                                     00500039
      *----------------------------------------------------             00510035
       8000-99-FIM.                                  EXIT.              00520046
      *----------------------------------------------------             00530035
