      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. REL1603.                                             00040044
      *====================================================             00061000
      *             T R E I N A M E N T O                 *             00062000
      *====================================================             00063000
      * PROGRAMA......: REL1603.                          *             00064044
      *---------------------------------------------------*             00066000
      * PROGRAMADOR...: LUCIANO GUIMARAES.                *             00067000
      * DATA..........: 29/06/2022                        *             00068041
      * EMPRESA.......: FOURSYS                           *             00069000
      * INSTRUTOR.....: IVAN SANCHES                      *             00069100
      *---------------------------------------------------*             00069200
      * OBJETIVO......: LEITURA DE UM ARQUIVO E CRIAR UM  *             00069341
      *                 RELATORIO COM LEITURA TOTAL       *             00069443
      *                                                   *             00070041
      *---------------------------------------------------*             00080031
      *  ARQUIVOS   :                                     *             00090031
      *   DDNAME          I/O             INCLUDE/BOOK    *             00100031
      *   PRODUTOS         I                    -         *             00101041
      *===================================================*             00102031
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133112
       INPUT-OUTPUT                              SECTION.               00133212
       FILE-CONTROL.                                                    00133312
            SELECT PRODUTOS ASSIGN TO PRODUTOS                          00133441
                FILE STATUS IS WRK-FS-PRODUTOS.                         00133541
                                                                        00133633
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
       FILE                                      SECTION.               00137113
      *----------------------------------------------------             00137213
       FD PRODUTOS                                                      00137341
           RECORDING MODE IS F                                          00137413
           BLOCK CONTAINS 0 RECORDS.                                    00137513
                                                                        00137641
      *-LRECL: 29-                                                      00137741
                                                                        00137841
        01 FD-PRODUTOS.                                                 00137941
           05 FD-CODIGO PIC X(04).                                      00138041
           05 FD-ITEM   PIC X(20).                                      00138141
           05 FD-QUANT  PIC 9(05).                                      00138241
                                                                        00138333
      *----------------------------------------------------             00138713
       WORKING-STORAGE                           SECTION.               00138801
      *----------------------------------------------------             00138901
      *----------------------------------------------------             00139040
       01 FILLER              PIC X(70) VALUE                           00139140
              '---------GRAVALOG-----------------'.                     00139240
                                                                        00139340
           COPY '#GLOG'.                                                00139440
                                                                        00139540
                                                                        00139640
       77 WRK-ERRORLOG        PIC X(08) VALUE 'ERRORLOG'.               00139740
                                                                        00139826
      *----------------------------------------------------             00139943
       01 FILLER              PIC X(70) VALUE                           00140026
              '---------VARIAVEL DADOS E STATUS--'.                     00140133
                                                                        00140238
       77 WRK-FS-PRODUTOS     PIC 9(02).                                00141641
       77 WRK-SPACES          PIC X(30) VALUE SPACES.                   00141741
       77 WRK-REG-LIDOS       PIC 9(02).                                00141843
                                                                        00141941
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *****************************************************             00155100
      *          R O T I N A   P R I N C I P A L          *             00155200
      *****************************************************             00155300
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
            PERFORM 1000-INICIALIZAR                                    00157214
            PERFORM 7000-TESTA-VAZIO                                    00157336
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-PRODUTOS EQUAL 10.      00157441
            PERFORM 3000-FINALIZAR.                                     00157514
            STOP RUN.                                                   00157634
      *----------------------------------------------------             00158200
       0000-99-FIM.                               EXIT.                 00158300
      *----------------------------------------------------             00158400
      *****************************************************             00158500
      *             I N I C I A L I Z A R                 *             00158600
      *****************************************************             00158700
      *----------------------------------------------------             00158800
       1000-INICIALIZAR                           SECTION.              00158900
      *----------------------------------------------------             00159000
            OPEN INPUT PRODUTOS.                                        00159141
                                                                        00159334
            PERFORM 4000-TESTAR-STATUS.                                 00159434
            READ PRODUTOS.                                              00159541
      *----------------------------------------------------             00160400
       1000-99-FIM.                                 EXIT.               00160500
      *----------------------------------------------------             00161000
      *****************************************************             00163606
      *               P R O C E S S A R                   *             00163706
      *****************************************************             00163806
      *----------------------------------------------------             00163906
       2000-PROCESSAR                             SECTION.              00164006
      *----------------------------------------------------             00164106
            ADD 1 TO WRK-REG-LIDOS.                                     00164243
                                                                        00164340
            DISPLAY FD-PRODUTOS.                                        00165741
                                                                        00167540
            READ PRODUTOS.                                              00167641
      *----------------------------------------------------             00167706
       2000-99-FIM.                                EXIT.                00167806
      *----------------------------------------------------             00167906
      *****************************************************             00168006
      *               F I N A L I Z A R                   *             00168106
      *****************************************************             00168206
      *----------------------------------------------------             00168306
       3000-FINALIZAR                             SECTION.              00168406
      *----------------------------------------------------             00168506
            CLOSE PRODUTOS.                                             00168941
            PERFORM 4000-TESTAR-STATUS.                                 00169040
            DISPLAY WRK-SPACES.                                         00169143
            DISPLAY 'TOTAL DE REGISTROS LIDOS: ' WRK-REG-LIDOS.         00169243
            DISPLAY WRK-SPACES.                                         00169340
            DISPLAY '-----FIM DE PROCESSAMENTO----'.                    00170040
      *----------------------------------------------------             00170823
       3000-99-FIM.                                  EXIT.              00170923
      *----------------------------------------------------             00171000
      *----------------------------------------------------             00260015
       4000-TESTAR-STATUS                         SECTION.              00270034
      *----------------------------------------------------             00280015
             IF WRK-FS-PRODUTOS NOT EQUAL 0                             00290041
               MOVE '4000'                TO WRK-SECAO                  00291135
               MOVE 'ERRO NO OPEN PRODUTOS' TO WRK-MENSAGEM             00291241
               MOVE WRK-FS-PRODUTOS       TO WRK-STATUS                 00291341
               PERFORM 7000-TRATA-ERROS                                 00291435
            END-IF.                                                     00293041
      *----------------------------------------------------             00310021
       4000-99-FIM.                                  EXIT.              00320021
      *----------------------------------------------------             00330021
      *----------------------------------------------------             00340034
       7000-TESTA-VAZIO                           SECTION.              00350035
      *----------------------------------------------------             00360034
            IF WRK-FS-PRODUTOS EQUAL 10                                 00370041
              DISPLAY 'FIM DO ARQUIVO'                                  00380035
              GO TO 3000-FINALIZAR                                      00390035
            END-IF.                                                     00400034
      *----------------------------------------------------             00410034
       5000-99-FIM.                                  EXIT.              00420034
      *----------------------------------------------------             00430034
      *----------------------------------------------------             00440035
       7000-TRATA-ERROS                           SECTION.              00450035
      *----------------------------------------------------             00460035
            MOVE 'REL1601'   TO    WRK-PROGRAMA.                        00470042
            CALL WRK-ERRORLOG USING WRK-DADOS.                          00480040
            DISPLAY WRK-DADOS.                                          00490039
            GOBACK.                                                     00500039
      *----------------------------------------------------             00510035
       5000-99-FIM.                                  EXIT.              00520035
      *----------------------------------------------------             00530035
