//FOUR016X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID             00010012
// JCLLIB ORDER=PR.FOUR016.PROCLIB                                      00130074
//COBCOMP  EXEC DFHCOB2,NOME='FR16CB23'                                 00140079
//SYSTERM  DD  SYSOUT=*                                                 00141002
//LKED.SYSIN    DD   *                                                  00150000
  NAME FR16CB23(R)                                                      00160079
//*--------------------------------------------------------------------*00170000
//*          FIM JOB DE COMPILACAO COBOL BATCH                         *00180000
//*--------------------------------------------------------------------*00190000
