//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010096
//EXECUTAR EXEC PGM=FR16CB03                                            00140093
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
1234567LUCIANO E GUIMARAES F  TAMBAU    PB12345                         00170095
