//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR16CB23                                            00140099
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160099
256565986025000003                                                      00170099
223565986006000002                                                      00180099
245565986032000005                                                      00190099
9999                                                                    00200099
