//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR16CB10                                            00140099
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
TELEVISOR 10 POL    980505000                                           00170099
