//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR16CB07                                            00140099
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
12254LUCIANO E G FILHO  R SEVERINO MASSA SPINELLI 270 TAMBAU PB         00170099
