//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010098
//EXECUTAR EXEC PGM=FR16CB04                                            00140096
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
12345TELEVISOR ULTRA HD SAMSUNG              098570                     00170097
