//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR16CB05                                            00140098
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
20220519                                                                00170098
