//FOUR016X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR16CB14                                            00140099
//STEPLIB  DD DSN=PR.FOUR016.OBJ,DISP=SHR                               00150039
//SYSIN    DD *                                                         00160028
07120620                                                                00170099
